tinygo-org/stm32-svd/svd/stm32wle5.svd
<!--
Copyright (c) 2020 STMicroelectronics.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
--><device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xsi:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
   <name>STM32WLE5</name>
   <version>1.4</version>
   <description>STM32WLE5_CM4</description>  
   <cpu>
    <name>CM4</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
   </cpu>      
   <addressUnitBits>8</addressUnitBits>  
   <width>32</width>  
   <size>0x20</size>
   <resetValue>0x0</resetValue>
   <resetMask>0xFFFFFFFF</resetMask>
   <peripherals>
      <peripheral>
         <name>ADC</name>
         <description>Analog to digital convertor</description>
         <groupName>ADC</groupName>
         <baseAddress>0x40012400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ADC</name>
            <description>ADC global interrupt</description>
            <value>18</value>
         </interrupt>
         <registers>
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>ADC interrupt and status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADRDY</name>
                     <description>ADRDY</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADRDYR</name><usage>read</usage><enumeratedValue><name>NotReady</name><description>ADC not yet ready to start conversion</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>ADC ready to start conversion</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADRDYW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the ADC ready flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EOSMP</name>
                     <description>EOSMP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOSMPR</name><usage>read</usage><enumeratedValue><name>NotAtEnd</name><description>Not at the end of the samplings phase</description><value>0</value></enumeratedValue><enumeratedValue><name>AtEnd</name><description>End of sampling phase reached</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>EOSMPW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the sampling phase flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EOC</name>
                     <description>EOC</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOCR</name><usage>read</usage><enumeratedValue><name>NotComplete</name><description>Channel conversion is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Channel conversion complete</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>EOCW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the channel conversion flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EOS</name>
                     <description>EOS</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOSR</name><usage>read</usage><enumeratedValue><name>NotComplete</name><description>Conversion sequence is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Conversion sequence complete</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>EOSW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the conversion sequence flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OVR</name>
                     <description>OVR</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OVRR</name><usage>read</usage><enumeratedValue><name>NoOverrun</name><description>No overrun occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Overrun occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>OVRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the overrun flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AWD1</name>
                     <description>AWD1</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>AWD1R</name><usage>read</usage><enumeratedValue><name>NoEvent</name><description>No analog watchdog event occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Event</name><description>Analog watchdog event occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>AWD1W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the analog watchdog event flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AWD2</name>
                     <description>AWD2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="AWD1R"/>
            <enumeratedValues derivedFrom="AWD1W"/>
            </field>
                  <field>
                     <name>AWD3</name>
                     <description>AWD3</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="AWD1R"/>
            <enumeratedValues derivedFrom="AWD1W"/>
            </field>
                  <field>
                     <name>EOCAL</name>
                     <description>EOCAL</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOCALR</name><usage>read</usage><enumeratedValue><name>NotComplete</name><description>Calibration is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Calibration complete</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>EOCALW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the calibration flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CCRDY</name>
                     <description>CCRDY</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CCRDYR</name><usage>read</usage><enumeratedValue><name>NotComplete</name><description>Channel configuration update not applied</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Channel configuration update is applied</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>CCRDYW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the channel configuration flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <displayName>IER</displayName>
               <description>ADC interrupt enable register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADRDYIE</name>
                     <description>ADRDYIE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADRDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ADRDY interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ADRDY interrupt enabled. An interrupt is generated when the ADRDY bit is set.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EOSMPIE</name>
                     <description>EOSMPIE</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOSMPIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>EOSMP interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>EOSMP interrupt enabled. An interrupt is generated when the EOSMP bit is set.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EOCIE</name>
                     <description>EOCIE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>EOC interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>EOC interrupt enabled. An interrupt is generated when the EOC bit is set.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EOSIE</name>
                     <description>EOSIE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOSIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>EOS interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>EOS interrupt enabled. An interrupt is generated when the EOS bit is set.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OVRIE</name>
                     <description>OVRIE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OVRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Overrun interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Overrun interrupt enabled. An interrupt is generated when the OVR bit is set.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AWD1IE</name>
                     <description>AWD1IE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>AWD1IE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Analog watchdog interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Analog watchdog interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AWD2IE</name>
                     <description>AWD2IE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="AWD1IE"/>
            </field>
                  <field>
                     <name>AWD3IE</name>
                     <description>AWD3IE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="AWD1IE"/>
            </field>
                  <field>
                     <name>EOCALIE</name>
                     <description>EOCALIE</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOCALIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>End of calibration interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>End of calibration interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CCRDYIE</name>
                     <description>CCRDYIE</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CCRDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Channel configuration ready interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Channel configuration ready interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>ADC control register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADEN</name>
                     <description>ADEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADENR</name><usage>read</usage><enumeratedValue><name>Disabled</name><description>ADC disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ADC enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADENW</name><usage>write</usage><enumeratedValue><name>Enabled</name><description>Enable the ADC</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ADDIS</name>
                     <description>ADDIS</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADDISR</name><usage>read</usage><enumeratedValue><name>NotDisabling</name><description>No disable command active</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabling</name><description>ADC disabling</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADDISW</name><usage>write</usage><enumeratedValue><name>Disable</name><description>Disable the ADC</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ADSTART</name>
                     <description>ADSTART</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADSTARTR</name><usage>read</usage><enumeratedValue><name>NotActive</name><description>No conversion ongoing</description><value>0</value></enumeratedValue><enumeratedValue><name>Active</name><description>ADC operating and may be converting</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADSTARTW</name><usage>write</usage><enumeratedValue><name>StartConversion</name><description>Start the ADC conversion (may be delayed for hardware triggers)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ADSTP</name>
                     <description>ADSTP</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADSTPR</name><usage>read</usage><enumeratedValue><name>NotStopping</name><description>No stop command active</description><value>0</value></enumeratedValue><enumeratedValue><name>Stopping</name><description>ADC stopping conversion</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADSTPW</name><usage>write</usage><enumeratedValue><name>StopConversion</name><description>Stop the active conversion</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ADVREGEN</name>
                     <description>ADVREGEN</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADVREGEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ADC voltage regulator disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ADC voltage regulator enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ADCAL</name>
                     <description>ADCAL</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADCALR</name><usage>read</usage><enumeratedValue><name>NotCalibrating</name><description>ADC calibration either not yet performed or completed</description><value>0</value></enumeratedValue><enumeratedValue><name>Calibrating</name><description>ADC calibration in progress</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ADCALW</name><usage>write</usage><enumeratedValue><name>StartCalibration</name><description>Start the ADC calibration sequence</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
