tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CFGR1</name>
               <displayName>CFGR1</displayName>
               <description>ADC configuration register 1</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMAEN</name>
                     <description>DMAEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DMACFG</name>
                     <description>DMACFG</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DMACFG</name><usage>read-write</usage><enumeratedValue><name>OneShot</name><description>DMA one shot mode selected</description><value>0</value></enumeratedValue><enumeratedValue><name>Circular</name><description>DMA circular mode selected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SCANDIR</name>
                     <description>SCANDIR</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SCANDIR</name><usage>read-write</usage><enumeratedValue><name>Upward</name><description>Upward scan (from CHSEL0 to CHSEL17)</description><value>0</value></enumeratedValue><enumeratedValue><name>Backward</name><description>Backward scan (from CHSEL17 to CHSEL0)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RES</name>
                     <description>RES</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>RES</name><usage>read-write</usage><enumeratedValue><name>Bits12</name><description>12 bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits10</name><description>10 bits</description><value>1</value></enumeratedValue><enumeratedValue><name>Bits8</name><description>8 bits</description><value>2</value></enumeratedValue><enumeratedValue><name>Bits6</name><description>6 bits</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ALIGN</name>
                     <description>ALIGN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ALIGN</name><usage>read-write</usage><enumeratedValue><name>Right</name><description>Right alignment</description><value>0</value></enumeratedValue><enumeratedValue><name>Left</name><description>Left alignment</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTSEL</name>
                     <description>EXTSEL</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTSEL</name><usage>read-write</usage><enumeratedValue><name>TIM1_TRGO</name><description>Timer 1 TRGO event</description><value>0</value></enumeratedValue><enumeratedValue><name>TIM1_CC4</name><description>Timer 1 CC4 event</description><value>1</value></enumeratedValue><enumeratedValue><name>TIM2_TRGO</name><description>Timer 2 TRGO event</description><value>2</value></enumeratedValue><enumeratedValue><name>TIM2_CH4</name><description>Timer 2 CH4 event</description><value>3</value></enumeratedValue><enumeratedValue><name>TIM2_CH3</name><description>Timer 2 CH3 event</description><value>5</value></enumeratedValue><enumeratedValue><name>EXTI_LINE11</name><description>EXTI line 11 event</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTEN</name>
                     <description>EXTEN</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>EXTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Hardware trigger detection disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Hardware trigger detection on the rising edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Hardware trigger detection on the falling edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Hardware trigger detection on both the rising and falling edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OVRMOD</name>
                     <description>OVRMOD</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OVRMOD</name><usage>read-write</usage><enumeratedValue><name>Preserve</name><description>ADC_DR register is preserved with the old data when an overrun is detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Overwrite</name><description>ADC_DR register is overwritten with the last conversion result when an overrun is detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CONT</name>
                     <description>CONT</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CONT</name><usage>read-write</usage><enumeratedValue><name>Single</name><description>Single conversion mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Continuous</name><description>Continuous conversion mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WAIT</name>
                     <description>WAIT</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WAIT</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wait conversion mode off</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wait conversion mode on</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AUTOFF</name>
                     <description>AUTOFF</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>AUTOFF</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Auto-off mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Auto-off mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DISCEN</name>
                     <description>DISCEN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DISCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Discontinuous mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Discontinuous mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CHSELRMOD</name>
                     <description>CHSELRMOD</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CHSELRMOD</name><usage>read-write</usage><enumeratedValue><name>BitPerInput</name><description>Each bit of the ADC_CHSELR register enables an input</description><value>0</value></enumeratedValue><enumeratedValue><name>Sequence</name><description>ADC_CHSELR register is able to sequence up to 8 channels</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AWD1SGL</name>
                     <description>AWD1SGL</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>AWD1SGL</name><usage>read-write</usage><enumeratedValue><name>AllChannels</name><description>Analog watchdog 1 enabled on all channels</description><value>0</value></enumeratedValue><enumeratedValue><name>SingleChannel</name><description>Analog watchdog 1 enabled on a single channel</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AWD1EN</name>
                     <description>AWD1EN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>AWD1EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Analog watchdog 1 disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Analog watchdog 1 enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AWD1CH</name>
                     <description>AWD1CH</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>17</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CFGR2</name>
               <displayName>CFGR2</displayName>
               <description>ADC configuration register 2</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OVSE</name>
                     <description>OVSE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OVSE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Oversampler disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Oversampler enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TOVS</name>
                     <description>TOVS</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TOVS</name><usage>read-write</usage><enumeratedValue><name>TriggerAll</name><description>All oversampled conversions for a channel are done consecutively after a trigger</description><value>0</value></enumeratedValue><enumeratedValue><name>TriggerEach</name><description>Each oversampled conversion for a channel needs a trigger</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LFTRIG</name>
                     <description>LFTRIG</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LFTRIG</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Low Frequency Trigger Mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Low Frequency Trigger Mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CKMODE</name>
                     <description>CKMODE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CKMODE</name><usage>read-write</usage><enumeratedValue><name>ADCLK</name><description>ADCCLK (Asynchronous clock mode)</description><value>0</value></enumeratedValue><enumeratedValue><name>PCLK_Div2</name><description>PCLK/2 (Synchronous clock mode)</description><value>1</value></enumeratedValue><enumeratedValue><name>PCLK_Div4</name><description>PCLK/4 (Synchronous clock mode)</description><value>2</value></enumeratedValue><enumeratedValue><name>PCLK</name><description>PCLK (Synchronous clock mode)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               <field><name>OVSS</name><description>OVSS0</description><bitOffset>5</bitOffset><bitWidth>4</bitWidth><enumeratedValues><name>OVSS</name><usage>read-write</usage><enumeratedValue><name>NoShift</name><description>No shift</description><value>0</value></enumeratedValue><enumeratedValue><name>Shift1</name><description>Shift 1-bit</description><value>1</value></enumeratedValue><enumeratedValue><name>Shift2</name><description>Shift 2-bits</description><value>2</value></enumeratedValue><enumeratedValue><name>Shift3</name><description>Shift 3-bits</description><value>3</value></enumeratedValue><enumeratedValue><name>Shift4</name><description>Shift 4-bits</description><value>4</value></enumeratedValue><enumeratedValue><name>Shift5</name><description>Shift 5-bits</description><value>5</value></enumeratedValue><enumeratedValue><name>Shift6</name><description>Shift 6-bits</description><value>6</value></enumeratedValue><enumeratedValue><name>Shift7</name><description>Shift 7-bits</description><value>7</value></enumeratedValue><enumeratedValue><name>Shift8</name><description>Shift 8-bits</description><value>8</value></enumeratedValue></enumeratedValues>
            </field><field><name>OVSR</name><description>OVSR0</description><bitOffset>2</bitOffset><bitWidth>3</bitWidth><enumeratedValues><name>OVSR</name><usage>read-write</usage><enumeratedValue><name>Mul2</name><description>2x</description><value>0</value></enumeratedValue><enumeratedValue><name>Mul4</name><description>4x</description><value>1</value></enumeratedValue><enumeratedValue><name>Mul8</name><description>8x</description><value>2</value></enumeratedValue><enumeratedValue><name>Mul16</name><description>16x</description><value>3</value></enumeratedValue><enumeratedValue><name>Mul32</name><description>32x</description><value>4</value></enumeratedValue><enumeratedValue><name>Mul64</name><description>64x</description><value>5</value></enumeratedValue><enumeratedValue><name>Mul128</name><description>128x</description><value>6</value></enumeratedValue><enumeratedValue><name>Mul256</name><description>256x</description><value>7</value></enumeratedValue></enumeratedValues>
            </field></fields>
            </register>
            <register>
               <name>SMPR</name>
               <displayName>SMPR</displayName>
               <description>ADC sampling time register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMP1</name>
                     <description>SMP1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>SMP1</name><usage>read-write</usage><enumeratedValue><name>Cycles1_5</name><description>1.5 ADC clock cycles</description><value>0</value></enumeratedValue><enumeratedValue><name>Cycles3_5</name><description>3.5 ADC clock cycles</description><value>1</value></enumeratedValue><enumeratedValue><name>Cycles7_5</name><description>7.5 ADC clock cycles</description><value>2</value></enumeratedValue><enumeratedValue><name>Cycles12_5</name><description>12.5 ADC clock cycles</description><value>3</value></enumeratedValue><enumeratedValue><name>Cycles19_5</name><description>19.5 ADC clock cycles</description><value>4</value></enumeratedValue><enumeratedValue><name>Cycles39_5</name><description>39.5 ADC clock cycles</description><value>5</value></enumeratedValue><enumeratedValue><name>Cycles79_5</name><description>79.5 ADC clock cycles</description><value>6</value></enumeratedValue><enumeratedValue><name>Cycles160_5</name><description>160.5 ADC clock cycles</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SMP2</name>
                     <description>SMP2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues derivedFrom="SMP1"/>
            </field>
                  <field><name>SMPSEL0</name><description>SMPSEL</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>SMPSEL0</name><usage>read-write</usage><enumeratedValue><name>Smp1</name><description>Sampling time of CHANNELx use the setting of SMP1 register</description><value>0</value></enumeratedValue><enumeratedValue><name>Smp2</name><description>Sampling time of CHANNELx use the setting of SMP2 register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field><field><name>SMPSEL1</name><description>SMPSEL</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL2</name><description>SMPSEL</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL3</name><description>SMPSEL</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL4</name><description>SMPSEL</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL5</name><description>SMPSEL</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL6</name><description>SMPSEL</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL7</name><description>SMPSEL</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL8</name><description>SMPSEL</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL9</name><description>SMPSEL</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL10</name><description>SMPSEL</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL11</name><description>SMPSEL</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL12</name><description>SMPSEL</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL13</name><description>SMPSEL</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL14</name><description>SMPSEL</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL15</name><description>SMPSEL</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL16</name><description>SMPSEL</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field><field><name>SMPSEL17</name><description>SMPSEL</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SMPSEL0"/>
            </field></fields>
            </register>
            <register>
               <name>AWD1TR</name>
               <displayName>AWD1TR</displayName>
               <description>ADC watchdog threshold           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFF0000</resetValue>
               <fields>
                  <field>
                     <name>LT1</name>
                     <description>LT1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>HT1</name>
                     <description>HT1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>AWD2TR</name>
               <displayName>AWD2TR</displayName>
               <description>ADC watchdog threshold           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LT2</name>
                     <description>LT2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>HT2</name>
                     <description>HT2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
