tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CHSELR0</name>
               <displayName>CHSELR0</displayName>
               <description>channel selection register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHSEL</name>
                     <description>CHSEL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  <enumeratedValues><name>CHSEL</name><usage>read-write</usage><enumeratedValue><name>NotSelected</name><description>Input Channel is not selected for conversion</description><value>0</value></enumeratedValue><enumeratedValue><name>Selected</name><description>Input Channel is selected for conversion</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CHSELR1</name>
               <displayName>CHSELR1</displayName>
               <description>channel selection register</description>
               <alternateRegister>CHSELR0</alternateRegister>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQ1</name>
                     <description>SQ1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>SQ1</name><usage>read-write</usage><enumeratedValue><name>Ch0</name><description>Channel 0 selected for the Nth conversion</description><value>0</value></enumeratedValue><enumeratedValue><name>Ch1</name><description>Channel 1 selected for the Nth conversion</description><value>1</value></enumeratedValue><enumeratedValue><name>Ch2</name><description>Channel 2 selected for the Nth conversion</description><value>2</value></enumeratedValue><enumeratedValue><name>Ch3</name><description>Channel 3 selected for the Nth conversion</description><value>3</value></enumeratedValue><enumeratedValue><name>Ch4</name><description>Channel 4 selected for the Nth conversion</description><value>4</value></enumeratedValue><enumeratedValue><name>Ch5</name><description>Channel 5 selected for the Nth conversion</description><value>5</value></enumeratedValue><enumeratedValue><name>Ch6</name><description>Channel 6 selected for the Nth conversion</description><value>6</value></enumeratedValue><enumeratedValue><name>Ch7</name><description>Channel 7 selected for the Nth conversion</description><value>7</value></enumeratedValue><enumeratedValue><name>Ch8</name><description>Channel 8 selected for the Nth conversion</description><value>8</value></enumeratedValue><enumeratedValue><name>Ch9</name><description>Channel 9 selected for the Nth conversion</description><value>9</value></enumeratedValue><enumeratedValue><name>Ch10</name><description>Channel 10 selected for the Nth conversion</description><value>10</value></enumeratedValue><enumeratedValue><name>Ch11</name><description>Channel 11 selected for the Nth conversion</description><value>11</value></enumeratedValue><enumeratedValue><name>Ch12</name><description>Channel 12 selected for the Nth conversion</description><value>12</value></enumeratedValue><enumeratedValue><name>Ch13</name><description>Channel 13 selected for the Nth conversion</description><value>13</value></enumeratedValue><enumeratedValue><name>Ch14</name><description>Channel 14 selected for the Nth conversion</description><value>14</value></enumeratedValue><enumeratedValue><name>EOS</name><description>End of sequence</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SQ2</name>
                     <description>SQ2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="SQ1"/>
            </field>
                  <field>
                     <name>SQ3</name>
                     <description>SQ3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="SQ1"/>
            </field>
                  <field>
                     <name>SQ4</name>
                     <description>SQ4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="SQ1"/>
            </field>
                  <field>
                     <name>SQ5</name>
                     <description>SQ5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="SQ1"/>
            </field>
                  <field>
                     <name>SQ6</name>
                     <description>SQ6</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="SQ1"/>
            </field>
                  <field>
                     <name>SQ7</name>
                     <description>SQ7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="SQ1"/>
            </field>
                  <field>
                     <name>SQ8</name>
                     <description>SQ8</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="SQ1"/>
            </field>
               </fields>
            </register>
            <register>
               <name>AWD3TR</name>
               <displayName>AWD3TR</displayName>
               <description>ADC watchdog threshold           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFF0000</resetValue>
               <fields>
                  <field>
                     <name>LT3</name>
                     <description>LT3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>HT3</name>
                     <description>HT3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DR</name>
               <displayName>DR</displayName>
               <description>ADC data register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>AWD2CR</name>
               <displayName>AWD2CR</displayName>
               <description>ADC Analog Watchdog 2 Configuration           register</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWD2CH</name>
                     <description>AWD2CH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AWD3CR</name>
               <displayName>AWD3CR</displayName>
               <description>ADC Analog Watchdog 3 Configuration           register</description>
               <addressOffset>0xA4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWD3CH</name>
                     <description>AWD3CH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALFACT</name>
               <displayName>CALFACT</displayName>
               <description>ADC Calibration factor</description>
               <addressOffset>0xB4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CALFACT</name>
                     <description>CALFACT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR</name>
               <displayName>CCR</displayName>
               <description>ADC common configuration           register</description>
               <addressOffset>0x308</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VREFEN</name>
                     <description>VREFEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>VREFEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>VREFINT disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>VREFINT enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TSEN</name>
                     <description>TSEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TSEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Temperature sensor disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Temperature sensor enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>VBATEN</name>
                     <description>VBATEN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>VBATEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>VBAT channel disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>VBAT channel enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               <field><name>PRESC</name><description>PRESC0</description><bitOffset>18</bitOffset><bitWidth>4</bitWidth><enumeratedValues><name>PRESC</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>Input ADC clock not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>Input ADC clock divided by 2</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>Input ADC clock divided by 4</description><value>2</value></enumeratedValue><enumeratedValue><name>Div6</name><description>Input ADC clock divided by 6</description><value>3</value></enumeratedValue><enumeratedValue><name>Div8</name><description>Input ADC clock divided by 8</description><value>4</value></enumeratedValue><enumeratedValue><name>Div10</name><description>Input ADC clock divided by 10</description><value>5</value></enumeratedValue><enumeratedValue><name>Div12</name><description>Input ADC clock divided by 12</description><value>6</value></enumeratedValue><enumeratedValue><name>Div16</name><description>Input ADC clock divided by 16</description><value>7</value></enumeratedValue><enumeratedValue><name>Div32</name><description>Input ADC clock divided by 32</description><value>8</value></enumeratedValue><enumeratedValue><name>Div64</name><description>Input ADC clock divided by 64</description><value>9</value></enumeratedValue><enumeratedValue><name>Div128</name><description>Input ADC clock divided by 128</description><value>10</value></enumeratedValue><enumeratedValue><name>Div256</name><description>Input ADC clock divided by 256</description><value>11</value></enumeratedValue></enumeratedValues>
            </field></fields>
            </register>
