tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>AES</name>
         <description>Advanced encryption standard hardware       accelerator 1</description>
         <groupName>AES</groupName>
         <baseAddress>0x58001800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>AES</name>
            <description>AES global interrupt</description>
            <value>51</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NPBLB</name>
                     <description>Number of padding bytes in last block of               payload</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>KEYSIZE</name>
                     <description>Key size selection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>KEYSIZE</name><usage>read-write</usage><enumeratedValue><name>Bits128</name><description>128 bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits256</name><description>256 bits</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CHMOD2</name>
                     <description>AES chaining mode Bit2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CHMOD2</name><usage>read-write</usage><enumeratedValue><name>CHMOD</name><description>Mode as per CHMOD (ECB, CBC, CTR, GCM)</description><value>0</value></enumeratedValue><enumeratedValue><name>CCM</name><description>Counter with CBC-MAC (CCM) - CHMOD must be 0 (ECB)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>GCMPH</name>
                     <description>Used only for GCM, CCM and GMAC               algorithms and has no effect when other algorithms               are selected</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>GCMPH</name><usage>read-write</usage><enumeratedValue><name>Init</name><description>Init phase</description><value>0</value></enumeratedValue><enumeratedValue><name>Header</name><description>Header phase</description><value>1</value></enumeratedValue><enumeratedValue><name>Payload</name><description>Payload phase</description><value>2</value></enumeratedValue><enumeratedValue><name>Final</name><description>Final phase</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DMAOUTEN</name>
                     <description>Enable DMA management of data output               phase</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DMAOUTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable DMA Output</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled DMA Output</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DMAINEN</name>
                     <description>Enable DMA management of data input               phase</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DMAINEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable DMA Input</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable DMA Input</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ERRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable (mask) error interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable error interrupt</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CCFIE</name>
                     <description>CCF flag interrupt enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CCFIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable (mask) CCF interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable CCF interrupt</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ERRC</name>
                     <description>Error clear</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ERRCW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear RDERR and WRERR flags</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CCFC</name>
                     <description>Computation Complete Flag               Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CCFCW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear computation complete flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CHMOD</name>
                     <description>AES chaining mode Bit1               Bit0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CHMOD</name><usage>read-write</usage><enumeratedValue><name>ECB</name><description>Electronic codebook (ECB) / Counter with CBC-MAC (CCM) if CHMOD2 is 1</description><value>0</value></enumeratedValue><enumeratedValue><name>CBC</name><description>Cipher-block chaining (CBC)</description><value>1</value></enumeratedValue><enumeratedValue><name>CTR</name><description>Counter mode (CTR)</description><value>2</value></enumeratedValue><enumeratedValue><name>GCM</name><description>Galois counter mode (GCM) and Galois message authentication code (GMAC)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MODE</name>
                     <description>AES operating mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>MODE</name><usage>read-write</usage><enumeratedValue><name>Mode1</name><description>Mode 1: encryption</description><value>0</value></enumeratedValue><enumeratedValue><name>Mode2</name><description>Mode 2: key derivation (or key preparation for ECB/CBC decryption)</description><value>1</value></enumeratedValue><enumeratedValue><name>Mode3</name><description>Mode 3: decryption</description><value>2</value></enumeratedValue><enumeratedValue><name>Mode4</name><description>Mode 4: key derivation &amp; decrypt (UNDOCUMENTED in ref. manual, exists in CubeMX code)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DATATYPE</name>
                     <description>Data type selection (for data in and               data out to/from the cryptographic               block)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>DATATYPE</name><usage>read-write</usage><enumeratedValue><name>None</name><description>Word</description><value>0</value></enumeratedValue><enumeratedValue><name>HalfWord</name><description>Half-word (16-bit)</description><value>1</value></enumeratedValue><enumeratedValue><name>Byte</name><description>Byte (8-bit)</description><value>2</value></enumeratedValue><enumeratedValue><name>Bit</name><description>Bit</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EN</name>
                     <description>AES enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable AES</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable AES</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>status register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>Busy flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BUSY</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>Idle</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>Busy</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WRERR</name>
                     <description>Write error flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WRERR</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>Write error not detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Write error detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RDERR</name>
                     <description>Read error flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RDERR</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>Read error not detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Read error detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CCF</name>
                     <description>Computation complete flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CCF</name><usage>read-write</usage><enumeratedValue><name>Complete</name><description>Computation complete</description><value>0</value></enumeratedValue><enumeratedValue><name>NotComplete</name><description>Computation not complete</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>DINR</name>
               <displayName>DINR</displayName>
               <description>data input register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN</name>
                     <description>Data Input Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DOUTR</name>
               <displayName>DOUTR</displayName>
               <description>data output register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DOUT</name>
                     <description>Data output register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>KEYR0</name>
               <displayName>KEYR0</displayName>
               <description>key register 0</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Data Output Register (LSB key               [31:0])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>KEYR1</name>
               <displayName>KEYR1</displayName>
               <description>key register 1</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>AES key register (key               [63:32])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>KEYR2</name>
               <displayName>KEYR2</displayName>
               <description>key register 2</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>AES key register (key               [95:64])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>KEYR3</name>
               <displayName>KEYR3</displayName>
               <description>key register 3</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>AES key register (MSB key               [127:96])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>IVR0</name>
               <displayName>IVR0</displayName>
               <description>initialization vector register           0</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IVI</name>
                     <description>initialization vector register (LSB IVR               [31:0])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>IVR1</name>
               <displayName>IVR1</displayName>
               <description>initialization vector register           1</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IVI</name>
                     <description>Initialization Vector Register (IVR               [63:32])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>IVR2</name>
               <displayName>IVR2</displayName>
               <description>initialization vector register           2</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IVI</name>
                     <description>Initialization Vector Register (IVR               [95:64])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>IVR3</name>
               <displayName>IVR3</displayName>
               <description>initialization vector register           3</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IVI</name>
                     <description>Initialization Vector Register (MSB IVR               [127:96])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>KEYR4</name>
               <displayName>KEYR4</displayName>
               <description>key register 4</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>AES key register (MSB key               [159:128])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>KEYR5</name>
               <displayName>KEYR5</displayName>
               <description>key register 5</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>AES key register (MSB key               [191:160])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>KEYR6</name>
               <displayName>KEYR6</displayName>
               <description>key register 6</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>AES key register (MSB key               [223:192])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
