tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>KEYR7</name>
               <displayName>KEYR7</displayName>
               <description>key register 7</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>AES key register (MSB key               [255:224])</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SUSP0R</name>
               <displayName>SUSP0R</displayName>
               <description>AES suspend register 0</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SUSP</name>
                     <description>AES suspend register 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SUSP1R</name>
               <displayName>SUSP1R</displayName>
               <description>AES suspend register 1</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SUSP</name>
                     <description>AES suspend register 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SUSP2R</name>
               <displayName>SUSP2R</displayName>
               <description>AES suspend register 2</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SUSP</name>
                     <description>AES suspend register 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SUSP3R</name>
               <displayName>SUSP3R</displayName>
               <description>AES suspend register 3</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SUSP</name>
                     <description>AES suspend register 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SUSP4R</name>
               <displayName>SUSP4R</displayName>
               <description>AES suspend register 4</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SUSP</name>
                     <description>AES suspend register 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SUSP5R</name>
               <displayName>SUSP5R</displayName>
               <description>AES suspend register 5</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SUSP</name>
                     <description>AES suspend register 5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SUSP6R</name>
               <displayName>SUSP6R</displayName>
               <description>AES suspend register 6</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SUSP</name>
                     <description>AES suspend register 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SUSP7R</name>
               <displayName>SUSP7R</displayName>
               <description>AES suspend register 7</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SUSP</name>
                     <description>AES suspend register 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
