tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral> 
      <peripheral>
         <name>COMP</name>
         <description>Comparator</description>
         <groupName>COMP</groupName>
         <baseAddress>0x40010200</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x200</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>COMP</name>
            <description>COMP2 and COMP1 interrupt
        through EXTI[22:21]</description>
            <value>21</value>
         </interrupt>
         <registers>
            <register>
               <name>COMP1_CSR</name>
               <displayName>COMP1_CSR</displayName>
               <description>COMP1_CSR</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>COMP1_CSR register lock               bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LOCK</name><usage>read-write</usage><enumeratedValue><name>Unlocked</name><description>Comparator CSR bits are read-write</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Comparator CSR bits are read-only</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>VALUE</name>
                     <description>Comparator 1 output status               bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>VALUE</name><usage>read-write</usage><enumeratedValue><name>Low</name><description>Comparator output is low</description><value>0</value></enumeratedValue><enumeratedValue><name>High</name><description>Comparator output is high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>INMESEL</name>
                     <description>comparator 1 input minus extended               selection bits.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>INMESEL</name><usage>read-write</usage><enumeratedValue><name>PA10</name><description>PA10 connected to input minus</description><value>0</value></enumeratedValue><enumeratedValue><name>PA11</name><description>PA11 connected to input minus</description><value>1</value></enumeratedValue><enumeratedValue><name>PA15</name><description>PA15 connected to input minus</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SCALEN</name>
                     <description>Voltage scaler enable bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>SCALEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Voltage scaler disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Voltage scaler enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BRGEN</name>
                     <description>Scaler bridge enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>BRGEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Scaler resistor bridge disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Scaler resistor bridge enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BLANKING</name>
                     <description>Comparator 1 blanking source selection               bits</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>BLANKING</name><usage>read-write</usage><enumeratedValue><name>NoBlanking</name><description>No blanking</description><value>0</value></enumeratedValue><enumeratedValue><name>TIM1OC5</name><description>TIM1 OC5 selected as blanking source</description><value>1</value></enumeratedValue><enumeratedValue><name>TIM2OC3</name><description>TIM2 OC3 selected as blanking source</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HYST</name>
                     <description>Comparator 1 hysteresis selection               bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>HYST</name><usage>read-write</usage><enumeratedValue><name>NoHysteresis</name><description>No hysteresis</description><value>0</value></enumeratedValue><enumeratedValue><name>LowHysteresis</name><description>Low hysteresis</description><value>1</value></enumeratedValue><enumeratedValue><name>MediumHysteresis</name><description>Medium hysteresis</description><value>2</value></enumeratedValue><enumeratedValue><name>HighHysteresis</name><description>High hysteresis</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>POLARITY</name>
                     <description>Comparator 1 polarity selection               bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>POLARITY</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Output is not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Output is inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>INPSEL</name>
                     <description>Comparator1 input plus selection               bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>INPSEL</name><usage>read-write</usage><enumeratedValue><name>PB4</name><description>PB4 connected to input plus</description><value>0</value></enumeratedValue><enumeratedValue><name>PB2</name><description>PB2 connected to input plus</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>INMSEL</name>
                     <description>Comparator 1 input minus selection               bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>INMSEL</name><usage>read-write</usage><enumeratedValue><name>OneQuarterVRef</name><description>1/4 of VRefint</description><value>0</value></enumeratedValue><enumeratedValue><name>OneHalfVRef</name><description>1/2 of VRefint</description><value>1</value></enumeratedValue><enumeratedValue><name>ThreeQuarterVRef</name><description>3/4 of VRefint</description><value>2</value></enumeratedValue><enumeratedValue><name>VRef</name><description>VRefint</description><value>3</value></enumeratedValue><enumeratedValue><name>DAC_CH1</name><description>DAC Channel 1</description><value>4</value></enumeratedValue><enumeratedValue><name>PB3</name><description>PB3</description><value>6</value></enumeratedValue><enumeratedValue><name>GPIO</name><description>GPIO pin selected by INMESEL</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PWRMODE</name>
                     <description>Power Mode of the comparator               1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>PWRMODE</name><usage>read-write</usage><enumeratedValue><name>HighSpeed</name><description>High speed / full power</description><value>0</value></enumeratedValue><enumeratedValue><name>MediumSpeed</name><description>Medium speed / medium power</description><value>1</value></enumeratedValue><enumeratedValue><name>LowSpeed</name><description>Low speed / low power</description><value>2</value></enumeratedValue><enumeratedValue><name>VeryLowSpeed</name><description>Very-low speed / ultra-low power</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EN</name>
                     <description>Comparator 1 enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Comparator 1 disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Comparator 1 enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>COMP2_CSR</name>
               <displayName>COMP2_CSR</displayName>
               <description>COMP2_CSR</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>CSR register lock bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LOCK</name><usage>read-write</usage><enumeratedValue><name>Unlocked</name><description>Comparator CSR bits are read-write</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Comparator CSR bits are read-only</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>VALUE</name>
                     <description>Comparator 2 output status               bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>VALUE</name><usage>read-write</usage><enumeratedValue><name>Low</name><description>Comparator output is low</description><value>0</value></enumeratedValue><enumeratedValue><name>High</name><description>Comparator output is high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>INMESEL</name>
                     <description>comparator 2 input minus extended               selection bits.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>INMESEL</name><usage>read-write</usage><enumeratedValue><name>PB2</name><description>PB2 connected to input minus</description><value>0</value></enumeratedValue><enumeratedValue><name>PA10</name><description>PA10 connected to input minus</description><value>1</value></enumeratedValue><enumeratedValue><name>PA11</name><description>PA11 connected to input minus</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SCALEN</name>
                     <description>Voltage scaler enable bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>SCALEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Voltage scaler disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Voltage scaler enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BRGEN</name>
                     <description>Scaler bridge enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>BRGEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Scaler resistor bridge disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Scaler resistor bridge enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BLANKING</name>
                     <description>Comparator 2 blanking source selection               bits</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>BLANKING</name><usage>read-write</usage><enumeratedValue><name>NoBlanking</name><description>No blanking</description><value>0</value></enumeratedValue><enumeratedValue><name>TIM1OC5</name><description>TIM1 OC5 selected as blanking source</description><value>1</value></enumeratedValue><enumeratedValue><name>TIM2OC3</name><description>TIM2 OC3 selected as blanking source</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HYST</name>
                     <description>Comparator 2 hysteresis selection               bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>HYST</name><usage>read-write</usage><enumeratedValue><name>NoHysteresis</name><description>No hysteresis</description><value>0</value></enumeratedValue><enumeratedValue><name>LowHysteresis</name><description>Low hysteresis</description><value>1</value></enumeratedValue><enumeratedValue><name>MediumHysteresis</name><description>Medium hysteresis</description><value>2</value></enumeratedValue><enumeratedValue><name>HighHysteresis</name><description>High hysteresis</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>POLARITY</name>
                     <description>Comparator 2 polarity selection               bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>POLARITY</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Output is not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Output is inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WINMODE</name>
                     <description>Windows mode selection bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>WINMODE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>COMP2 input plus is not connected to COMP1</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>COMP2 input plus is connected to COMP1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>INPSEL</name>
                     <description>Comparator 1 input plus selection               bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>INPSEL</name><usage>read-write</usage><enumeratedValue><name>PB4</name><description>PB4 connected to input plus</description><value>0</value></enumeratedValue><enumeratedValue><name>PB1</name><description>PB1 connected to input plus</description><value>1</value></enumeratedValue><enumeratedValue><name>PA15</name><description>PA15 connected to input plus</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>INMSEL</name>
                     <description>Comparator 2 input minus selection               bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>INMSEL</name><usage>read-write</usage><enumeratedValue><name>OneQuarterVRef</name><description>1/4 of VRefint</description><value>0</value></enumeratedValue><enumeratedValue><name>OneHalfVRef</name><description>1/2 of VRefint</description><value>1</value></enumeratedValue><enumeratedValue><name>ThreeQuarterVRef</name><description>3/4 of VRefint</description><value>2</value></enumeratedValue><enumeratedValue><name>VRef</name><description>VRefint</description><value>3</value></enumeratedValue><enumeratedValue><name>DAC_CH1</name><description>DAC Channel 1</description><value>4</value></enumeratedValue><enumeratedValue><name>PB3</name><description>PB3</description><value>6</value></enumeratedValue><enumeratedValue><name>GPIO</name><description>GPIO pin selected by INMESEL</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PWRMODE</name>
                     <description>Power Mode of the comparator               2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>PWRMODE</name><usage>read-write</usage><enumeratedValue><name>HighSpeed</name><description>High speed / full power</description><value>0</value></enumeratedValue><enumeratedValue><name>MediumSpeed</name><description>Medium speed / medium power</description><value>1</value></enumeratedValue><enumeratedValue><name>LowSpeed</name><description>Low speed / low power</description><value>2</value></enumeratedValue><enumeratedValue><name>VeryLowSpeed</name><description>Very-low speed / ultra-low power</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EN</name>
                     <description>Comparator 2 enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Comparator 1 disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Comparator 1 enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
