tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CRC</name>
         <description>Cyclic redundancy check calculation       unit</description>
         <groupName>CRC</groupName>
         <baseAddress>0x40023000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DR</name>
               <displayName>DR</displayName>
               <description>Data register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DR</name>
                     <description>Data register bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <displayName>IDR</displayName>
               <description>Independent data register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IDR</name>
                     <description>General-purpose 32-bit data register               bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Control register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REV_OUT</name>
                     <description>Reverse output data</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>REV_OUT</name><usage>read-write</usage><enumeratedValue><name>Normal</name><description>Bit order not affected</description><value>0</value></enumeratedValue><enumeratedValue><name>Reversed</name><description>Bit reversed output</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>REV_IN</name>
                     <description>Reverse input data</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>REV_IN</name><usage>read-write</usage><enumeratedValue><name>Normal</name><description>Bit order not affected</description><value>0</value></enumeratedValue><enumeratedValue><name>Byte</name><description>Bit reversal done by byte</description><value>1</value></enumeratedValue><enumeratedValue><name>HalfWord</name><description>Bit reversal done by half-word</description><value>2</value></enumeratedValue><enumeratedValue><name>Word</name><description>Bit reversal done by word</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>POLYSIZE</name>
                     <description>Polynomial size</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>POLYSIZE</name><usage>read-write</usage><enumeratedValue><name>Polysize32</name><description>32-bit polynomial</description><value>0</value></enumeratedValue><enumeratedValue><name>Polysize16</name><description>16-bit polynomial</description><value>1</value></enumeratedValue><enumeratedValue><name>Polysize8</name><description>8-bit polynomial</description><value>2</value></enumeratedValue><enumeratedValue><name>Polysize7</name><description>7-bit polynomial</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RESET</name>
                     <description>RESET bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RESETW</name><usage>write</usage><enumeratedValue><name>Reset</name><description>Resets the CRC calculation unit and sets the data register to 0xFFFF FFFF</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>INIT</name>
               <displayName>INIT</displayName>
               <description>Initial CRC value</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>INIT</name>
                     <description>Programmable initial CRC               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>POL</name>
               <displayName>POL</displayName>
               <description>polynomial</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x04C11DB7</resetValue>
               <fields>
                  <field>
                     <name>POL</name>
                     <description>Programmable polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
         <register><name>DR8</name><description>Data register - byte sized</description><alternateRegister>DR</alternateRegister><addressOffset>0</addressOffset><size>8</size><access>read-write</access><resetValue>255</resetValue><fields><field><name>DR8</name><description>Data register bits</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            </fields></register>
        <register><name>DR16</name><description>Data register - half-word sized</description><alternateRegister>DR</alternateRegister><addressOffset>0</addressOffset><size>16</size><access>read-write</access><resetValue>65535</resetValue><fields><field><name>DR16</name><description>Data register bits</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
            </fields></register>
        </registers>
      </peripheral>
      <peripheral>
         <name>DAC</name>
         <description>Digital-to-analog converter</description>
         <groupName>DAC</groupName>
         <baseAddress>0x40007400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DAC</name>
            <description>DAC global interrupt</description>
            <value>19</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CEN1</name>
                     <description>DAC Channel 1 calibration               enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CEN1</name><usage>read-write</usage><enumeratedValue><name>Normal</name><description>DAC Channel X Normal operating mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Calibration</name><description>DAC Channel X calibration mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DMAUDRIE1</name>
                     <description>DAC channel1 DMA Underrun Interrupt               enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DMAUDRIE1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DAC Channel X  DMA Underrun Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DAC Channel X DMA Underrun Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DMAEN1</name>
                     <description>DAC channel1 DMA enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DMAEN1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DAC Channel X DMA mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DAC Channel X DMA mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MAMP1</name>
                     <description>DAC channel1 mask/amplitude               selector</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>MAMP1</name><usage>read-write</usage><enumeratedValue><name>Amp1</name><description>Unmask bit0 of LFSR/ triangle amplitude equal to 1</description><value>0</value></enumeratedValue><enumeratedValue><name>Amp3</name><description>Unmask bits[1:0] of LFSR/ triangle amplitude equal to 3</description><value>1</value></enumeratedValue><enumeratedValue><name>Amp7</name><description>Unmask bits[2:0] of LFSR/ triangle amplitude equal to 7</description><value>2</value></enumeratedValue><enumeratedValue><name>Amp15</name><description>Unmask bits[3:0] of LFSR/ triangle amplitude equal to 15</description><value>3</value></enumeratedValue><enumeratedValue><name>Amp31</name><description>Unmask bits[4:0] of LFSR/ triangle amplitude equal to 31</description><value>4</value></enumeratedValue><enumeratedValue><name>Amp63</name><description>Unmask bits[5:0] of LFSR/ triangle amplitude equal 63</description><value>5</value></enumeratedValue><enumeratedValue><name>Amp127</name><description>Unmask bits[6:0] of LFSR/ triangle amplitude equal to 127</description><value>6</value></enumeratedValue><enumeratedValue><name>Amp255</name><description>Unmask bits[7:0] of LFSR/ triangle amplitude equal to 255</description><value>7</value></enumeratedValue><enumeratedValue><name>Amp511</name><description>Unmask bits[8:0] of LFSR/ triangle amplitude equal to 511</description><value>8</value></enumeratedValue><enumeratedValue><name>Amp1023</name><description>Unmask bits[9:0] of LFSR/ triangle amplitude equal to 1023</description><value>9</value></enumeratedValue><enumeratedValue><name>Amp2047</name><description>Unmask bits[10:0] of LFSR/ triangle amplitude equal to 2047</description><value>10</value></enumeratedValue><enumeratedValue><name>Amp4095</name><description>Unmask bits[11:0] of LFSR/ triangle amplitude equal to 4095</description><value>11</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WAVE1</name>
                     <description>DAC channel1 noise/triangle wave               generation enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>WAVE1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wave generation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Noise</name><description>Noise wave generation enabled</description><value>1</value></enumeratedValue><enumeratedValue><name>Triangle</name><description>Triangle wave generation enabled</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TEN1</name>
                     <description>DAC channel1 trigger               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TEN1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DAC Channel X trigger disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DAC Channel X trigger enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EN1</name>
                     <description>DAC channel1 enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EN1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DAC Channel X disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DAC Channel X enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               <field><name>TSEL1</name><description>DAC channel1 trigger               selection</description><bitOffset>2</bitOffset><bitWidth>4</bitWidth><enumeratedValues><name>TSEL1</name><usage>read-write</usage><enumeratedValue><name>SWTRIG</name><description>SWTRIG1</description><value>0</value></enumeratedValue><enumeratedValue><name>TIM1_TRGO</name><description>dac_chx_trg1</description><value>1</value></enumeratedValue><enumeratedValue><name>TIM2_TRGO</name><description>dac_chx_trg2</description><value>2</value></enumeratedValue><enumeratedValue><name>TRG3</name><description>dac_chx_trg3</description><value>3</value></enumeratedValue><enumeratedValue><name>TRG4</name><description>dac_chx_trg4</description><value>4</value></enumeratedValue><enumeratedValue><name>TRG5</name><description>dac_chx_trg5</description><value>5</value></enumeratedValue><enumeratedValue><name>TRG6</name><description>dac_chx_trg6</description><value>6</value></enumeratedValue><enumeratedValue><name>TRG7</name><description>dac_chx_trg7</description><value>7</value></enumeratedValue><enumeratedValue><name>TRG8</name><description>dac_chx_trg8</description><value>8</value></enumeratedValue><enumeratedValue><name>TRG9</name><description>dac_chx_trg9</description><value>9</value></enumeratedValue><enumeratedValue><name>TRG10</name><description>dac_chx_trg10</description><value>10</value></enumeratedValue><enumeratedValue><name>LPTIM1_OUT</name><description>dac_chx_trg11</description><value>11</value></enumeratedValue><enumeratedValue><name>LPTIM2_OUT</name><description>dac_chx_trg12</description><value>12</value></enumeratedValue><enumeratedValue><name>LPTIM3_OUT</name><description>dac_chx_trg13</description><value>13</value></enumeratedValue><enumeratedValue><name>EXTI9</name><description>dac_chx_trg14</description><value>14</value></enumeratedValue><enumeratedValue><name>TRG15</name><description>dac_chx_trg15</description><value>15</value></enumeratedValue></enumeratedValues>
            </field></fields>
            </register>
            <register>
               <name>SWTRGR</name>
               <displayName>SWTRGR</displayName>
               <description>software trigger register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>                
                  <field>
                     <name>SWTRIG1</name>
                     <description>DAC channel1 software               trigger</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  <enumeratedValues><name>SWTRIG1</name><usage>read-write</usage><enumeratedValue><name>NoTrigger</name><description>No trigger</description><value>0</value></enumeratedValue><enumeratedValue><name>Trigger</name><description>Trigger</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>DHR12R1</name>
               <displayName>DHR12R1</displayName>
               <description>channel1 12-bit right-aligned data holding           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 12-bit right-aligned               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DHR12L1</name>
               <displayName>DHR12L1</displayName>
               <description>channel1 12-bit left aligned data holding           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 12-bit left-aligned               data</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DHR8R1</name>
               <displayName>DHR8R1</displayName>
               <description>channel1 8-bit right aligned data holding           register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 8-bit right-aligned               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DHR12RD</name>
               <displayName>DHR12RD</displayName>
               <description>Dual DAC 12-bit right-aligned data holding           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 12-bit right-aligned               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DHR12LD</name>
               <displayName>DHR12LD</displayName>
               <description>Dual DAC 12-bit left aligned data holding           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 12-bit left-aligned               data</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DHR8RD</name>
               <displayName>DHR8RD</displayName>
               <description>Dual DAC 8-bit right aligned data holding           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 8-bit right-aligned               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DOR1</name>
               <displayName>DOR1</displayName>
               <description>DAC channel1 data output           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DOR</name>
                     <description>DACC1DOR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
