tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>status register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BWST1</name>
                     <description>DAC Channel 1 busy writing sample time               flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>BWST1</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>There is no write operation of DAC_SHSR1 ongoing: DAC_SHSR1 can be written</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>There is a write operation of DAC_SHSR1 ongoing: DAC_SHSR1 cannot be written</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CAL_FLAG1</name>
                     <description>DAC Channel 1 calibration offset               status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>CAL_FLAG1</name><usage>read-write</usage><enumeratedValue><name>Lower</name><description>Calibration trimming value is lower than the offset correction value</description><value>0</value></enumeratedValue><enumeratedValue><name>Equal_Higher</name><description>Calibration trimming value is equal or greater than the offset correction value</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DMAUDR1</name>
                     <description>DAC channel1 DMA underrun               flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>DMAUDR1</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>No DMA underrun error condition occurred for DAC channel x</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>DMA underrun error condition occurred for DAC channel x (the currently selected trigger is driving DAC channel1 conversion at a frequency higher than the DMA service capability rate)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR</name>
               <displayName>CCR</displayName>
               <description>calibration control register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OTRIM1</name>
                     <description>DAC Channel 1 offset trimming               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>MCR</name>
               <displayName>MCR</displayName>
               <description>mode control register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE1</name>
                     <description>DAC Channel 1 mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>MODE1</name><usage>read-write</usage><enumeratedValue><name>NormalPinBuffer</name><description>Normal mode - DAC channelx is connected to external pin with Buffer enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>NormalPinChipBuffer</name><description>Normal mode - DAC channelx is connected to external pin and to on chip peripherals with Buffer enabled</description><value>1</value></enumeratedValue><enumeratedValue><name>NormalPinNoBuffer</name><description>Normal mode - DAC channelx is connected to external pin with Buffer disabled</description><value>2</value></enumeratedValue><enumeratedValue><name>NormalChipNoBuffer</name><description>Normal mode - DAC channelx is connected to on chip peripherals with Buffer disabled</description><value>3</value></enumeratedValue><enumeratedValue><name>SHPinBuffer</name><description>S&amp;H mode - DAC channelx is connected to external pin with Buffer enabled</description><value>4</value></enumeratedValue><enumeratedValue><name>SHPinChipBuffer</name><description>S&amp;H mode - DAC channelx is connected to external pin and to on chip peripherals with Buffer enabled</description><value>5</value></enumeratedValue><enumeratedValue><name>SHPinNoBuffer</name><description>S&amp;H mode - DAC channelx is connected to external pin and to on chip peripherals with Buffer disabled</description><value>6</value></enumeratedValue><enumeratedValue><name>SHChipNoBuffer</name><description>S&amp;H mode - DAC channelx is connected to on chip peripherals with Buffer disabled</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>SHSR1</name>
               <displayName>SHSR1</displayName>
               <description>Sample and Hold sample time register           1</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSAMPLE1</name>
                     <description>DAC Channel 1 sample Time (only valid in               Sample and Hold mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>1023</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>       
            <register>
               <name>SHHR</name>
               <displayName>SHHR</displayName>
               <description>Sample and Hold hold time           register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00010001</resetValue>
               <fields>
                  <field>
                     <name>THOLD1</name>
                     <description>DAC Channel 1 hold Time (only valid in               Sample and Hold mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>1023</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SHRR</name>
               <displayName>SHRR</displayName>
               <description>Sample and Hold refresh time           register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00010001</resetValue>
               <fields>
                  <field>
                     <name>TREFRESH1</name>
                     <description>DAC Channel 1 refresh Time (only valid               in Sample and Hold mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>                    
