tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DMA1</name>
         <description>Direct memory access controller</description>
         <groupName>DMA</groupName>
         <baseAddress>0x40020000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DMA1_CH1</name>
            <description>DMA1 channel 1 non-secure interrupt</description>
            <value>11</value>
         </interrupt>
         <interrupt>
            <name>DMA1_CH2</name>
            <description>DMA1 channel 2 non-secure interrupt</description>
            <value>12</value>
         </interrupt>
         <interrupt>
            <name>DMA1_CH3</name>
            <description>DMA1 channel 3 non-secure interrupt</description>
            <value>13</value>
         </interrupt>
         <interrupt>
            <name>DMA1_CH4</name>
            <description>DMA1 channel 4 non-secure interrupt</description>
            <value>14</value>
         </interrupt>
         <interrupt>
            <name>DMA1_CH5</name>
            <description>DMA1 channel 5 non-secure interrupt</description>
            <value>15</value>
         </interrupt>
         <interrupt>
            <name>DMA1_CH6</name>
            <description>DMA1 channel 6 non-secure interrupt</description>
            <value>16</value>
         </interrupt>
         <interrupt>
            <name>DMA1_CH7</name>
            <description>DMA1 channel 7 non-secure interrupt</description>
            <value>17</value>
         </interrupt>
         <registers>
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>interrupt status register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TEIF7</name>
                     <description>transfer error (TE) flag for channel               7</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF7</name>
                     <description>half transfer (HT) flag for channel               7</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF7</name>
                     <description>transfer complete (TC) flag for channel               7</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF7</name>
                     <description>global interrupt flag for channel               7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF6</name>
                     <description>transfer error (TE) flag for channel               6</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF6</name>
                     <description>half transfer (HT) flag for channel               6</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF6</name>
                     <description>transfer complete (TC) flag for channel               6</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF6</name>
                     <description>global interrupt flag for channel               6</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF5</name>
                     <description>transfer error (TE) flag for channel               5</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF5</name>
                     <description>half transfer (HT) flag for channel               5</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF5</name>
                     <description>transfer complete (TC) flag for channel               5</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF5</name>
                     <description>global interrupt flag for channel               5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF4</name>
                     <description>transfer error (TE) flag for channel               4</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF4</name>
                     <description>half transfer (HT) flag for channel               4</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF4</name>
                     <description>transfer complete (TC) flag for channel               4</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF4</name>
                     <description>global interrupt flag for channel               4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF3</name>
                     <description>transfer error (TE) flag for channel               3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF3</name>
                     <description>half transfer (HT) flag for channel               3</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF3</name>
                     <description>transfer complete (TC) flag for channel               3</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF3</name>
                     <description>global interrupt flag for channel               3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF2</name>
                     <description>transfer error (TE) flag for channel               2</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF2</name>
                     <description>half transfer (HT) flag for channel               2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF2</name>
                     <description>transfer complete (TC) flag for channel               2</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF2</name>
                     <description>global interrupt flag for channel               2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF1</name>
                     <description>transfer error (TE) flag for channel               1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TEIF1</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>No transfer error on channel x</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>A transfer error occurred on channel x</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HTIF1</name>
                     <description>half transfer (HT) flag for channel               1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HTIF1</name><usage>read-write</usage><enumeratedValue><name>NotHalf</name><description>No half transfer event on channel x</description><value>0</value></enumeratedValue><enumeratedValue><name>Half</name><description>A half transfer event occurred on channel x</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TCIF1</name>
                     <description>transfer complete (TC) flag for channel               1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TCIF1</name><usage>read-write</usage><enumeratedValue><name>NotComplete</name><description>No transfer complete event on channel x</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>A transfer complete event occurred on channel x</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>GIF1</name>
                     <description>global interrupt flag for channel               1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GIF1</name><usage>read-write</usage><enumeratedValue><name>NoEvent</name><description>No TE, HT or TC event on channel x</description><value>0</value></enumeratedValue><enumeratedValue><name>Event</name><description>A TE, HT or TC event occurred on channel x</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>IFCR</name>
               <displayName>IFCR</displayName>
               <description>interrupt flag clear register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TEIF7</name>
                     <description>transfer error flag clear for channel               7</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF7</name>
                     <description>half transfer flag clear for channel               7</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF7</name>
                     <description>transfer complete flag clear for channel               7</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF7</name>
                     <description>global interrupt flag clear for channel               7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF6</name>
                     <description>transfer error flag clear for channel               6</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF6</name>
                     <description>half transfer flag clear for channel               6</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF6</name>
                     <description>transfer complete flag clear for channel               6</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF6</name>
                     <description>global interrupt flag clear for channel               6</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF5</name>
                     <description>transfer error flag clear for channel               5</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF5</name>
                     <description>half transfer flag clear for channel               5</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF5</name>
                     <description>transfer complete flag clear for channel               5</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF5</name>
                     <description>global interrupt flag clear for channel               5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF4</name>
                     <description>transfer error flag clear for channel               4</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF4</name>
                     <description>half transfer flag clear for channel               4</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF4</name>
                     <description>transfer complete flag clear for channel               4</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF4</name>
                     <description>global interrupt flag clear for channel               4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF3</name>
                     <description>transfer error flag clear for channel               3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF3</name>
                     <description>half transfer flag clear for channel               3</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF3</name>
                     <description>transfer complete flag clear for channel               3</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF3</name>
                     <description>global interrupt flag clear for channel               3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF2</name>
                     <description>transfer error flag clear for channel               2</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TEIF1"/>
            </field>
                  <field>
                     <name>HTIF2</name>
                     <description>half transfer flag clear for channel               2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="HTIF1"/>
            </field>
                  <field>
                     <name>TCIF2</name>
                     <description>transfer complete flag clear for channel               2</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TCIF1"/>
            </field>
                  <field>
                     <name>GIF2</name>
                     <description>global interrupt flag clear for channel               2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GIF1"/>
            </field>
                  <field>
                     <name>TEIF1</name>
                     <description>transfer error flag clear for channel               1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TEIF1</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the corresponding TEIFx flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HTIF1</name>
                     <description>half transfer flag clear for channel               1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HTIF1</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the corresponding HTIFx flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TCIF1</name>
                     <description>transfer complete flag clear for channel               1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TCIF1</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the corresponding TCIFx flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>GIF1</name>
                     <description>global interrupt flag clear for channel               1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GIF1</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the corresponding CGIFx flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
