tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CCR1</name>
               <displayName>CCR1</displayName>
               <description>channel x configuration           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRIV</name>
                     <description>rivileged mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PRIV</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DSEC</name>
                     <description>ecurity of the DMA transfer to the               destination</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSEC</name>
                     <description>ecurity of the DMA transfer from the               source</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECM</name>
                     <description>ecure mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM2MEM</name>
                     <description>memory-to-memory mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MEM2MEM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PL</name>
                     <description>priority level</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>PL</name><usage>read-write</usage><enumeratedValue><name>Low</name><description>Low</description><value>0</value></enumeratedValue><enumeratedValue><name>Medium</name><description>Medium</description><value>1</value></enumeratedValue><enumeratedValue><name>High</name><description>High</description><value>2</value></enumeratedValue><enumeratedValue><name>VeryHigh</name><description>Very high</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MSIZE</name>
                     <description>memory size</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>MSIZE</name><usage>read-write</usage><enumeratedValue><name>Bits8</name><description>8 bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits16</name><description>16 bits</description><value>1</value></enumeratedValue><enumeratedValue><name>Bits32</name><description>32 bits</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PSIZE</name>
                     <description>peripheral size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>PSIZE</name><usage>read-write</usage><enumeratedValue><name>Bits8</name><description>8 bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits16</name><description>16 bits</description><value>1</value></enumeratedValue><enumeratedValue><name>Bits32</name><description>32 bits</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MINC</name>
                     <description>memory increment mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MINC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PINC</name>
                     <description>peripheral increment mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PINC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CIRC</name>
                     <description>circular mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CIRC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DIR</name>
                     <description>data transfer direction</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DIR</name><usage>read-write</usage><enumeratedValue><name>Peripheral</name><description>Read from peripheral</description><value>0</value></enumeratedValue><enumeratedValue><name>Memory</name><description>Read from memory</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TEIE</name>
                     <description>transfer error interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HTIE</name>
                     <description>half transfer interrupt               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HTIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TCIE</name>
                     <description>transfer complete interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EN</name>
                     <description>channel enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CNDTR1</name>
               <displayName>CNDTR1</displayName>
               <description>channel x number of data to transfer           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>number of data to transfer (0 to 218 -               1)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>262143</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CPAR1</name>
               <displayName>CPAR1</displayName>
               <description>channel x peripheral address           register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CMAR1</name>
               <displayName>CMAR1</displayName>
               <description>channel x memory address           register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR2</name>
               <displayName>CCR2</displayName>
               <description>channel x configuration           register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRIV</name>
                     <description>rivileged mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PRIV</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DSEC</name>
                     <description>ecurity of the DMA transfer to the               destination</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSEC</name>
                     <description>ecurity of the DMA transfer from the               source</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECM</name>
                     <description>ecure mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM2MEM</name>
                     <description>memory-to-memory mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MEM2MEM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PL</name>
                     <description>priority level</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>PL</name><usage>read-write</usage><enumeratedValue><name>Low</name><description>Low</description><value>0</value></enumeratedValue><enumeratedValue><name>Medium</name><description>Medium</description><value>1</value></enumeratedValue><enumeratedValue><name>High</name><description>High</description><value>2</value></enumeratedValue><enumeratedValue><name>VeryHigh</name><description>Very high</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MSIZE</name>
                     <description>memory size</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>MSIZE</name><usage>read-write</usage><enumeratedValue><name>Bits8</name><description>8 bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits16</name><description>16 bits</description><value>1</value></enumeratedValue><enumeratedValue><name>Bits32</name><description>32 bits</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PSIZE</name>
                     <description>peripheral size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>PSIZE</name><usage>read-write</usage><enumeratedValue><name>Bits8</name><description>8 bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits16</name><description>16 bits</description><value>1</value></enumeratedValue><enumeratedValue><name>Bits32</name><description>32 bits</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MINC</name>
                     <description>memory increment mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MINC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PINC</name>
                     <description>peripheral increment mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PINC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CIRC</name>
                     <description>circular mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CIRC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DIR</name>
                     <description>data transfer direction</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DIR</name><usage>read-write</usage><enumeratedValue><name>Peripheral</name><description>Read from peripheral</description><value>0</value></enumeratedValue><enumeratedValue><name>Memory</name><description>Read from memory</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TEIE</name>
                     <description>transfer error interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HTIE</name>
                     <description>half transfer interrupt               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HTIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TCIE</name>
                     <description>transfer complete interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EN</name>
                     <description>channel enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CNDTR2</name>
               <displayName>CNDTR2</displayName>
               <description>channel x number of data to transfer           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>number of data to transfer (0 to 218 -               1)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>262143</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CPAR2</name>
               <displayName>CPAR2</displayName>
               <description>channel x peripheral address           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CMAR2</name>
               <displayName>CMAR2</displayName>
               <description>channel x memory address           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
