tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>C3CR</name>
               <displayName>C3CR</displayName>
               <description>request line multiplexer channel x           configuration register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>Synchronization               identification</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  <enumeratedValues><name>SYNC_ID</name><usage>read-write</usage><enumeratedValue><name>exti0</name><description>Signal `EXTIx` selected as synchronization input</description><value>0</value></enumeratedValue><enumeratedValue><name>exti1</name><description>Signal `EXTIx` selected as synchronization input</description><value>1</value></enumeratedValue><enumeratedValue><name>exti2</name><description>Signal `EXTIx` selected as synchronization input</description><value>2</value></enumeratedValue><enumeratedValue><name>exti3</name><description>Signal `EXTIx` selected as synchronization input</description><value>3</value></enumeratedValue><enumeratedValue><name>exti4</name><description>Signal `EXTIx` selected as synchronization input</description><value>4</value></enumeratedValue><enumeratedValue><name>exti5</name><description>Signal `EXTIx` selected as synchronization input</description><value>5</value></enumeratedValue><enumeratedValue><name>exti6</name><description>Signal `EXTIx` selected as synchronization input</description><value>6</value></enumeratedValue><enumeratedValue><name>exti7</name><description>Signal `EXTIx` selected as synchronization input</description><value>7</value></enumeratedValue><enumeratedValue><name>exti8</name><description>Signal `EXTIx` selected as synchronization input</description><value>8</value></enumeratedValue><enumeratedValue><name>exti9</name><description>Signal `EXTIx` selected as synchronization input</description><value>9</value></enumeratedValue><enumeratedValue><name>exti10</name><description>Signal `EXTIx` selected as synchronization input</description><value>10</value></enumeratedValue><enumeratedValue><name>exti11</name><description>Signal `EXTIx` selected as synchronization input</description><value>11</value></enumeratedValue><enumeratedValue><name>exti12</name><description>Signal `EXTIx` selected as synchronization input</description><value>12</value></enumeratedValue><enumeratedValue><name>exti13</name><description>Signal `EXTIx` selected as synchronization input</description><value>13</value></enumeratedValue><enumeratedValue><name>exti14</name><description>Signal `EXTIx` selected as synchronization input</description><value>14</value></enumeratedValue><enumeratedValue><name>exti15</name><description>Signal `EXTIx` selected as synchronization input</description><value>15</value></enumeratedValue><enumeratedValue><name>dmamux1_evt0</name><description>Signal `dmamux1_evt0` selected as synchronization input</description><value>16</value></enumeratedValue><enumeratedValue><name>dmamux1_evt1</name><description>Signal `dmamux1_evt1` selected as synchronization input</description><value>17</value></enumeratedValue><enumeratedValue><name>lptim1_out</name><description>Signal `lptim1_out` selected as synchronization input</description><value>18</value></enumeratedValue><enumeratedValue><name>lptim2_out</name><description>Signal `lptim2_out` selected as synchronization input</description><value>19</value></enumeratedValue><enumeratedValue><name>lptim3_out</name><description>Signal `lptim3_out` selected as synchronization input</description><value>20</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Number of DMA requests minus 1 to               forward</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>SPOL</name>
                     <description>Synchronization polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>SPOL</name><usage>read-write</usage><enumeratedValue><name>NoEdge</name><description>No event, i.e. no synchronization nor detection</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Rising edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Falling edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Rising and falling edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Synchronization disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Synchronization enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EGE</name>
                     <description>Event generation enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EGE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Event generation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Event generation enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SOIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Synchronization overrun interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Synchronization overrun interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA request identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <enumeratedValues><name>DMAREQ_ID</name><usage>read-write</usage><enumeratedValue><name>none</name><description>No signal selected as request input</description><value>0</value></enumeratedValue><enumeratedValue><name>dmamux1_req_gen0</name><description>Signal `dmamux1_req_gen0` selected as request input</description><value>1</value></enumeratedValue><enumeratedValue><name>dmamux1_req_gen1</name><description>Signal `dmamux1_req_gen1` selected as request input</description><value>2</value></enumeratedValue><enumeratedValue><name>dmamux1_req_gen2</name><description>Signal `dmamux1_req_gen2` selected as request input</description><value>3</value></enumeratedValue><enumeratedValue><name>dmamux1_req_gen3</name><description>Signal `dmamux1_req_gen3` selected as request input</description><value>4</value></enumeratedValue><enumeratedValue><name>adc</name><description>Signal `adc1_dma` selected as request input</description><value>5</value></enumeratedValue><enumeratedValue><name>dat_out1</name><description>Signal `dac_out1_dma` selected as request input</description><value>6</value></enumeratedValue><enumeratedValue><name>spi1_rx_dma</name><description>Signal `spi1_rx_dma` selected as request input</description><value>7</value></enumeratedValue><enumeratedValue><name>spi1_tx_dma</name><description>Signal `spi1_tx_dma` selected as request input</description><value>8</value></enumeratedValue><enumeratedValue><name>spi2_rx_dma</name><description>Signal `spi2_rx_dma` selected as request input</description><value>9</value></enumeratedValue><enumeratedValue><name>spi2_tx_dma</name><description>Signal `spi2_tx_dma` selected as request input</description><value>10</value></enumeratedValue><enumeratedValue><name>i2c1_rx_dma</name><description>Signal `i2c1_rx_dma` selected as request input</description><value>11</value></enumeratedValue><enumeratedValue><name>i2c1_tx_dma</name><description>Signal `i2c1_tx_dma` selected as request input</description><value>12</value></enumeratedValue><enumeratedValue><name>i2c2_rx_dma</name><description>Signal `i2c2_rx_dma` selected as request input</description><value>13</value></enumeratedValue><enumeratedValue><name>i2c2_tx_dma</name><description>Signal `i2c2_tx_dma` selected as request input</description><value>14</value></enumeratedValue><enumeratedValue><name>i2c3_rx_dma</name><description>Signal `i2c3_rx_dma` selected as request input</description><value>15</value></enumeratedValue><enumeratedValue><name>i2c3_tx_dma</name><description>Signal `i2c3_tx_dma` selected as request input</description><value>16</value></enumeratedValue><enumeratedValue><name>usart1_rx_dma</name><description>Signal `usart1_rx_dma` selected as request input</description><value>17</value></enumeratedValue><enumeratedValue><name>usart1_tx_dma</name><description>Signal `usart1_tx_dma` selected as request input</description><value>18</value></enumeratedValue><enumeratedValue><name>usart2_rx_dma</name><description>Signal `usart2_rx_dma` selected as request input</description><value>19</value></enumeratedValue><enumeratedValue><name>usart2_tx_dma</name><description>Signal `usart2_tx_dma` selected as request input</description><value>20</value></enumeratedValue><enumeratedValue><name>lpuart1_rx_dma</name><description>Signal `lpuart1_rx_dma` selected as request input</description><value>21</value></enumeratedValue><enumeratedValue><name>lpuart1_tx_dma</name><description>Signal `lpuart1_tx_dma` selected as request input</description><value>22</value></enumeratedValue><enumeratedValue><name>tim1_ch1</name><description>Signal `tim1_ch1` selected as request input</description><value>23</value></enumeratedValue><enumeratedValue><name>tim1_ch2</name><description>Signal `tim1_ch2` selected as request input</description><value>24</value></enumeratedValue><enumeratedValue><name>tim1_ch3</name><description>Signal `tim1_ch3` selected as request input</description><value>25</value></enumeratedValue><enumeratedValue><name>tim1_ch4</name><description>Signal `tim1_ch4` selected as request input</description><value>26</value></enumeratedValue><enumeratedValue><name>tim1_up</name><description>Signal `tim1_up` selected as request input</description><value>27</value></enumeratedValue><enumeratedValue><name>tim1_trig</name><description>Signal `tim1_trig` selected as request input</description><value>28</value></enumeratedValue><enumeratedValue><name>tim1_com</name><description>Signal `tim1_com` selected as request input</description><value>29</value></enumeratedValue><enumeratedValue><name>tim2_ch1</name><description>Signal `tim2_ch1` selected as request input</description><value>30</value></enumeratedValue><enumeratedValue><name>tim2_ch2</name><description>Signal `tim2_ch2` selected as request input</description><value>31</value></enumeratedValue><enumeratedValue><name>tim2_ch3</name><description>Signal `tim2_ch3` selected as request input</description><value>32</value></enumeratedValue><enumeratedValue><name>tim2_ch4</name><description>Signal `tim2_ch4` selected as request input</description><value>33</value></enumeratedValue><enumeratedValue><name>tim2_up</name><description>Signal `tim2_up` selected as request input</description><value>34</value></enumeratedValue><enumeratedValue><name>tim16_ch1</name><description>Signal `tim16_ch1` selected as request input</description><value>35</value></enumeratedValue><enumeratedValue><name>tim16_up</name><description>Signal `tim16_up` selected as request input</description><value>36</value></enumeratedValue><enumeratedValue><name>tim17_ch1</name><description>Signal `tim17_ch1` selected as request input</description><value>37</value></enumeratedValue><enumeratedValue><name>tim17_up</name><description>Signal `tim17_up` selected as request input</description><value>38</value></enumeratedValue><enumeratedValue><name>aes_in</name><description>Signal `aes_in` selected as request input</description><value>39</value></enumeratedValue><enumeratedValue><name>aes_out</name><description>Signal `aes_out` selected as request input</description><value>40</value></enumeratedValue><enumeratedValue><name>subghzspi_rx</name><description>Signal `subghzspi_rx` selected as request input</description><value>41</value></enumeratedValue><enumeratedValue><name>subghzspi_tx</name><description>Signal `subghzspi_tx` selected as request input</description><value>42</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
