tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>request line multiplexer interrupt channel           status register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOF13</name>
                     <description>Synchronization overrun event               flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF10"/>
            </field>
                  <field>
                     <name>SOF12</name>
                     <description>SOF12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF10"/>
            </field>
                  <field>
                     <name>SOF11</name>
                     <description>SOF11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF10"/>
            </field>
                  <field>
                     <name>SOF10</name>
                     <description>SOF10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SOF10</name><usage>read-write</usage><enumeratedValue><name>NoSyncEvent</name><description>No synchronization event occured on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ</description><value>0</value></enumeratedValue><enumeratedValue><name>SyncEvent</name><description>Synchronization event occured on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SOF9</name>
                     <description>SOF9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF0"/>
            </field>
                  <field>
                     <name>SOF8</name>
                     <description>SOF8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF0"/>
            </field>
                  <field>
                     <name>SOF7</name>
                     <description>SOF7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF0"/>
            </field>
                  <field>
                     <name>SOF6</name>
                     <description>SOF6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF0"/>
            </field>
                  <field>
                     <name>SOF5</name>
                     <description>SOF5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF0"/>
            </field>
                  <field>
                     <name>SOF4</name>
                     <description>SOF4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF0"/>
            </field>
                  <field>
                     <name>SOF3</name>
                     <description>SOF3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF0"/>
            </field>
                  <field>
                     <name>SOF2</name>
                     <description>SOF2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF0"/>
            </field>
                  <field>
                     <name>SOF1</name>
                     <description>SOF1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SOF0"/>
            </field>
                  <field>
                     <name>SOF0</name>
                     <description>SOF0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SOF0</name><usage>read-write</usage><enumeratedValue><name>NoSyncEvent</name><description>No synchronization event occured on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ</description><value>0</value></enumeratedValue><enumeratedValue><name>SyncEvent</name><description>Synchronization event occured on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CCFR</name>
               <displayName>CCFR</displayName>
               <description>request line multiplexer interrupt channel           clear flag register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSOF13</name>
                     <description>CSOF13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF10"/>
            </field>
                  <field>
                     <name>CSOF12</name>
                     <description>CSOF12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF10"/>
            </field>
                  <field>
                     <name>CSOF11</name>
                     <description>CSOF11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF10"/>
            </field>
                  <field>
                     <name>CSOF10</name>
                     <description>CSOF10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CSOF10</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear synchronization flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CSOF9</name>
                     <description>CSOF9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF0"/>
            </field>
                  <field>
                     <name>CSOF8</name>
                     <description>CSOF8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF0"/>
            </field>
                  <field>
                     <name>CSOF7</name>
                     <description>CSOF7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF0"/>
            </field>
                  <field>
                     <name>CSOF6</name>
                     <description>CSOF6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF0"/>
            </field>
                  <field>
                     <name>CSOF5</name>
                     <description>CSOF5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF0"/>
            </field>
                  <field>
                     <name>CSOF4</name>
                     <description>CSOF4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF0"/>
            </field>
                  <field>
                     <name>CSOF3</name>
                     <description>CSOF3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF0"/>
            </field>
                  <field>
                     <name>CSOF2</name>
                     <description>CSOF2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF0"/>
            </field>
                  <field>
                     <name>CSOF1</name>
                     <description>CSOF1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CSOF0"/>
            </field>
                  <field>
                     <name>CSOF0</name>
                     <description>CSOF0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CSOF0</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear synchronization flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RG0CR</name>
               <displayName>RG0CR</displayName>
               <description>request generator channel x configuration           register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to be generated               (minus 1)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger               polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>GPOL</name><usage>read-write</usage><enumeratedValue><name>NoEdge</name><description>No event, i.e. no detection nor generation</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Rising edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Falling edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Rising and falling edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel x               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA request generation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OIE</name>
                     <description>Trigger overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Trigger overrun interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Trigger overrun interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  <enumeratedValues><name>SIG_ID</name><usage>read-write</usage><enumeratedValue><name>exti0</name><description>Signal `EXTIx` selected as synchronization input</description><value>0</value></enumeratedValue><enumeratedValue><name>exti1</name><description>Signal `EXTIx` selected as synchronization input</description><value>1</value></enumeratedValue><enumeratedValue><name>exti2</name><description>Signal `EXTIx` selected as synchronization input</description><value>2</value></enumeratedValue><enumeratedValue><name>exti3</name><description>Signal `EXTIx` selected as synchronization input</description><value>3</value></enumeratedValue><enumeratedValue><name>exti4</name><description>Signal `EXTIx` selected as synchronization input</description><value>4</value></enumeratedValue><enumeratedValue><name>exti5</name><description>Signal `EXTIx` selected as synchronization input</description><value>5</value></enumeratedValue><enumeratedValue><name>exti6</name><description>Signal `EXTIx` selected as synchronization input</description><value>6</value></enumeratedValue><enumeratedValue><name>exti7</name><description>Signal `EXTIx` selected as synchronization input</description><value>7</value></enumeratedValue><enumeratedValue><name>exti8</name><description>Signal `EXTIx` selected as synchronization input</description><value>8</value></enumeratedValue><enumeratedValue><name>exti9</name><description>Signal `EXTIx` selected as synchronization input</description><value>9</value></enumeratedValue><enumeratedValue><name>exti10</name><description>Signal `EXTIx` selected as synchronization input</description><value>10</value></enumeratedValue><enumeratedValue><name>exti11</name><description>Signal `EXTIx` selected as synchronization input</description><value>11</value></enumeratedValue><enumeratedValue><name>exti12</name><description>Signal `EXTIx` selected as synchronization input</description><value>12</value></enumeratedValue><enumeratedValue><name>exti13</name><description>Signal `EXTIx` selected as synchronization input</description><value>13</value></enumeratedValue><enumeratedValue><name>exti14</name><description>Signal `EXTIx` selected as synchronization input</description><value>14</value></enumeratedValue><enumeratedValue><name>exti15</name><description>Signal `EXTIx` selected as synchronization input</description><value>15</value></enumeratedValue><enumeratedValue><name>dmamux1_evt0</name><description>Signal `dmamux1_evt0` selected as synchronization input</description><value>16</value></enumeratedValue><enumeratedValue><name>dmamux1_evt1</name><description>Signal `dmamux1_evt1` selected as synchronization input</description><value>17</value></enumeratedValue><enumeratedValue><name>lptim1_out</name><description>Signal `lptim1_out` selected as synchronization input</description><value>18</value></enumeratedValue><enumeratedValue><name>lptim2_out</name><description>Signal `lptim2_out` selected as synchronization input</description><value>19</value></enumeratedValue><enumeratedValue><name>lptim3_out</name><description>Signal `lptim3_out` selected as synchronization input</description><value>20</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RG1CR</name>
               <displayName>RG1CR</displayName>
               <description>request generator channel x configuration           register</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to be generated               (minus 1)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger               polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>GPOL</name><usage>read-write</usage><enumeratedValue><name>NoEdge</name><description>No event, i.e. no detection nor generation</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Rising edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Falling edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Rising and falling edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel x               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA request generation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OIE</name>
                     <description>Trigger overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Trigger overrun interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Trigger overrun interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  <enumeratedValues><name>SIG_ID</name><usage>read-write</usage><enumeratedValue><name>exti0</name><description>Signal `EXTIx` selected as synchronization input</description><value>0</value></enumeratedValue><enumeratedValue><name>exti1</name><description>Signal `EXTIx` selected as synchronization input</description><value>1</value></enumeratedValue><enumeratedValue><name>exti2</name><description>Signal `EXTIx` selected as synchronization input</description><value>2</value></enumeratedValue><enumeratedValue><name>exti3</name><description>Signal `EXTIx` selected as synchronization input</description><value>3</value></enumeratedValue><enumeratedValue><name>exti4</name><description>Signal `EXTIx` selected as synchronization input</description><value>4</value></enumeratedValue><enumeratedValue><name>exti5</name><description>Signal `EXTIx` selected as synchronization input</description><value>5</value></enumeratedValue><enumeratedValue><name>exti6</name><description>Signal `EXTIx` selected as synchronization input</description><value>6</value></enumeratedValue><enumeratedValue><name>exti7</name><description>Signal `EXTIx` selected as synchronization input</description><value>7</value></enumeratedValue><enumeratedValue><name>exti8</name><description>Signal `EXTIx` selected as synchronization input</description><value>8</value></enumeratedValue><enumeratedValue><name>exti9</name><description>Signal `EXTIx` selected as synchronization input</description><value>9</value></enumeratedValue><enumeratedValue><name>exti10</name><description>Signal `EXTIx` selected as synchronization input</description><value>10</value></enumeratedValue><enumeratedValue><name>exti11</name><description>Signal `EXTIx` selected as synchronization input</description><value>11</value></enumeratedValue><enumeratedValue><name>exti12</name><description>Signal `EXTIx` selected as synchronization input</description><value>12</value></enumeratedValue><enumeratedValue><name>exti13</name><description>Signal `EXTIx` selected as synchronization input</description><value>13</value></enumeratedValue><enumeratedValue><name>exti14</name><description>Signal `EXTIx` selected as synchronization input</description><value>14</value></enumeratedValue><enumeratedValue><name>exti15</name><description>Signal `EXTIx` selected as synchronization input</description><value>15</value></enumeratedValue><enumeratedValue><name>dmamux1_evt0</name><description>Signal `dmamux1_evt0` selected as synchronization input</description><value>16</value></enumeratedValue><enumeratedValue><name>dmamux1_evt1</name><description>Signal `dmamux1_evt1` selected as synchronization input</description><value>17</value></enumeratedValue><enumeratedValue><name>lptim1_out</name><description>Signal `lptim1_out` selected as synchronization input</description><value>18</value></enumeratedValue><enumeratedValue><name>lptim2_out</name><description>Signal `lptim2_out` selected as synchronization input</description><value>19</value></enumeratedValue><enumeratedValue><name>lptim3_out</name><description>Signal `lptim3_out` selected as synchronization input</description><value>20</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
