tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>RG2CR</name>
               <displayName>RG2CR</displayName>
               <description>request generator channel x configuration           register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to be generated               (minus 1)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger               polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>GPOL</name><usage>read-write</usage><enumeratedValue><name>NoEdge</name><description>No event, i.e. no detection nor generation</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Rising edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Falling edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Rising and falling edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel x               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA request generation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OIE</name>
                     <description>Trigger overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Trigger overrun interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Trigger overrun interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  <enumeratedValues><name>SIG_ID</name><usage>read-write</usage><enumeratedValue><name>exti0</name><description>Signal `EXTIx` selected as synchronization input</description><value>0</value></enumeratedValue><enumeratedValue><name>exti1</name><description>Signal `EXTIx` selected as synchronization input</description><value>1</value></enumeratedValue><enumeratedValue><name>exti2</name><description>Signal `EXTIx` selected as synchronization input</description><value>2</value></enumeratedValue><enumeratedValue><name>exti3</name><description>Signal `EXTIx` selected as synchronization input</description><value>3</value></enumeratedValue><enumeratedValue><name>exti4</name><description>Signal `EXTIx` selected as synchronization input</description><value>4</value></enumeratedValue><enumeratedValue><name>exti5</name><description>Signal `EXTIx` selected as synchronization input</description><value>5</value></enumeratedValue><enumeratedValue><name>exti6</name><description>Signal `EXTIx` selected as synchronization input</description><value>6</value></enumeratedValue><enumeratedValue><name>exti7</name><description>Signal `EXTIx` selected as synchronization input</description><value>7</value></enumeratedValue><enumeratedValue><name>exti8</name><description>Signal `EXTIx` selected as synchronization input</description><value>8</value></enumeratedValue><enumeratedValue><name>exti9</name><description>Signal `EXTIx` selected as synchronization input</description><value>9</value></enumeratedValue><enumeratedValue><name>exti10</name><description>Signal `EXTIx` selected as synchronization input</description><value>10</value></enumeratedValue><enumeratedValue><name>exti11</name><description>Signal `EXTIx` selected as synchronization input</description><value>11</value></enumeratedValue><enumeratedValue><name>exti12</name><description>Signal `EXTIx` selected as synchronization input</description><value>12</value></enumeratedValue><enumeratedValue><name>exti13</name><description>Signal `EXTIx` selected as synchronization input</description><value>13</value></enumeratedValue><enumeratedValue><name>exti14</name><description>Signal `EXTIx` selected as synchronization input</description><value>14</value></enumeratedValue><enumeratedValue><name>exti15</name><description>Signal `EXTIx` selected as synchronization input</description><value>15</value></enumeratedValue><enumeratedValue><name>dmamux1_evt0</name><description>Signal `dmamux1_evt0` selected as synchronization input</description><value>16</value></enumeratedValue><enumeratedValue><name>dmamux1_evt1</name><description>Signal `dmamux1_evt1` selected as synchronization input</description><value>17</value></enumeratedValue><enumeratedValue><name>lptim1_out</name><description>Signal `lptim1_out` selected as synchronization input</description><value>18</value></enumeratedValue><enumeratedValue><name>lptim2_out</name><description>Signal `lptim2_out` selected as synchronization input</description><value>19</value></enumeratedValue><enumeratedValue><name>lptim3_out</name><description>Signal `lptim3_out` selected as synchronization input</description><value>20</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RG3CR</name>
               <displayName>RG3CR</displayName>
               <description>request generator channel x configuration           register</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of DMA requests to be generated               (minus 1)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>GPOL</name>
                     <description>DMA request generator trigger               polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>GPOL</name><usage>read-write</usage><enumeratedValue><name>NoEdge</name><description>No event, i.e. no detection nor generation</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Rising edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Falling edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Rising and falling edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>GE</name>
                     <description>DMA request generator channel x               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA request generation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OIE</name>
                     <description>Trigger overrun interrupt               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Trigger overrun interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Trigger overrun interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  <enumeratedValues><name>SIG_ID</name><usage>read-write</usage><enumeratedValue><name>exti0</name><description>Signal `EXTIx` selected as synchronization input</description><value>0</value></enumeratedValue><enumeratedValue><name>exti1</name><description>Signal `EXTIx` selected as synchronization input</description><value>1</value></enumeratedValue><enumeratedValue><name>exti2</name><description>Signal `EXTIx` selected as synchronization input</description><value>2</value></enumeratedValue><enumeratedValue><name>exti3</name><description>Signal `EXTIx` selected as synchronization input</description><value>3</value></enumeratedValue><enumeratedValue><name>exti4</name><description>Signal `EXTIx` selected as synchronization input</description><value>4</value></enumeratedValue><enumeratedValue><name>exti5</name><description>Signal `EXTIx` selected as synchronization input</description><value>5</value></enumeratedValue><enumeratedValue><name>exti6</name><description>Signal `EXTIx` selected as synchronization input</description><value>6</value></enumeratedValue><enumeratedValue><name>exti7</name><description>Signal `EXTIx` selected as synchronization input</description><value>7</value></enumeratedValue><enumeratedValue><name>exti8</name><description>Signal `EXTIx` selected as synchronization input</description><value>8</value></enumeratedValue><enumeratedValue><name>exti9</name><description>Signal `EXTIx` selected as synchronization input</description><value>9</value></enumeratedValue><enumeratedValue><name>exti10</name><description>Signal `EXTIx` selected as synchronization input</description><value>10</value></enumeratedValue><enumeratedValue><name>exti11</name><description>Signal `EXTIx` selected as synchronization input</description><value>11</value></enumeratedValue><enumeratedValue><name>exti12</name><description>Signal `EXTIx` selected as synchronization input</description><value>12</value></enumeratedValue><enumeratedValue><name>exti13</name><description>Signal `EXTIx` selected as synchronization input</description><value>13</value></enumeratedValue><enumeratedValue><name>exti14</name><description>Signal `EXTIx` selected as synchronization input</description><value>14</value></enumeratedValue><enumeratedValue><name>exti15</name><description>Signal `EXTIx` selected as synchronization input</description><value>15</value></enumeratedValue><enumeratedValue><name>dmamux1_evt0</name><description>Signal `dmamux1_evt0` selected as synchronization input</description><value>16</value></enumeratedValue><enumeratedValue><name>dmamux1_evt1</name><description>Signal `dmamux1_evt1` selected as synchronization input</description><value>17</value></enumeratedValue><enumeratedValue><name>lptim1_out</name><description>Signal `lptim1_out` selected as synchronization input</description><value>18</value></enumeratedValue><enumeratedValue><name>lptim2_out</name><description>Signal `lptim2_out` selected as synchronization input</description><value>19</value></enumeratedValue><enumeratedValue><name>lptim3_out</name><description>Signal `lptim3_out` selected as synchronization input</description><value>20</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RGSR</name>
               <displayName>RGSR</displayName>
               <description>request generator interrupt status           register</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OF3</name>
                     <description>Trigger overrun event flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OF0"/>
            </field>
                  <field>
                     <name>OF2</name>
                     <description>OF2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OF0"/>
            </field>
                  <field>
                     <name>OF1</name>
                     <description>OF1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OF0"/>
            </field>
                  <field>
                     <name>OF0</name>
                     <description>OF0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OF0</name><usage>read-write</usage><enumeratedValue><name>NoTrigger</name><description>No new trigger event occured on DMA request generator channel x, before the request counter underrun</description><value>0</value></enumeratedValue><enumeratedValue><name>Trigger</name><description>New trigger event occured on DMA request generator channel x, before the request counter underrun</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RGCFR</name>
               <displayName>RGCFR</displayName>
               <description>request generator interrupt clear flag           register</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COF3</name>
                     <description>Clear trigger overrun event               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="COF0"/>
            </field>
                  <field>
                     <name>COF2</name>
                     <description>COF2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="COF0"/>
            </field>
                  <field>
                     <name>COF1</name>
                     <description>COF1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="COF0"/>
            </field>
                  <field>
                     <name>COF0</name>
                     <description>COF0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>COF0</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear overrun flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>                                 
