tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>EXTI</name>
         <description>External interrupt/event       controller</description>
         <groupName>EXTI</groupName>
         <baseAddress>0x58000800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PVD_PVM_3</name>
            <description>PVD through EXTI[16],
             PVM[3] through EXTI[34]</description>
            <value>1</value>
         </interrupt>
         <interrupt>
            <name>EXTI0</name>
            <description>EXTI line 0 interrupt through
        EXTI</description>
            <value>6</value>
         </interrupt>
         <interrupt>
            <name>EXTI1</name>
            <description>EXTI line 1 interrupt through
        EXTI</description>
            <value>7</value>
         </interrupt>
         <interrupt>
            <name>EXTI2</name>
            <description>EXTI line 2 interrupt through
        EXTI</description>
            <value>8</value>
         </interrupt>
         <interrupt>
            <name>EXTI3</name>
            <description>EXTI line 3 interrupt through
        EXTI</description>
            <value>9</value>
         </interrupt>
         <interrupt>
            <name>EXTI4</name>
            <description>EXTI line 4 interrupt through
        EXTI</description>
            <value>10</value>
         </interrupt>
         <interrupt>
            <name>EXTI9_5</name>
            <description>EXTI line 9_5 interrupt through
        EXTI</description>
            <value>22</value>
         </interrupt>
         <interrupt>
            <name>EXTI15_10</name>
            <description>EXTI line 15_10] interrupt through
        EXTI</description>
            <value>41</value>
         </interrupt>
         <interrupt>
            <name>Radio_IRQ_Busy</name>
            <description>Radio IRQs, RFBUSY interrupt through
        EXTI</description>
            <value>50</value>
         </interrupt>
         <registers>
            <register>
               <name>RTSR1</name>
               <displayName>RTSR1</displayName>
               <description>rising trigger selection           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RT21</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="RT0"/>
            </field>
               <field><name>RT22</name><description>Rising trigger event configuration bit of Configurable Event input</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues derivedFrom="RT0"/>
            </field>
            <field><name>RT0</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>RT0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Rising edge trigger is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Rising edge trigger is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field><field><name>RT1</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT2</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT3</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT4</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT5</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT6</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT7</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT8</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT9</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT10</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT11</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT12</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT13</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT14</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT15</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field><field><name>RT16</name><description>Rising trigger event configuration bit               of Configurable Event input</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="RT0"/>
            </field></fields>
            </register>
            <register>
               <name>FTSR1</name>
               <displayName>FTSR1</displayName>
               <description>falling trigger selection           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FT21</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="FT0"/>
            </field>
               <field><name>FT22</name><description>Falling trigger event configuration bit of Configurable Event input</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues derivedFrom="FT0"/>
            </field>
            <field><name>FT0</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>FT0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Falling edge trigger is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Falling edge trigger is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field><field><name>FT1</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT2</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT3</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT4</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT5</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT6</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT7</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT8</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT9</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT10</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT11</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT12</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT13</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT14</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT15</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field><field><name>FT16</name><description>Falling trigger event configuration bit               of Configurable Event input</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="FT0"/>
            </field></fields>
            </register>
            <register>
               <name>SWIER1</name>
               <displayName>SWIER1</displayName>
               <description>software interrupt event           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWI21</name>
                     <description>Software interrupt on               event</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SWI0W"/>
            </field>
               <field><name>SWI22</name><description>Software interrupt on event</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field><name>SWI0</name><description>Software interrupt on               event</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>SWI0W</name><usage>write</usage><enumeratedValue><name>Pend</name><description>Generates an interrupt request</description><value>1</value></enumeratedValue></enumeratedValues>
            </field><field><name>SWI1</name><description>Software interrupt on               event</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI2</name><description>Software interrupt on               event</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI3</name><description>Software interrupt on               event</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI4</name><description>Software interrupt on               event</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI5</name><description>Software interrupt on               event</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI6</name><description>Software interrupt on               event</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI7</name><description>Software interrupt on               event</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI8</name><description>Software interrupt on               event</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI9</name><description>Software interrupt on               event</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI10</name><description>Software interrupt on               event</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI11</name><description>Software interrupt on               event</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI12</name><description>Software interrupt on               event</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI13</name><description>Software interrupt on               event</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI14</name><description>Software interrupt on               event</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI15</name><description>Software interrupt on               event</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field><field><name>SWI16</name><description>Software interrupt on               event</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="SWI0W"/>
            </field></fields>
            </register>
            <register>
               <name>PR1</name>
               <displayName>PR1</displayName>
               <description>EXTI pending register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PIF21</name>
                     <description>Configurable event inputs Pending               bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field>
               <field><name>PIF22</name><description>Configurable event inputs Pending bit</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field>
            <field><name>PIF0</name><description>Configurable event inputs Pending               bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>PIF0R</name><usage>read</usage><enumeratedValue><name>NotPending</name><description>No trigger request occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Pending</name><description>Selected trigger request occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>PIF0W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears pending bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field><field><name>PIF1</name><description>Configurable event inputs Pending               bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF2</name><description>Configurable event inputs Pending               bit</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF3</name><description>Configurable event inputs Pending               bit</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF4</name><description>Configurable event inputs Pending               bit</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF5</name><description>Configurable event inputs Pending               bit</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF6</name><description>Configurable event inputs Pending               bit</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF7</name><description>Configurable event inputs Pending               bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF8</name><description>Configurable event inputs Pending               bit</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF9</name><description>Configurable event inputs Pending               bit</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF10</name><description>Configurable event inputs Pending               bit</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF11</name><description>Configurable event inputs Pending               bit</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF12</name><description>Configurable event inputs Pending               bit</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF13</name><description>Configurable event inputs Pending               bit</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF14</name><description>Configurable event inputs Pending               bit</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF15</name><description>Configurable event inputs Pending               bit</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field><field><name>PIF16</name><description>Configurable event inputs Pending               bit</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PIF0R"/>
            <enumeratedValues derivedFrom="PIF0W"/>
            </field></fields>
            </register>
