tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>RTSR2</name>
               <displayName>RTSR2</displayName>
               <description>rising trigger selection           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RT34</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RT34</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Rising edge trigger is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Rising edge trigger is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>                
                  <field>
                     <name>RT45</name>
                     <description>Rising trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="RT34"/>
            </field>
               </fields>
            </register>
            <register>
               <name>FTSR2</name>
               <displayName>FTSR2</displayName>
               <description>falling trigger selection           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FT34</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>FT34</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Falling edge trigger is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Falling edge trigger is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FT45</name>
                     <description>Falling trigger event configuration bit               of Configurable Event input</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="FT34"/>
            </field>
               </fields>
            </register>
            <register>
               <name>SWIER2</name>
               <displayName>SWIER2</displayName>
               <description>software interrupt event           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWI34</name>
                     <description>Software interrupt on               event</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SWI34W</name><usage>write</usage><enumeratedValue><name>Pend</name><description>Generates an interrupt request</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SWI45</name>
                     <description>Software interrupt on event               45</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="SWI34W"/>
            </field>
               </fields>
            </register>
            <register>
               <name>PR2</name>
               <displayName>PR2</displayName>
               <description>pending register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PIF34</name>
                     <description>Configurable event inputs 33 Pending               bit.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PIF34R</name><usage>read</usage><enumeratedValue><name>NotPending</name><description>No trigger request occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Pending</name><description>Selected trigger request occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>PIF34W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears pending bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PIF45</name>
                     <description>Configurable event inputs 45 Pending               bit.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PIF34R"/>
            <enumeratedValues derivedFrom="PIF34W"/>
            </field>
               </fields>
            </register>
            <register>
               <name>C1IMR1</name>
               <displayName>IMR1</displayName>
               <description>interrupt mask register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field><name>IM0</name><description>wakeup with interrupt Mask on event input</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>IM0</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field><field><name>IM1</name><description>wakeup with interrupt Mask on event input</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM2</name><description>wakeup with interrupt Mask on event input</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM3</name><description>wakeup with interrupt Mask on event input</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM4</name><description>wakeup with interrupt Mask on event input</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM5</name><description>wakeup with interrupt Mask on event input</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM6</name><description>wakeup with interrupt Mask on event input</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM7</name><description>wakeup with interrupt Mask on event input</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM8</name><description>wakeup with interrupt Mask on event input</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM9</name><description>wakeup with interrupt Mask on event input</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM10</name><description>wakeup with interrupt Mask on event input</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM11</name><description>wakeup with interrupt Mask on event input</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM12</name><description>wakeup with interrupt Mask on event input</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM13</name><description>wakeup with interrupt Mask on event input</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM14</name><description>wakeup with interrupt Mask on event input</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM15</name><description>wakeup with interrupt Mask on event input</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM16</name><description>wakeup with interrupt Mask on event input</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM17</name><description>wakeup with interrupt Mask on event input</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM18</name><description>wakeup with interrupt Mask on event input</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM19</name><description>wakeup with interrupt Mask on event input</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM20</name><description>wakeup with interrupt Mask on event input</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM21</name><description>wakeup with interrupt Mask on event input</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM22</name><description>wakeup with interrupt Mask on event input</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM23</name><description>wakeup with interrupt Mask on event input</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM24</name><description>wakeup with interrupt Mask on event input</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM25</name><description>wakeup with interrupt Mask on event input</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM26</name><description>wakeup with interrupt Mask on event input</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM27</name><description>wakeup with interrupt Mask on event input</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM28</name><description>wakeup with interrupt Mask on event input</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM29</name><description>wakeup with interrupt Mask on event input</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM30</name><description>wakeup with interrupt Mask on event input</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field><field><name>IM31</name><description>wakeup with interrupt Mask on event input</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="IM0"/>
            </field></fields>
            </register>
            <register>
               <name>EMR1</name>
               <displayName>EMR1</displayName>
               <description>event mask register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
			   <fields>
				<field>
				  <name>EM0</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>EM0</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>EM1</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM2</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM3</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM4</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM5</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM6</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM7</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM8</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM9</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM10</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM11</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM12</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM13</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM14</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM15</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM17</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM18</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM19</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM20</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM21</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>
				<field>
				  <name>EM22</name>
				  <description>Wakeup with event generation Mask               on Event input</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="EM0"/>
            </field>            
               </fields>
            </register>
            <register>
               <name>C1IMR2</name>
               <displayName>IMR2</displayName>
               <description>interrupt mask           register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IM34</name>
                     <description>CPUm Wakeup with interrupt Mask on Event               input</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>IM34</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				  <field>
                     <name>IM38</name>
                     <description>CPUm Wakeup with interrupt Mask on Event               input</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IM34"/>
            </field>
				  <field>
                     <name>IM42</name>
                     <description>CPUm Wakeup with interrupt Mask on Event               input</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IM34"/>
            </field>
               <field><name>IM43</name><description>CPUm Wakeup with interrupt Mask on Event input</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues derivedFrom="IM34"/>
            </field>
            <field><name>IM44</name><description>CPUm Wakeup with interrupt Mask on Event input</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues derivedFrom="IM34"/>
            </field>
            <field><name>IM45</name><description>CPUm Wakeup with interrupt Mask on Event input</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues derivedFrom="IM34"/>
            </field>
            <field><name>IM46</name><description>CPUm Wakeup with interrupt Mask on Event input</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access><enumeratedValues derivedFrom="IM34"/>
            </field>
            </fields>
            </register>    
