tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>FLASH</name>
         <description>Flash</description>
         <groupName>Flash</groupName>
         <baseAddress>0x58004000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FLASH</name>
            <description>Flash memory global interrupt and Flash memory ECC
             single error interrupt</description>
            <value>4</value>
         </interrupt>
         <registers>
            <register>
               <name>ACR</name>
               <displayName>ACR</displayName>
               <description>Access control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000600</resetValue>
               <fields>
                  <field>
                     <name>LATENCY</name>
                     <description>Latency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>LATENCY</name><usage>read-write</usage><enumeratedValue><name>WS0</name><description>0 wait states</description><value>0</value></enumeratedValue><enumeratedValue><name>WS1</name><description>1 wait states</description><value>1</value></enumeratedValue><enumeratedValue><name>WS2</name><description>2 wait states</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PRFTEN</name>
                     <description>Prefetch enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PRFTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Prefetch is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Prefetch is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ICEN</name>
                     <description>Instruction cache enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ICEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Instruction cache is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Instruction cache is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DCEN</name>
                     <description>Data cache enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Data cache is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Data cache is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ICRST</name>
                     <description>Instruction cache reset</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ICRST</name><usage>read-write</usage><enumeratedValue><name>NotReset</name><description>Instruction cache is not reset</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Instruction cache is reset</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DCRST</name>
                     <description>Data cache reset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DCRST</name><usage>read-write</usage><enumeratedValue><name>NotReset</name><description>Data cache is not reset</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Data cache is reset</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PES</name>
                     <description>CPU1 programm erase suspend               request</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PES</name><usage>read-write</usage><enumeratedValue><name>Granted</name><description>Flash program and erase operations granted</description><value>0</value></enumeratedValue><enumeratedValue><name>Suspended</name><description>Any new Flash program and erase operation is suspended until this bit is cleared. The PESD bit in FLASH_SR is set when PES bit in FLASH_ACR is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EMPTY</name>
                     <description>Flash User area empty</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EMPTY</name><usage>read-write</usage><enumeratedValue><name>Programmed</name><description>User Flash programmend</description><value>0</value></enumeratedValue><enumeratedValue><name>Empty</name><description>User Flash empty</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>      
            <register>
               <name>KEYR</name>
               <displayName>KEYR</displayName>
               <description>Flash key register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>KEY</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>OPTKEYR</name>
               <displayName>OPTKEYR</displayName>
               <description>Option byte key register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPTKEY</name>
                     <description>Option byte key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>Status register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EOP</name>
                     <description>End of operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>EOPR</name><usage>read</usage><enumeratedValue><name>NoEvent</name><description>No EOP operation occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Event</name><description>An EOP event occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>EOPW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OPERR</name>
                     <description>Operation error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>OPERRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No memory opreation error happened</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Memory operation error happened</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>OPERRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PROGERR</name>
                     <description>Programming error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>PROGERRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No size programming error happened</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Programming error happened</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>PROGERRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WRPERR</name>
                     <description>Write protected error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>WRPERRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No write protection error happened</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Write protection error happened</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>WRPERRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PGAERR</name>
                     <description>Programming alignment               error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>PGAERRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No programming alignment error happened</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Programming alignment error happened</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>PGAERRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SIZERR</name>
                     <description>Size error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>SIZERRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No size error happened</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Size error happened</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>SIZERRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PGSERR</name>
                     <description>Programming sequence error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>PGSERRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No fast programming sequence error happened</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Fast programming sequence error happened</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>PGSERRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MISSERR</name>
                     <description>Fast programming data miss               error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>MISSERRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No fast programming data miss error happened</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Fast programming data miss error happened</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>MISSERRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FASTERR</name>
                     <description>Fast programming error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>FASTERRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No fast programming error happened</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Fast programming error happened</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>FASTERRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OPTNV</name>
                     <description>User Option OPTIVAL               indication</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>OPTNV</name><usage>read-write</usage><enumeratedValue><name>Valid</name><description>The OBL user option OPTVAL indicates "valid"</description><value>0</value></enumeratedValue><enumeratedValue><name>Invalid</name><description>The OBL user option OPTVAL indicates "invalid"</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RDERR</name>
                     <description>PCROP read error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>RDERRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No read-only error happened</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Read-only error happened</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>RDERRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OPTVERR</name>
                     <description>Option validity error</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>OPTVERRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No error in option and engineering bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Error in option and engineering bits</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>OPTVERRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BSY</name>
                     <description>Busy</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>BSY</name><usage>read-write</usage><enumeratedValue><name>Inactive</name><description>No write/erase operation is in progress</description><value>0</value></enumeratedValue><enumeratedValue><name>Active</name><description>No write/erase operation is in progress</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CFGBSY</name>
                     <description>Programming or erase configuration               busy</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>CFGBSY</name><usage>read-write</usage><enumeratedValue><name>Free</name><description>PG, PNB, PER, MER bits available for writing</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>PG, PNB, PER, MER bits not available for writing (operation ongoing)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PESD</name>
                     <description>Programming / erase operation               suspended</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>PESD</name><usage>read-write</usage><enumeratedValue><name>Granted</name><description>Flash program and erase operations granted</description><value>0</value></enumeratedValue><enumeratedValue><name>Suspended</name><description>Any new Flash program and erase operation is suspended until this bit is cleared. This bit is set when the PES bit in FLASH_ACR is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
