tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Flash control register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xC0000000</resetValue>
               <fields>
                  <field>
                     <name>PG</name>
                     <description>Programming</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PG</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Flash programming disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Flash programming enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PER</name>
                     <description>Page erase</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PER</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Page erase disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Page erase enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MER</name>
                     <description>Mass erase</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MER</name><usage>read-write</usage><enumeratedValue><name>NoErase</name><description>No mass erase</description><value>0</value></enumeratedValue><enumeratedValue><name>MassErase</name><description>Trigger mass erase</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PNB</name>
                     <description>Page number</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>7</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>STRT</name>
                     <description>Start</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>STRTR</name><usage>read</usage><enumeratedValue><name>Done</name><description>Options modification completed or idle</description><value>0</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>STRTW</name><usage>write</usage><enumeratedValue><name>Start</name><description>Trigger options programming operation</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OPTSTRT</name>
                     <description>Options modification start</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OPTSTRTR</name><usage>read</usage><enumeratedValue><name>Done</name><description>Options modification completed or idle</description><value>0</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>OPTSTRTW</name><usage>write</usage><enumeratedValue><name>Start</name><description>Trigger options programming operation</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FSTPG</name>
                     <description>Fast programming</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>FSTPG</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Fast programming disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Fast programming enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EOPIE</name>
                     <description>End of operation interrupt               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOPIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>End of program interrupt disable</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>End of program interrupt enable</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ERRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>OPERR Error interrupt disable</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OPERR Error interrupt enable</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RDERRIE</name>
                     <description>PCROP read error interrupt               enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RDERRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>PCROP read error interrupt disable</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>PCROP read error interrupt enable</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OBL_LAUNCH</name>
                     <description>Force the option byte               loading</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OBL_LAUNCHR</name><usage>read</usage><enumeratedValue><name>Complete</name><description>Option byte loaded</description><value>0</value></enumeratedValue><enumeratedValue><name>NotComplete</name><description>Option byte loading to be done</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>OBL_LAUNCHW</name><usage>write</usage><enumeratedValue><name>Reload</name><description>Reload option byte</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OPTLOCK</name>
                     <description>Options Lock</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OPTLOCKR</name><usage>read</usage><enumeratedValue><name>Unlocked</name><description>FLASH_CR options are unlocked</description><value>0</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>OPTLOCKW</name><usage>write</usage><enumeratedValue><name>Locked</name><description>FLASH_CR options are locked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>FLASH_CR Lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Unlocked</name><description>FLASH_CR is unlocked</description><value>0</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Locked</name><description>FLASH_CR is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>ECCR</name>
               <displayName>ECCR</displayName>
               <description>Flash ECC register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR_ECC</name>
                     <description>ECC fail address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                     <access>read-only</access>
                  <writeConstraint><range><minimum>0</minimum><maximum>131071</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>SYSF_ECC</name>
                     <description>System Flash ECC fail</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>SYSF_ECC</name><usage>read-write</usage><enumeratedValue><name>NotInFlash</name><description>No System Flash memory ECC fail</description><value>0</value></enumeratedValue><enumeratedValue><name>InFlash</name><description>System Flash memory ECC fail</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ECCCIE</name>
                     <description>ECC correction interrupt               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>ECCCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ECCC interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ECCC interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>                
                  <field>
                     <name>ECCC</name>
                     <description>ECC correction</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>ECCCR</name><usage>read</usage><enumeratedValue><name>NoEvent</name><description>ECC error corrected</description><value>0</value></enumeratedValue><enumeratedValue><name>Event</name><description>No ECC error corrected</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ECCCW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ECCD</name>
                     <description>ECC detection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>ECCDR</name><usage>read</usage><enumeratedValue><name>NoEvent</name><description>Two ECC errors detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Event</name><description>No two ECC errors detected</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ECCDW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear the flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>OPTR</name>
               <displayName>OPTR</displayName>
               <description>Flash option register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x3FFFF0AA</resetValue>
               <fields>
                  <field>
                     <name>RDP</name>
                     <description>Read protection level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <enumeratedValues><name>RDP</name><usage>read-write</usage><enumeratedValue><name>Level0</name><description>Level 0, readout protection not active</description><value>170</value></enumeratedValue><enumeratedValue><name>Level2</name><description>Level 2, chip readout protection active</description><value>204</value></enumeratedValue><enumeratedValue><name>Level1</name><description>Level 1, memories readout protection active (writes 0x88)</description><value>136</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ESE</name>
                     <description>System security enabled               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ESE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Security disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Security enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BOR_LEV</name>
                     <description>BOR reset Level</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>BOR_LEV</name><usage>read-write</usage><enumeratedValue><name>Level0</name><description>BOR level 0. Reset level threshold is around 1.7 V</description><value>0</value></enumeratedValue><enumeratedValue><name>Level1</name><description>BOR level 1. Reset level threshold is around 2.0 V</description><value>1</value></enumeratedValue><enumeratedValue><name>Level2</name><description>BOR level 2. Reset level threshold is around 2.2 V</description><value>2</value></enumeratedValue><enumeratedValue><name>Level3</name><description>BOR level 3. Reset level threshold is around 2.5 V</description><value>3</value></enumeratedValue><enumeratedValue><name>Level4</name><description>BOR level 4. Reset level threshold is around 2.8 V</description><value>4</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>nRST_STOP</name>
                     <description>nRST_STOP</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>nRST_STOP</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Reset generated when entering the Standby mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>No reset generated when entering the Standby mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>nRST_STDBY</name>
                     <description>nRST_STDBY</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>nRST_STDBY</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Reset generated when entering the Standby mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>No reset generated when entering the Standby mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>nRST_SHDW</name>
                     <description>nRSTSHDW</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>nRST_SHDW</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Reset generated when entering the Shutdown mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>No reset generated when entering the Shutdown mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>IWDG_SW</name>
                     <description>Independent watchdog               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>IWDG_SW</name><usage>read-write</usage><enumeratedValue><name>Hardware</name><description>Hardware independent watchdog</description><value>0</value></enumeratedValue><enumeratedValue><name>Software</name><description>Software independent watchdog</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>IWDG_STOP</name>
                     <description>Independent watchdog counter freeze in               Stop mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>IWDG_STOP</name><usage>read-write</usage><enumeratedValue><name>Frozen</name><description>Independent watchdog counter frozen in Stop mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Running</name><description>Independent watchdog counter running in Stop mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>IWDG_STDBY</name>
                     <description>Independent watchdog counter freeze in               Standby mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>IWDG_STDBY</name><usage>read-write</usage><enumeratedValue><name>Frozen</name><description>Independent watchdog counter frozen in Standby mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Running</name><description>Independent watchdog counter running in Standby mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WWDG_SW</name>
                     <description>Window watchdog selection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WWDG_SW</name><usage>read-write</usage><enumeratedValue><name>Hardware</name><description>Hardware window watchdog</description><value>0</value></enumeratedValue><enumeratedValue><name>Software</name><description>Software window watchdog</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>nBOOT1</name>
                     <description>Boot configuration</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>nBOOT1</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>When nSWBOOT0 is cleared, select boot mode together with nBOOT0</description><value>0</value></enumeratedValue><enumeratedValue><name>Set</name><description>When nSWBOOT0 is cleared, select boot mode together with nBOOT0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SRAM2_PE</name>
                     <description>SRAM2 parity check enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SRAM2_PE</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>SRAM2 Parity check enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>SRAM2 Parity check disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SRAM_RST</name>
                     <description>SRAM2 Erase when system               reset</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SRAM_RST</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>SRAM1 and SRAM2 erased when a system reset occurs</description><value>0</value></enumeratedValue><enumeratedValue><name>NotReset</name><description>SRAM1 and SRAM2 not erased when a system reset occurs</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>nSWBOOT0</name>
                     <description>Software BOOT0 selection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>nSWBOOT0</name><usage>read-write</usage><enumeratedValue><name>Bit</name><description>BOOT0 taken from nBOOT0 in this register</description><value>0</value></enumeratedValue><enumeratedValue><name>Pin</name><description>BOOT0 taken from GPIO PH3/BOOT0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>nBOOT0</name>
                     <description>nBOOT0 option bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>nBOOT0</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>When nSWBOOT0 is cleared, select boot mode together with nBOOT1</description><value>0</value></enumeratedValue><enumeratedValue><name>Set</name><description>When nSWBOOT0 is cleared, select boot mode together with nBOOT1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BOOT_LOCK</name>
                     <description>CPU1 CM4 Unique Boot entry enable option               bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BOOT_LOCK</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Boot lock is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Boot lock is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>                
               </fields>
            </register>
