tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>PCROP1ASR</name>
               <displayName>PCROP1ASR</displayName>
               <description>Flash PCROP zone A Start address           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PCROP1A_STRT</name>
                     <description>PCROP1A area start offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>PCROP1AER</name>
               <displayName>PCROP1AER</displayName>
               <description>Flash PCROP zone A End address           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <resetValue>0xFFFFFF00</resetValue>
               <fields>
                  <field>
                     <name>PCROP1A_END</name>
                     <description>PCROP area end offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>PCROP_RDP</name>
                     <description>PCROP area preserved when RDP level               decreased</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>WRP1AR</name>
               <displayName>WRP1AR</displayName>
               <description>Flash WRP area A address           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFF80FFFF</resetValue>
               <fields>
                  <field>
                     <name>WRP1A_STRT</name>
                     <description>Bank 1 WRP first area start               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>WRP1A_END</name>
                     <description>Bank 1 WRP first area A end               offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>WRP1BR</name>
               <displayName>WRP1BR</displayName>
               <description>Flash WRP area B address           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFF80FFFF</resetValue>
               <fields>
                  <field>
                     <name>WRP1B_STRT</name>
                     <description>Bank 1 WRP second area B end               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>WRP1B_END</name>
                     <description>Bank 1 WRP second area B start               offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>PCROP1BSR</name>
               <displayName>PCROP1BSR</displayName>
               <description>Flash PCROP zone B Start address           register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PCROP1B_STRT</name>
                     <description>Bank 1 WRP second area B end               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>PCROP1BER</name>
               <displayName>PCROP1BER</displayName>
               <description>Flash PCROP zone B End address           register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFF00</resetValue>
               <fields>
                  <field>
                     <name>PCROP1B_END</name>
                     <description>PCROP1B area end offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>			          
