tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>PUPDR</name>
               <displayName>PUPDR</displayName>
               <description>GPIO port pull-up/pull-down           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x64000000</resetValue>
               <fields>
                  <field>
                     <name>PUPDR15</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR14</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR13</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR12</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR11</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR10</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR9</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR8</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR7</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR6</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR5</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="PUPDR0"/>
            </field>
                  <field>
                     <name>PUPDR0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>PUPDR0</name><usage>read-write</usage><enumeratedValue><name>Floating</name><description>No pull-up, pull-down</description><value>0</value></enumeratedValue><enumeratedValue><name>PullUp</name><description>Pull-up</description><value>1</value></enumeratedValue><enumeratedValue><name>PullDown</name><description>Pull-down</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <displayName>IDR</displayName>
               <description>GPIO port input data register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IDR15</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR14</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR13</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR12</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR11</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR10</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR9</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR8</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR7</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR6</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR5</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR4</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR3</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR2</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR1</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="IDR0"/>
            </field>
                  <field>
                     <name>IDR0</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>IDR0</name><usage>read-write</usage><enumeratedValue><name>High</name><description>Input is logic high</description><value>1</value></enumeratedValue><enumeratedValue><name>Low</name><description>Input is logic low</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>ODR</name>
               <displayName>ODR</displayName>
               <description>GPIO port output data register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ODR15</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR14</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR13</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR12</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR11</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR10</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR9</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR8</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR7</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR6</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR5</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR4</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR3</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR2</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR1</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ODR0"/>
            </field>
                  <field>
                     <name>ODR0</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ODR0</name><usage>read-write</usage><enumeratedValue><name>High</name><description>Set output to logic high</description><value>1</value></enumeratedValue><enumeratedValue><name>Low</name><description>Set output to logic low</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
