tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>BSRR</name>
               <displayName>BSRR</displayName>
               <description>GPIO port bit set/reset           register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BR15</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR14</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR13</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR12</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR11</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR10</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR9</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR8</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR7</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR6</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR5</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR4</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR3</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR2</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR1</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BR0W"/>
            </field>
                  <field>
                     <name>BR0</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BR0W</name><usage>write</usage><enumeratedValue><name>Reset</name><description>Resets the corresponding ODRx bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BS15</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS14</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS13</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS12</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS11</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS10</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS9</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS8</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS7</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS6</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS5</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS4</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS3</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS2</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS1</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="BS0W"/>
            </field>
                  <field>
                     <name>BS0</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BS0W</name><usage>write</usage><enumeratedValue><name>Set</name><description>Sets the corresponding ODRx bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>LCKR</name>
               <displayName>LCKR</displayName>
               <description>GPIO port configuration lock           register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LCKK</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK15</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK14</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK13</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK12</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK11</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK10</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK9</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK8</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK7</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK6</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK5</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK4</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK3</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK2</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK1</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK0</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFRL</name>
               <displayName>AFRL</displayName>
               <description>GPIO alternate function low           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AFRL7</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="AFRL0"/>
            </field>
                  <field>
                     <name>AFRL6</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="AFRL0"/>
            </field>
                  <field>
                     <name>AFRL5</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="AFRL0"/>
            </field>
                  <field>
                     <name>AFRL4</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="AFRL0"/>
            </field>
                  <field>
                     <name>AFRL3</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="AFRL0"/>
            </field>
                  <field>
                     <name>AFRL2</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="AFRL0"/>
            </field>
                  <field>
                     <name>AFRL1</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="AFRL0"/>
            </field>
                  <field>
                     <name>AFRL0</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>AFRL0</name><usage>read-write</usage><enumeratedValue><name>AF0</name><description>AF0</description><value>0</value></enumeratedValue><enumeratedValue><name>AF1</name><description>AF1</description><value>1</value></enumeratedValue><enumeratedValue><name>AF2</name><description>AF2</description><value>2</value></enumeratedValue><enumeratedValue><name>AF3</name><description>AF3</description><value>3</value></enumeratedValue><enumeratedValue><name>AF4</name><description>AF4</description><value>4</value></enumeratedValue><enumeratedValue><name>AF5</name><description>AF5</description><value>5</value></enumeratedValue><enumeratedValue><name>AF6</name><description>AF6</description><value>6</value></enumeratedValue><enumeratedValue><name>AF7</name><description>AF7</description><value>7</value></enumeratedValue><enumeratedValue><name>AF8</name><description>AF8</description><value>8</value></enumeratedValue><enumeratedValue><name>AF9</name><description>AF9</description><value>9</value></enumeratedValue><enumeratedValue><name>AF10</name><description>AF10</description><value>10</value></enumeratedValue><enumeratedValue><name>AF11</name><description>AF11</description><value>11</value></enumeratedValue><enumeratedValue><name>AF12</name><description>AF12</description><value>12</value></enumeratedValue><enumeratedValue><name>AF13</name><description>AF13</description><value>13</value></enumeratedValue><enumeratedValue><name>AF14</name><description>AF14</description><value>14</value></enumeratedValue><enumeratedValue><name>AF15</name><description>AF15</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
