tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HSEM</name>
         <description>Hardware semaphore</description>
         <groupName>HSEM</groupName>
         <baseAddress>0x58001400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HSEM</name>
            <description>Semaphore interrupt 0 to CPU</description>
            <value>47</value>
         </interrupt>
         <registers>
            <register>
               <name>R0</name>
               <displayName>R0</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R1</name>
               <displayName>R1</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R2</name>
               <displayName>R2</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R3</name>
               <displayName>R3</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R4</name>
               <displayName>R4</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R5</name>
               <displayName>R5</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R6</name>
               <displayName>R6</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R7</name>
               <displayName>R7</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R8</name>
               <displayName>R8</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R9</name>
               <displayName>R9</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R10</name>
               <displayName>R10</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
