tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>R11</name>
               <displayName>R11</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R12</name>
               <displayName>R12</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R13</name>
               <displayName>R13</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R14</name>
               <displayName>R14</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>R15</name>
               <displayName>R15</displayName>
               <description>HSEM register HSEM_R0 HSEM_R31</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR0</name>
               <displayName>RLR0</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR1</name>
               <displayName>RLR1</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR2</name>
               <displayName>RLR2</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR3</name>
               <displayName>RLR3</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR4</name>
               <displayName>RLR4</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR5</name>
               <displayName>RLR5</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
