tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>RLR6</name>
               <displayName>RLR6</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR7</name>
               <displayName>RLR7</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0x9C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR8</name>
               <displayName>RLR8</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR9</name>
               <displayName>RLR9</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0xA4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR10</name>
               <displayName>RLR10</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0xA8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR11</name>
               <displayName>RLR11</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0xAC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR12</name>
               <displayName>RLR12</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0xB0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR13</name>
               <displayName>RLR13</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0xB4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR14</name>
               <displayName>RLR14</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0xB8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR15</name>
               <displayName>RLR15</displayName>
               <description>HSEM Read lock register</description>
               <addressOffset>0xBC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROCID</name>
                     <description>Semaphore ProcessID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>COREID</name>
                     <description>Semaphore MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock indication</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LOCKR</name><usage>read</usage><enumeratedValue><name>Free</name><description>Semaphore is free</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>Semaphore is locked</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>LOCKW</name><usage>write</usage><enumeratedValue><name>Free</name><description>Free semaphore</description><value>0</value></enumeratedValue><enumeratedValue><name>TryLock</name><description>Try to lock semaphore</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
