tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>C1IER</name>
               <displayName>IER</displayName>
               <description>HSEM Interrupt enable register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISE0</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ISE0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt generation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generation enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ISE1</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE0"/>
            </field>
                  <field>
                     <name>ISE2</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE0"/>
            </field>
                  <field>
                     <name>ISE3</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE0"/>
            </field>
                  <field>
                     <name>ISE4</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE0"/>
            </field>
                  <field>
                     <name>ISE5</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE0"/>
            </field>
                  <field>
                     <name>ISE6</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE0"/>
            </field>
                  <field>
                     <name>ISE7</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE0"/>
            </field>
                  <field>
                     <name>ISE8</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE0"/>
            </field>
                  <field>
                     <name>ISE9</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE0"/>
            </field>
                  <field>
                     <name>ISE10</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ISE10</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt generation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generation enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ISE11</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE10"/>
            </field>
                  <field>
                     <name>ISE12</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE10"/>
            </field>
                  <field>
                     <name>ISE13</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE10"/>
            </field>
                  <field>
                     <name>ISE14</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE10"/>
            </field>
                  <field>
                     <name>ISE15</name>
                     <description>Interrupt semaphore n enable               bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISE10"/>
            </field>
               </fields>
            </register>       
            <register>
               <name>C1ICR</name>
               <displayName>ICR</displayName>
               <description>HSEM Interrupt clear register</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISC0</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ISC0R</name><usage>read</usage><enumeratedValue><name>NoEffect</name><description>Always reads 0</description><value>0</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ISC0W</name><usage>write</usage><enumeratedValue><name>NoEffect</name><description>Interrupt semaphore x status ISFx and masked status MISFx not affected</description><value>0</value></enumeratedValue><enumeratedValue><name>Clear</name><description>Interrupt semaphore x status ISFx and masked status MISFx cleared</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ISC1</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC0R"/>
            <enumeratedValues derivedFrom="ISC0W"/>
            </field>
                  <field>
                     <name>ISC2</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC0R"/>
            <enumeratedValues derivedFrom="ISC0W"/>
            </field>
                  <field>
                     <name>ISC3</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC0R"/>
            <enumeratedValues derivedFrom="ISC0W"/>
            </field>
                  <field>
                     <name>ISC4</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC0R"/>
            <enumeratedValues derivedFrom="ISC0W"/>
            </field>
                  <field>
                     <name>ISC5</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC0R"/>
            <enumeratedValues derivedFrom="ISC0W"/>
            </field>
                  <field>
                     <name>ISC6</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC0R"/>
            <enumeratedValues derivedFrom="ISC0W"/>
            </field>
                  <field>
                     <name>ISC7</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC0R"/>
            <enumeratedValues derivedFrom="ISC0W"/>
            </field>
                  <field>
                     <name>ISC8</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC0R"/>
            <enumeratedValues derivedFrom="ISC0W"/>
            </field>
                  <field>
                     <name>ISC9</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC0R"/>
            <enumeratedValues derivedFrom="ISC0W"/>
            </field>
                  <field>
                     <name>ISC10</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ISC10R</name><usage>read</usage><enumeratedValue><name>NoEffect</name><description>Always reads 0</description><value>0</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ISC10W</name><usage>write</usage><enumeratedValue><name>NoEffect</name><description>Interrupt semaphore x status ISFx and masked status MISFx not affected</description><value>0</value></enumeratedValue><enumeratedValue><name>Clear</name><description>Interrupt semaphore x status ISFx and masked status MISFx cleared</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ISC11</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC10R"/>
            <enumeratedValues derivedFrom="ISC10W"/>
            </field>
                  <field>
                     <name>ISC12</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC10R"/>
            <enumeratedValues derivedFrom="ISC10W"/>
            </field>
                  <field>
                     <name>ISC13</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC10R"/>
            <enumeratedValues derivedFrom="ISC10W"/>
            </field>
                  <field>
                     <name>ISC14</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC10R"/>
            <enumeratedValues derivedFrom="ISC10W"/>
            </field>
                  <field>
                     <name>ISC15</name>
                     <description>Interrupt(N) semaphore n clear               bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISC10R"/>
            <enumeratedValues derivedFrom="ISC10W"/>
            </field>
               </fields>
            </register>			          		   
            <register>
               <name>C1ISR</name>
               <displayName>ISR</displayName>
               <description>HSEM Interrupt status register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISF0</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ISF0</name><usage>read-write</usage><enumeratedValue><name>NotPending</name><description>No interrupt pending</description><value>0</value></enumeratedValue><enumeratedValue><name>Pending</name><description>Interrupt pending</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ISF1</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF0"/>
            </field>
                  <field>
                     <name>ISF2</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF0"/>
            </field>
                  <field>
                     <name>ISF3</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF0"/>
            </field>
                  <field>
                     <name>ISF4</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF0"/>
            </field>
                  <field>
                     <name>ISF5</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF0"/>
            </field>
                  <field>
                     <name>ISF6</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF0"/>
            </field>
                  <field>
                     <name>ISF7</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF0"/>
            </field>
                  <field>
                     <name>ISF8</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF0"/>
            </field>
                  <field>
                     <name>ISF9</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF0"/>
            </field>
                  <field>
                     <name>ISF10</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ISF10</name><usage>read-write</usage><enumeratedValue><name>NotPending</name><description>No interrupt pending</description><value>0</value></enumeratedValue><enumeratedValue><name>Pending</name><description>Interrupt pending</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ISF11</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF10"/>
            </field>
                  <field>
                     <name>ISF12</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF10"/>
            </field>
                  <field>
                     <name>ISF13</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF10"/>
            </field>
                  <field>
                     <name>ISF14</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF10"/>
            </field>
                  <field>
                     <name>ISF15</name>
                     <description>Interrupt(N) semaphore n status bit               before enable (mask)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ISF10"/>
            </field>
               </fields>
            </register>		         
