tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>C1MISR</name>
               <displayName>MISR</displayName>
               <description>HSEM Masked interrupt status           register</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MISF0</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MISF0</name><usage>read-write</usage><enumeratedValue><name>NotPending</name><description>No interrupt pending after masking</description><value>0</value></enumeratedValue><enumeratedValue><name>Pending</name><description>Interrupt pending after masking</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MISF1</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF0"/>
            </field>
                  <field>
                     <name>MISF2</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF0"/>
            </field>
                  <field>
                     <name>MISF3</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF0"/>
            </field>
                  <field>
                     <name>MISF4</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF0"/>
            </field>
                  <field>
                     <name>MISF5</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF0"/>
            </field>
                  <field>
                     <name>MISF6</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF0"/>
            </field>
                  <field>
                     <name>MISF7</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF0"/>
            </field>
                  <field>
                     <name>MISF8</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF0"/>
            </field>
                  <field>
                     <name>MISF9</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF0"/>
            </field>
                  <field>
                     <name>MISF10</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MISF10</name><usage>read-write</usage><enumeratedValue><name>NotPending</name><description>No interrupt pending after masking</description><value>0</value></enumeratedValue><enumeratedValue><name>Pending</name><description>Interrupt pending after masking</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MISF11</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF10"/>
            </field>
                  <field>
                     <name>MISF12</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF10"/>
            </field>
                  <field>
                     <name>MISF13</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF10"/>
            </field>
                  <field>
                     <name>MISF14</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF10"/>
            </field>
                  <field>
                     <name>MISF15</name>
                     <description>masked interrupt(N) semaphore n status               bit after enable (mask)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="MISF10"/>
            </field>
               </fields>
            </register>		        
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>HSEM Clear register</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COREID</name>
                     <description>MASTERID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>KEY</name>
                     <description>Semaphore clear Key</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>KEYR</name>
               <displayName>KEYR</displayName>
               <description>HSEM Interrupt clear register</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Semaphore Clear Key</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>						               
