tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>I2C1</name>
         <description>Inter-integrated circuit</description>
         <groupName>I2C</groupName>
         <baseAddress>0x40005400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>I2C1_EV</name>
            <description>I2C1 event interrupt</description>
            <value>30</value>
         </interrupt>
         <interrupt>
            <name>I2C1_ER</name>
            <description>I2C1 event interrupt</description>
            <value>31</value>
         </interrupt>
         <registers>
            <register>
               <name>CR1</name>
               <displayName>CR1</displayName>
               <description>Control register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PE</name>
                     <description>Peripheral enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Peripheral disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Peripheral enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TXIE</name>
                     <description>TX Interrupt enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TXIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Transmit (TXIS) interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Transmit (TXIS) interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RXIE</name>
                     <description>RX Interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RXIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Receive (RXNE) interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Receive (RXNE) interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ADDRIE</name>
                     <description>Address match interrupt enable (slave               only)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADDRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Address match (ADDR) interrupts disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Address match (ADDR) interrupts enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>NACKIE</name>
                     <description>Not acknowledge received interrupt               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>NACKIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Not acknowledge (NACKF) received interrupts disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Not acknowledge (NACKF) received interrupts enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>STOPIE</name>
                     <description>STOP detection Interrupt               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>STOPIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Stop detection (STOPF) interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Stop detection (STOPF) interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TCIE</name>
                     <description>Transfer Complete interrupt               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Transfer Complete interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Transfer Complete interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Error interrupts enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ERRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Error detection interrupts disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Error detection interrupts enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DNF</name>
                     <description>Digital noise filter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>DNF</name><usage>read-write</usage><enumeratedValue><name>NoFilter</name><description>Digital filter disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Filter1</name><description>Digital filter enabled and filtering capability up to 1 tI2CCLK</description><value>1</value></enumeratedValue><enumeratedValue><name>Filter2</name><description>Digital filter enabled and filtering capability up to 2 tI2CCLK</description><value>2</value></enumeratedValue><enumeratedValue><name>Filter3</name><description>Digital filter enabled and filtering capability up to 3 tI2CCLK</description><value>3</value></enumeratedValue><enumeratedValue><name>Filter4</name><description>Digital filter enabled and filtering capability up to 4 tI2CCLK</description><value>4</value></enumeratedValue><enumeratedValue><name>Filter5</name><description>Digital filter enabled and filtering capability up to 5 tI2CCLK</description><value>5</value></enumeratedValue><enumeratedValue><name>Filter6</name><description>Digital filter enabled and filtering capability up to 6 tI2CCLK</description><value>6</value></enumeratedValue><enumeratedValue><name>Filter7</name><description>Digital filter enabled and filtering capability up to 7 tI2CCLK</description><value>7</value></enumeratedValue><enumeratedValue><name>Filter8</name><description>Digital filter enabled and filtering capability up to 8 tI2CCLK</description><value>8</value></enumeratedValue><enumeratedValue><name>Filter9</name><description>Digital filter enabled and filtering capability up to 9 tI2CCLK</description><value>9</value></enumeratedValue><enumeratedValue><name>Filter10</name><description>Digital filter enabled and filtering capability up to 10 tI2CCLK</description><value>10</value></enumeratedValue><enumeratedValue><name>Filter11</name><description>Digital filter enabled and filtering capability up to 11 tI2CCLK</description><value>11</value></enumeratedValue><enumeratedValue><name>Filter12</name><description>Digital filter enabled and filtering capability up to 12 tI2CCLK</description><value>12</value></enumeratedValue><enumeratedValue><name>Filter13</name><description>Digital filter enabled and filtering capability up to 13 tI2CCLK</description><value>13</value></enumeratedValue><enumeratedValue><name>Filter14</name><description>Digital filter enabled and filtering capability up to 14 tI2CCLK</description><value>14</value></enumeratedValue><enumeratedValue><name>Filter15</name><description>Digital filter enabled and filtering capability up to 15 tI2CCLK</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ANFOFF</name>
                     <description>Analog noise filter OFF</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ANFOFF</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Analog noise filter enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Analog noise filter disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TXDMAEN</name>
                     <description>DMA transmission requests               enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TXDMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA mode disabled for transmission</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA mode enabled for transmission</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RXDMAEN</name>
                     <description>DMA reception requests               enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RXDMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA mode disabled for reception</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA mode enabled for reception</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SBC</name>
                     <description>Slave byte control</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SBC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Slave byte control disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Slave byte control enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>NOSTRETCH</name>
                     <description>Clock stretching disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>NOSTRETCH</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Clock stretching enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Clock stretching disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WUPEN</name>
                     <description>Wakeup from STOP enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WUPEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wakeup from Stop mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wakeup from Stop mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>GCEN</name>
                     <description>General call enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>General call disabled. Address 0b00000000 is NACKed</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>General call enabled. Address 0b00000000 is ACKed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SMBHEN</name>
                     <description>SMBus Host address enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SMBHEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Host address disabled. Address 0b0001000x is NACKed</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Host address enabled. Address 0b0001000x is ACKed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SMBDEN</name>
                     <description>SMBus Device Default address               enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SMBDEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Device default address disabled. Address 0b1100001x is NACKed</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Device default address enabled. Address 0b1100001x is ACKed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ALERTEN</name>
                     <description>SMBUS alert enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ALERTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>In device mode (SMBHEN=Disabled) Releases SMBA pin high and Alert Response Address Header disabled (0001100x) followed by NACK. In host mode (SMBHEN=Enabled) SMBus Alert pin (SMBA) not supported</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>In device mode (SMBHEN=Disabled) Drives SMBA pin low and Alert Response Address Header enabled (0001100x) followed by ACK.In host mode (SMBHEN=Enabled) SMBus Alert pin (SMBA) supported</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PECEN</name>
                     <description>PEC enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PECEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>PEC calculation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>PEC calculation enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CR2</name>
               <displayName>CR2</displayName>
               <description>Control register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PECBYTE</name>
                     <description>Packet error checking byte</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PECBYTE</name><usage>read-write</usage><enumeratedValue><name>NoPec</name><description>No PEC transfer</description><value>0</value></enumeratedValue><enumeratedValue><name>Pec</name><description>PEC transmission/reception is requested</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AUTOEND</name>
                     <description>Automatic end mode (master               mode)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>AUTOEND</name><usage>read-write</usage><enumeratedValue><name>Software</name><description>Software end mode: TC flag is set when NBYTES data are transferred, stretching SCL low</description><value>0</value></enumeratedValue><enumeratedValue><name>Automatic</name><description>Automatic end mode: a STOP condition is automatically sent when NBYTES data are transferred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RELOAD</name>
                     <description>NBYTES reload mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RELOAD</name><usage>read-write</usage><enumeratedValue><name>Completed</name><description>The transfer is completed after the NBYTES data transfer (STOP or RESTART will follow)</description><value>0</value></enumeratedValue><enumeratedValue><name>NotCompleted</name><description>The transfer is not completed after the NBYTES data transfer (NBYTES will be reloaded)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>NBYTES</name>
                     <description>Number of bytes</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>NACK</name>
                     <description>NACK generation (slave               mode)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>NACK</name><usage>read-write</usage><enumeratedValue><name>Ack</name><description>an ACK is sent after current received byte</description><value>0</value></enumeratedValue><enumeratedValue><name>Nack</name><description>a NACK is sent after current received byte</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>STOP</name>
                     <description>Stop generation (master               mode)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>STOP</name><usage>read-write</usage><enumeratedValue><name>NoStop</name><description>No Stop generation</description><value>0</value></enumeratedValue><enumeratedValue><name>Stop</name><description>Stop generation after current byte transfer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>START</name>
                     <description>Start generation</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>START</name><usage>read-write</usage><enumeratedValue><name>NoStart</name><description>No Start generation</description><value>0</value></enumeratedValue><enumeratedValue><name>Start</name><description>Restart/Start generation</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HEAD10R</name>
                     <description>10-bit address header only read               direction (master receiver mode)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HEAD10R</name><usage>read-write</usage><enumeratedValue><name>Complete</name><description>The master sends the complete 10 bit slave address read sequence</description><value>0</value></enumeratedValue><enumeratedValue><name>Partial</name><description>The master only sends the 1st 7 bits of the 10 bit address, followed by Read direction</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ADD10</name>
                     <description>10-bit addressing mode (master               mode)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADD10</name><usage>read-write</usage><enumeratedValue><name>Bit7</name><description>The master operates in 7-bit addressing mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit10</name><description>The master operates in 10-bit addressing mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RD_WRN</name>
                     <description>Transfer direction (master               mode)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RD_WRN</name><usage>read-write</usage><enumeratedValue><name>Write</name><description>Master requests a write transfer</description><value>0</value></enumeratedValue><enumeratedValue><name>Read</name><description>Master requests a read transfer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SADD</name>
                     <description>Slave address bit (master               mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>1023</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
