tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>OAR1</name>
               <displayName>OAR1</displayName>
               <description>Own address register 1</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OA1</name>
                     <description>Interface address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>1023</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>OA1MODE</name>
                     <description>Own Address 1 10-bit mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OA1MODE</name><usage>read-write</usage><enumeratedValue><name>Bit7</name><description>Own address 1 is a 7-bit address</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit10</name><description>Own address 1 is a 10-bit address</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OA1EN</name>
                     <description>Own Address 1 enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OA1EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Own address 1 disabled. The received slave address OA1 is NACKed</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Own address 1 enabled. The received slave address OA1 is ACKed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>OAR2</name>
               <displayName>OAR2</displayName>
               <description>Own address register 2</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OA2</name>
                     <description>Interface address</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>7</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>OA2MSK</name>
                     <description>Own Address 2 masks</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>OA2MSK</name><usage>read-write</usage><enumeratedValue><name>NoMask</name><description>No mask</description><value>0</value></enumeratedValue><enumeratedValue><name>Mask1</name><description>OA2[1] is masked and don&#8217;t care. Only OA2[7:2] are compared</description><value>1</value></enumeratedValue><enumeratedValue><name>Mask2</name><description>OA2[2:1] are masked and don&#8217;t care. Only OA2[7:3] are compared</description><value>2</value></enumeratedValue><enumeratedValue><name>Mask3</name><description>OA2[3:1] are masked and don&#8217;t care. Only OA2[7:4] are compared</description><value>3</value></enumeratedValue><enumeratedValue><name>Mask4</name><description>OA2[4:1] are masked and don&#8217;t care. Only OA2[7:5] are compared</description><value>4</value></enumeratedValue><enumeratedValue><name>Mask5</name><description>OA2[5:1] are masked and don&#8217;t care. Only OA2[7:6] are compared</description><value>5</value></enumeratedValue><enumeratedValue><name>Mask6</name><description>OA2[6:1] are masked and don&#8217;t care. Only OA2[7] is compared.</description><value>6</value></enumeratedValue><enumeratedValue><name>Mask7</name><description>OA2[7:1] are masked and don&#8217;t care. No comparison is done, and all (except reserved) 7-bit received addresses are acknowledged</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OA2EN</name>
                     <description>Own Address 2 enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OA2EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Own address 2 disabled. The received slave address OA2 is NACKed</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Own address 2 enabled. The received slave address OA2 is ACKed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>TIMINGR</name>
               <displayName>TIMINGR</displayName>
               <description>Timing register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCLL</name>
                     <description>SCL low period (master               mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>SCLH</name>
                     <description>SCL high period (master               mode)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>SDADEL</name>
                     <description>Data hold time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>SCLDEL</name>
                     <description>Data setup time</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>PRESC</name>
                     <description>Timing prescaler</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>TIMEOUTR</name>
               <displayName>TIMEOUTR</displayName>
               <description>Status register 1</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMEOUTA</name>
                     <description>Bus timeout A</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>TIDLE</name>
                     <description>Idle clock timeout               detection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TIDLE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>TIMEOUTA is used to detect SCL low timeout</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>TIMEOUTA is used to detect both SCL and SDA high timeout (bus idle condition)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TIMOUTEN</name>
                     <description>Clock timeout enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TIMOUTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SCL timeout detection is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SCL timeout detection is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TIMEOUTB</name>
                     <description>Bus timeout B</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>TEXTEN</name>
                     <description>Extended clock timeout               enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TEXTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Extended clock timeout detection is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Extended clock timeout detection is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>Interrupt and Status register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>ADDCODE</name>
                     <description>Address match code (Slave               mode)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-only</access>
                  <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>DIR</name>
                     <description>Transfer direction (Slave               mode)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>DIR</name><usage>read-write</usage><enumeratedValue><name>Write</name><description>Write transfer, slave enters receiver mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Read</name><description>Read transfer, slave enters transmitter mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BUSY</name>
                     <description>Bus busy</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>BUSY</name><usage>read-write</usage><enumeratedValue><name>NotBusy</name><description>No communication is in progress on the bus</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>A communication is in progress on the bus</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ALERT</name>
                     <description>SMBus alert</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>ALERT</name><usage>read-write</usage><enumeratedValue><name>NoAlert</name><description>SMBA alert is not detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Alert</name><description>SMBA alert event is detected on SMBA pin</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Timeout or t_low detection               flag</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>TIMEOUT</name><usage>read-write</usage><enumeratedValue><name>NoTimeout</name><description>No timeout occured</description><value>0</value></enumeratedValue><enumeratedValue><name>Timeout</name><description>Timeout occured</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PECERR</name>
                     <description>PEC Error in reception</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>PECERR</name><usage>read-write</usage><enumeratedValue><name>Match</name><description>Received PEC does match with PEC register</description><value>0</value></enumeratedValue><enumeratedValue><name>NoMatch</name><description>Received PEC does not match with PEC register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OVR</name>
                     <description>Overrun/Underrun (slave               mode)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>OVR</name><usage>read-write</usage><enumeratedValue><name>NoOverrun</name><description>No overrun/underrun error occurs</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>slave mode with NOSTRETCH=1, when an overrun/underrun error occurs</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ARLO</name>
                     <description>Arbitration lost</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>ARLO</name><usage>read-write</usage><enumeratedValue><name>NotLost</name><description>No arbitration lost</description><value>0</value></enumeratedValue><enumeratedValue><name>Lost</name><description>Arbitration lost</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BERR</name>
                     <description>Bus error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>BERR</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>No bus error</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Misplaced Start and Stop condition is detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TCR</name>
                     <description>Transfer Complete Reload</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>TCR</name><usage>read-write</usage><enumeratedValue><name>NotComplete</name><description>Transfer is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>NBYTES has been transfered</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TC</name>
                     <description>Transfer Complete (master               mode)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>TC</name><usage>read-write</usage><enumeratedValue><name>NotComplete</name><description>Transfer is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>NBYTES has been transfered</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>STOPF</name>
                     <description>Stop detection flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>STOPF</name><usage>read-write</usage><enumeratedValue><name>NoStop</name><description>No Stop condition detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Stop</name><description>Stop condition detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>NACKF</name>
                     <description>Not acknowledge received               flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>NACKF</name><usage>read-write</usage><enumeratedValue><name>NoNack</name><description>No NACK has been received</description><value>0</value></enumeratedValue><enumeratedValue><name>Nack</name><description>NACK has been received</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ADDR</name>
                     <description>Address matched (slave               mode)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>ADDR</name><usage>read-write</usage><enumeratedValue><name>NotMatch</name><description>Adress mismatched or not received</description><value>0</value></enumeratedValue><enumeratedValue><name>Match</name><description>Received slave address matched with one of the enabled slave addresses</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RXNE</name>
                     <description>Receive data register not empty               (receivers)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>RXNE</name><usage>read-write</usage><enumeratedValue><name>Empty</name><description>The RXDR register is empty</description><value>0</value></enumeratedValue><enumeratedValue><name>NotEmpty</name><description>Received data is copied into the RXDR register, and is ready to be read</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TXIS</name>
                     <description>Transmit interrupt status               (transmitters)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>TXIS</name><usage>read-write</usage><enumeratedValue><name>NotEmpty</name><description>The TXDR register is not empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Empty</name><description>The TXDR register is empty and the data to be transmitted must be written in the TXDR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TXE</name>
                     <description>Transmit data register empty               (transmitters)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>TXE</name><usage>read-write</usage><enumeratedValue><name>NotEmpty</name><description>TXDR register not empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Empty</name><description>TXDR register empty</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
