tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>ICR</name>
               <displayName>ICR</displayName>
               <description>Interrupt clear register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ALERTCF</name>
                     <description>Alert flag clear</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ALERTCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the ALERT flag in ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TIMOUTCF</name>
                     <description>Timeout detection flag               clear</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TIMOUTCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the TIMOUT flag in ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PECCF</name>
                     <description>PEC Error flag clear</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PECCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the PEC flag in ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OVRCF</name>
                     <description>Overrun/Underrun flag               clear</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OVRCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the OVR flag in ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ARLOCF</name>
                     <description>Arbitration lost flag               clear</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ARLOCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the ARLO flag in ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BERRCF</name>
                     <description>Bus error flag clear</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BERRCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the BERR flag in ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>STOPCF</name>
                     <description>Stop detection flag clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>STOPCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the STOP flag in ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>NACKCF</name>
                     <description>Not Acknowledge flag clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>NACKCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the NACK flag in ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ADDRCF</name>
                     <description>Address Matched flag clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADDRCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the ADDR flag in ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>PECR</name>
               <displayName>PECR</displayName>
               <description>PEC register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PEC</name>
                     <description>Packet error checking               register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>RXDR</name>
               <displayName>RXDR</displayName>
               <description>Receive data register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>8-bit receive data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>TXDR</name>
               <displayName>TXDR</displayName>
               <description>Transmit data register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>8-bit transmit data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
