tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="I2C1">
         <name>I2C2</name>
         <baseAddress>0x40005800</baseAddress>
         <interrupt>
            <name>I2C2_EV</name>
            <description>I2C2 event interrupt</description>
            <value>32</value>
         </interrupt>
         <interrupt>
            <name>I2C2_ER</name>
            <description>I2C2 error interrupt</description>
            <value>33</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="I2C1">
         <name>I2C3</name>
         <baseAddress>0x40005C00</baseAddress>
         <interrupt>
            <name>I2C3_EV</name>
            <description>I2C3 event interrupt</description>
            <value>48</value>
         </interrupt>
         <interrupt>
            <name>I2C3_ER</name>
            <description>I2C3 error interrupt</description>
            <value>49</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>IWDG</name>
         <description>Independent watchdog</description>
         <groupName>IWDG</groupName>
         <baseAddress>0x40003000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>KR</name>
               <displayName>KR</displayName>
               <description>Key register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Key value (write only, read               0x0000)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <enumeratedValues><name>KEY</name><usage>read-write</usage><enumeratedValue><name>Enable</name><description>Enable access to PR, RLR and WINR registers (0x5555)</description><value>21845</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset the watchdog value (0xAAAA)</description><value>43690</value></enumeratedValue><enumeratedValue><name>Start</name><description>Start the watchdog (0xCCCC)</description><value>52428</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>PR</name>
               <displayName>PR</displayName>
               <description>Prescaler register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000007</resetValue>
               <fields>
                  <field>
                     <name>PR</name>
                     <description>Prescaler divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>PR</name><usage>read-write</usage><enumeratedValue><name>DivideBy4</name><description>Divider /4</description><value>0</value></enumeratedValue><enumeratedValue><name>DivideBy8</name><description>Divider /8</description><value>1</value></enumeratedValue><enumeratedValue><name>DivideBy16</name><description>Divider /16</description><value>2</value></enumeratedValue><enumeratedValue><name>DivideBy32</name><description>Divider /32</description><value>3</value></enumeratedValue><enumeratedValue><name>DivideBy64</name><description>Divider /64</description><value>4</value></enumeratedValue><enumeratedValue><name>DivideBy128</name><description>Divider /128</description><value>5</value></enumeratedValue><enumeratedValue><name>DivideBy256</name><description>Divider /256</description><value>6</value></enumeratedValue><enumeratedValue><name>DivideBy256bis</name><description>Divider /256</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RLR</name>
               <displayName>RLR</displayName>
               <description>Reload register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000FFF</resetValue>
               <fields>
                  <field>
                     <name>RL</name>
                     <description>Watchdog counter reload               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>Status register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WVU</name>
                     <description>Watchdog counter window value               update</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WVU</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>No update on-going</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>Update on-going</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RVU</name>
                     <description>Watchdog counter reload value               update</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RVU</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>No update on-going</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>Update on-going</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PVU</name>
                     <description>Watchdog prescaler value               update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PVU</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>No update on-going</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>Update on-going</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
