tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CFGR</name>
               <displayName>CFGR</displayName>
               <description>configuration register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENC</name>
                     <description>ENC</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ENC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Encoder mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Encoder mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>COUNTMODE</name>
                     <description>COUNTMODE</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>COUNTMODE</name><usage>read-write</usage><enumeratedValue><name>Internal</name><description>The counter is incremented following each internal clock pulse</description><value>0</value></enumeratedValue><enumeratedValue><name>External</name><description>The counter is incremented following each valid clock pulse on the LPTIM external Input1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PRELOAD</name>
                     <description>PRELOAD</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PRELOAD</name><usage>read-write</usage><enumeratedValue><name>Immediate</name><description>Registers are updated after each APB bus write access</description><value>0</value></enumeratedValue><enumeratedValue><name>EndOfPeriod</name><description>Registers are updated at the end of the current LPTIM period</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WAVPOL</name>
                     <description>WAVPOL</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WAVPOL</name><usage>read-write</usage><enumeratedValue><name>Positive</name><description>The LPTIM output reflects the compare results between LPTIM_ARR and LPTIM_CMP registers</description><value>0</value></enumeratedValue><enumeratedValue><name>Negative</name><description>The LPTIM output reflects the inverse of the compare results between LPTIM_ARR and LPTIM_CMP registers</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WAVE</name>
                     <description>WAVE</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WAVE</name><usage>read-write</usage><enumeratedValue><name>Inactive</name><description>Deactivate Set-once mode, PWM / One Pulse waveform (depending on OPMODE bit)</description><value>0</value></enumeratedValue><enumeratedValue><name>Active</name><description>Activate the Set-once mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TIMOUT</name>
                     <description>TIMOUT</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TIMOUT</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>A trigger event arriving when the timer is already started will be ignored</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>A trigger event arriving when the timer is already started will reset and restart the counter</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TRIGEN</name>
                     <description>TRIGEN</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>TRIGEN</name><usage>read-write</usage><enumeratedValue><name>SW</name><description>Software trigger (counting start is initiated by software)</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Rising edge is the active edge</description><value>1</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Falling edge is the active edge</description><value>2</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Both edges are active edges</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TRIGSEL</name>
                     <description>TRIGSEL</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>TRIGSEL</name><usage>read-write</usage><enumeratedValue><name>Trig0</name><description>lptim_ext_trig0</description><value>0</value></enumeratedValue><enumeratedValue><name>Trig1</name><description>lptim_ext_trig1</description><value>1</value></enumeratedValue><enumeratedValue><name>Trig2</name><description>lptim_ext_trig2</description><value>2</value></enumeratedValue><enumeratedValue><name>Trig3</name><description>lptim_ext_trig3</description><value>3</value></enumeratedValue><enumeratedValue><name>Trig4</name><description>lptim_ext_trig4</description><value>4</value></enumeratedValue><enumeratedValue><name>Trig5</name><description>lptim_ext_trig5</description><value>5</value></enumeratedValue><enumeratedValue><name>Trig6</name><description>lptim_ext_trig6</description><value>6</value></enumeratedValue><enumeratedValue><name>Trig7</name><description>lptim_ext_trig7</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PRESC</name>
                     <description>PRESC</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>PRESC</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>/1</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>/2</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>/4</description><value>2</value></enumeratedValue><enumeratedValue><name>Div8</name><description>/8</description><value>3</value></enumeratedValue><enumeratedValue><name>Div16</name><description>/16</description><value>4</value></enumeratedValue><enumeratedValue><name>Div32</name><description>/32</description><value>5</value></enumeratedValue><enumeratedValue><name>Div64</name><description>/64</description><value>6</value></enumeratedValue><enumeratedValue><name>Div128</name><description>/128</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TRGFLT</name>
                     <description>TRGFLT</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>TRGFLT</name><usage>read-write</usage><enumeratedValue><name>Immediate</name><description>Any trigger active level change is considered as a valid trigger</description><value>0</value></enumeratedValue><enumeratedValue><name>Clocks2</name><description>Trigger active level change must be stable for at least 2 clock periods before it is considered as valid trigger</description><value>1</value></enumeratedValue><enumeratedValue><name>Clocks4</name><description>Trigger active level change must be stable for at least 4 clock periods before it is considered as valid trigger</description><value>2</value></enumeratedValue><enumeratedValue><name>Clocks8</name><description>Trigger active level change must be stable for at least 8 clock periods before it is considered as valid trigger</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CKFLT</name>
                     <description>CKFLT</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CKFLT</name><usage>read-write</usage><enumeratedValue><name>Immediate</name><description>Any external clock signal level change is considered as a valid transition</description><value>0</value></enumeratedValue><enumeratedValue><name>Clocks2</name><description>External clock signal level change must be stable for at least 2 clock periods before it is considered as valid transition</description><value>1</value></enumeratedValue><enumeratedValue><name>Clocks4</name><description>External clock signal level change must be stable for at least 4 clock periods before it is considered as valid transition</description><value>2</value></enumeratedValue><enumeratedValue><name>Clocks8</name><description>External clock signal level change must be stable for at least 8 clock periods before it is considered as valid transition</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CKPOL</name>
                     <description>CKPOL</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CKPOL</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>The rising edge is the active edge used for counting. If LPTIM is in encoder mode: Encoder sub-mode 1 is active.</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>The falling edge is the active edge used for counting. If LPTIM is in encoder mode: Encoder sub-mode 2 is active.</description><value>1</value></enumeratedValue><enumeratedValue><name>BothEdges</name><description>Both edges are active edge. If LPTIM is in encoder mode: Encoder sub-mode 3 is active.</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CKSEL</name>
                     <description>CKSEL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CKSEL</name><usage>read-write</usage><enumeratedValue><name>Internal</name><description>LPTIM is clocked by internal clock source (APB clock or any of the embedded oscillators)</description><value>0</value></enumeratedValue><enumeratedValue><name>External</name><description>LPTIM is clocked by an external clock source through the LPTIM external Input1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>control register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RSTARE</name>
                     <description>RSTARE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RSTARE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CNT Register reads do not trigger reset</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CNT Register reads trigger reset of LPTIM</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>COUNTRST</name>
                     <description>COUNTRST</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>COUNTRSTR</name><usage>read</usage><enumeratedValue><name>Idle</name><description>Triggering of reset is possible</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>Reset in progress, do not write 1 to this field</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>COUNTRSTW</name><usage>write</usage><enumeratedValue><name>Reset</name><description>Trigger synchronous reset of CNT (3 LPTimer core clock cycles)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CNTSTRT</name>
                     <description>CNTSTRT</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CNTSTRTW</name><usage>write</usage><enumeratedValue><name>Start</name><description>Timer start in Continuous mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SNGSTRT</name>
                     <description>SNGSTRT</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SNGSTRTW</name><usage>write</usage><enumeratedValue><name>Start</name><description>LPTIM start in Single mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ENABLE</name>
                     <description>ENABLE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ENABLE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>LPTIM is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>LPTIM is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CMP</name>
               <displayName>CMP</displayName>
               <description>compare register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMP</name>
                     <description>CMP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>ARR</name>
               <displayName>ARR</displayName>
               <description>autoreload register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>ARR</name>
                     <description>Auto reload value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <displayName>CNT</displayName>
               <description>counter register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OR</name>
               <displayName>OR</displayName>
               <description>option register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OR_1</name>
                     <description>Option register bit 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OR_1</name><usage>read-write</usage><enumeratedValue><name>IO</name><description>LPTIM1 input 2 is connected to I/O</description><value>0</value></enumeratedValue><enumeratedValue><name>COMP2_OUT</name><description>LPTIM1 input 2 is connected to COMP2_OUT</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OR_0</name>
                     <description>Option register bit 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OR_0</name><usage>read-write</usage><enumeratedValue><name>IO</name><description>LPTIM1 input 1 is connected to I/O</description><value>0</value></enumeratedValue><enumeratedValue><name>COMP1_OUT</name><description>LPTIM1 input 1 is connected to COMP1_OUT</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RCR</name>
               <displayName>RCR</displayName>
               <description>repetition register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REP</name>
                     <description>Repetition register value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
