tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>LPTIM2</name>
         <description>Low-power timer</description>
         <groupName>LPTIM</groupName>
         <baseAddress>0x40009400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>LPTIM2</name>
            <description>LPtimer 2 global interrupt</description>
            <value>40</value>
         </interrupt>
         <registers>
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>interrupt and status register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REPOK</name>
                     <description>Repetition register update               Ok</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>REPOKR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Repetition register update OK</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UE</name>
                     <description>LPTIM update event               occurred</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UER</name><usage>read</usage><enumeratedValue><name>Set</name><description>LPTIM update event occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DOWN</name>
                     <description>Counter direction change up to               down</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DOWNR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Counter direction change up to down</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UP</name>
                     <description>Counter direction change down to               up</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UPR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Counter direction change down to up</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ARROK</name>
                     <description>Autoreload register update               OK</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ARROKR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Autoreload register update OK</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CMPOK</name>
                     <description>Compare register update OK</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CMPOKR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Compare register update OK</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTTRIG</name>
                     <description>External trigger edge               event</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EXTTRIGR</name><usage>read</usage><enumeratedValue><name>Set</name><description>External trigger edge event</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ARRM</name>
                     <description>Autoreload match</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ARRMR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Autoreload match</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CMPM</name>
                     <description>Compare match</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CMPMR</name><usage>read</usage><enumeratedValue><name>Set</name><description>Compare match</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <displayName>ICR</displayName>
               <description>interrupt clear register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REPOKCF</name>
                     <description>Repetition register update OK clear               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>REPOKCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear REPOK flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UECF</name>
                     <description>Update event clear flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UECFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear update event flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DOWNCF</name>
                     <description>Direction change to down Clear               Flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DOWNCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Direction change to down Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UPCF</name>
                     <description>Direction change to UP Clear               Flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UPCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Direction change to up Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ARROKCF</name>
                     <description>Autoreload register update OK Clear               Flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ARROKCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Autoreload register update OK Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CMPOKCF</name>
                     <description>Compare register update OK Clear               Flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CMPOKCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Compare register update OK Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTTRIGCF</name>
                     <description>External trigger valid edge Clear               Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EXTTRIGCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>External trigger valid edge Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ARRMCF</name>
                     <description>Autoreload match Clear               Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ARRMCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Autoreload match Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CMPMCF</name>
                     <description>compare match Clear Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CMPMCFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Compare match Clear Flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <displayName>IER</displayName>
               <description>interrupt enable register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REPOKIE</name>
                     <description>Repetition register update OK interrupt               Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>REPOKIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Repetition register update OK interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Repetition register update OK interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UEIE</name>
                     <description>Update event interrupt               enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Update event interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Update event interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DOWNIE</name>
                     <description>Direction change to down Interrupt               Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DOWNIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DOWN interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DOWN interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UPIE</name>
                     <description>Direction change to UP Interrupt               Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UPIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>UP interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>UP interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ARROKIE</name>
                     <description>Autoreload register update OK Interrupt               Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ARROKIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ARROK interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ARROK interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CMPOKIE</name>
                     <description>Compare register update OK Interrupt               Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CMPOKIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CMPOK interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CMPOK interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTTRIGIE</name>
                     <description>External trigger valid edge Interrupt               Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EXTTRIGIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>EXTTRIG interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>EXTTRIG interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ARRMIE</name>
                     <description>Autoreload match Interrupt               Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ARRMIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ARRM interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ARRM interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CMPMIE</name>
                     <description>Compare match Interrupt               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CMPMIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CMPM interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CMPM interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
