tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>LPUART</name>
         <description>Universal synchronous asynchronous receiver       transmitter</description>
         <groupName>USART</groupName>
         <baseAddress>0x40008000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>LPUART1</name>
            <description>LPUART1 global interrupt</description>
            <value>38</value>
         </interrupt>
        <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1_enabled</displayName>
          <description>Control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>RXFFIE</name>
              <description>RXFIFO Full interrupt               enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXFFIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>USART interrupt generated when RXFF = 1 in the USART_ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXFEIE</name>
              <description>TXFIFO empty interrupt               enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXFEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>USART interrupt generated when TXFE = 1 in the USART_ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FIFOEN</name>
              <description>FIFO mode enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FIFOEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>FIFO mode is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>FIFO mode is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>M1</name>
              <description>Word length</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>M1</name><usage>read-write</usage><enumeratedValue><name>M0</name><description>Use M0 to set the data bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit7</name><description>1 start bit, 7 data bits, n stop bits</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>           
            <field>
              <name>DEAT</name>
              <description>DEAT</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DEDT</name>
              <description>DEDT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
            <field>
              <name>CMIE</name>
              <description>Character match interrupt               enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated when the CMF bit is set in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MME</name>
              <description>Mute mode enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MME</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Receiver in active mode permanently</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Receiver can switch between mute mode and active mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>M0</name>
              <description>Word length</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>M0</name><usage>read-write</usage><enumeratedValue><name>Bit8</name><description>1 start bit, 8 data bits, n stop bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit9</name><description>1 start bit, 9 data bits, n stop bits</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAKE</name>
              <description>Receiver wakeup method</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAKE</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>Idle line</description><value>0</value></enumeratedValue><enumeratedValue><name>Address</name><description>Address mask</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PCE</name>
              <description>Parity control enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PCE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Parity control disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Parity control enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PS</name>
              <description>Parity selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PS</name><usage>read-write</usage><enumeratedValue><name>Even</name><description>Even parity</description><value>0</value></enumeratedValue><enumeratedValue><name>Odd</name><description>Odd parity</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PEIE</name>
              <description>PE interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated whenever PE=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXEIE</name>
              <description>interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated whenever TXE=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transmission complete interrupt               enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated whenever TC=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXNEIE</name>
              <description>RXNE interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXNEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated whenever ORE=1 or RXNE=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IDLEIE</name>
              <description>IDLE interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>IDLEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated whenever IDLE=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Transmitter is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Transmitter is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RE</name>
              <description>Receiver enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Receiver is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Receiver is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UESM</name>
              <description>USART enable in Stop mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>UESM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>USART not able to wake up the MCU from Stop mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>USART able to wake up the MCU from Stop mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UE</name>
              <description>USART enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>UE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>UART is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>UART is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
		<register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>Control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>Address of the LPUART node</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>           
            <field>
              <name>MSBFIRST</name>
              <description>Most significant bit first</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MSBFIRST</name><usage>read-write</usage><enumeratedValue><name>LSB</name><description>data is transmitted/received with data bit 0 first, following the start bit</description><value>0</value></enumeratedValue><enumeratedValue><name>MSB</name><description>data is transmitted/received with MSB (bit 7/8/9) first, following the start bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DATAINV</name>
              <description>Binary data inversion</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DATAINV</name><usage>read-write</usage><enumeratedValue><name>Positive</name><description>Logical data from the data register are send/received in positive/direct logic</description><value>0</value></enumeratedValue><enumeratedValue><name>Negative</name><description>Logical data from the data register are send/received in negative/inverse logic</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXINV</name>
              <description>TX pin active level               inversion</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXINV</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>TX pin signal works using the standard logic levels</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>TX pin signal values are inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXINV</name>
              <description>RX pin active level               inversion</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXINV</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>RX pin signal works using the standard logic levels</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>RX pin signal values are inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SWAP</name>
              <description>Swap TX/RX pins</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SWAP</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>TX/RX pins are used as defined in standard pinout</description><value>0</value></enumeratedValue><enumeratedValue><name>Swapped</name><description>The TX and RX pins functions are swapped</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>STOP</name><usage>read-write</usage><enumeratedValue><name>Stop1</name><description>1 stop bit</description><value>0</value></enumeratedValue><enumeratedValue><name>Stop2</name><description>2 stop bit</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADDM7</name>
              <description>7-bit Address Detection/4-bit Address               Detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADDM7</name><usage>read-write</usage><enumeratedValue><name>Bit4</name><description>4-bit address detection</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit7</name><description>7-bit address detection</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>          
          </fields>
        </register>
