tinygo-org/stm32-svd/svd/stm32wle5.svd
        <register>
          <name>CR3</name>
          <displayName>CR3</displayName>
          <description>Control register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>TXFTCFG</name>
              <description>TXFIFO threshold               configuration</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>TXFTCFG</name><usage>read-write</usage><enumeratedValue><name>Depth_1_8</name><description>TXFIFO reaches 1/8 of its depth</description><value>0</value></enumeratedValue><enumeratedValue><name>Depth_1_4</name><description>TXFIFO reaches 1/4 of its depth</description><value>1</value></enumeratedValue><enumeratedValue><name>Depth_1_2</name><description>TXFIFO reaches 1/2 of its depth</description><value>2</value></enumeratedValue><enumeratedValue><name>Depth_3_4</name><description>TXFIFO reaches 3/4 of its depth</description><value>3</value></enumeratedValue><enumeratedValue><name>Depth_7_8</name><description>TXFIFO reaches 7/8 of its depth</description><value>4</value></enumeratedValue><enumeratedValue><name>Empty</name><description>TXFIFO becomes empty</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXFTIE</name>
              <description>RXFIFO threshold interrupt               enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXFTIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>USART interrupt generated when Receive FIFO reaches the threshold programmed in RXFTCFG</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXFTCFG</name>
              <description>Receive FIFO threshold               configuration</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>RXFTCFG</name><usage>read-write</usage><enumeratedValue><name>Depth_1_8</name><description>RXFIFO reaches 1/8 of its depth</description><value>0</value></enumeratedValue><enumeratedValue><name>Depth_1_4</name><description>RXFIFO reaches 1/4 of its depth</description><value>1</value></enumeratedValue><enumeratedValue><name>Depth_1_2</name><description>RXFIFO reaches 1/2 of its depth</description><value>2</value></enumeratedValue><enumeratedValue><name>Depth_3_4</name><description>RXFIFO reaches 3/4 of its depth</description><value>3</value></enumeratedValue><enumeratedValue><name>Depth_7_8</name><description>RXFIFO reaches 7/8 of its depth</description><value>4</value></enumeratedValue><enumeratedValue><name>Full</name><description>RXFIFO becomes full</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXFTIE</name>
              <description>threshold interrupt enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXFTIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>USART interrupt generated when Transmit FIFO reaches the threshold programmed in TXFTCFG</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WUFIE</name>
              <description>Wakeup from Stop mode interrupt               enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WUFIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>An USART interrupt is generated whenever WUF=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WUS</name>
              <description>Wakeup from Stop mode interrupt flag               selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>WUS</name><usage>read-write</usage><enumeratedValue><name>Address</name><description>WUF active on address match</description><value>0</value></enumeratedValue><enumeratedValue><name>Start</name><description>WuF active on Start bit detection</description><value>2</value></enumeratedValue><enumeratedValue><name>RXNE</name><description>WUF active on RXNE</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DEP</name>
              <description>Driver enable polarity               selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DEP</name><usage>read-write</usage><enumeratedValue><name>High</name><description>DE signal is active high</description><value>0</value></enumeratedValue><enumeratedValue><name>Low</name><description>DE signal is active low</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DEM</name>
              <description>Driver enable mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DEM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DE function is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>The DE signal is output on the RTS pin</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DDRE</name>
              <description>DMA Disable on Reception               Error</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DDRE</name><usage>read-write</usage><enumeratedValue><name>NotDisabled</name><description>DMA is not disabled in case of reception error</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>DMA is disabled following a reception error</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OVRDIS</name>
              <description>Overrun Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVRDIS</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Overrun Error Flag, ORE, is set when received data is not read before receiving new data</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Overrun functionality is disabled. If new data is received while the RXNE flag is still set the ORE flag is not set and the new received data overwrites the previous content of the RDR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CTSIE</name>
              <description>CTS interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CTSIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>An interrupt is generated whenever CTSIF=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CTSE</name>
              <description>CTS enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CTSE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CTS hardware flow control disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CTS mode enabled, data is only transmitted when the CTS input is asserted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RTSE</name>
              <description>RTS enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RTSE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>RTS hardware flow control disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>RTS output enabled, data is only requested when there is space in the receive buffer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMAT</name>
              <description>DMA enable transmitter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DMAT</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA mode is disabled for transmission</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA mode is enabled for transmission</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMAR</name>
              <description>DMA enable receiver</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DMAR</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA mode is disabled for reception</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA mode is enabled for reception</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>HDSEL</name>
              <description>Half-duplex selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>HDSEL</name><usage>read-write</usage><enumeratedValue><name>NotSelected</name><description>Half duplex mode is not selected</description><value>0</value></enumeratedValue><enumeratedValue><name>Selected</name><description>Half duplex mode is selected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EIE</name>
              <description>Error interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>An interrupt is generated when FE=1 or ORE=1 or NF=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <displayName>BRR</displayName>
          <description>Baud rate register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>BRR</name>
              <description>BRR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>16777215</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RQR</name>
          <displayName>RQR</displayName>
          <description>Request register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>TXFRQ</name>
              <description>Transmit data flush               request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXFRQ</name><usage>read-write</usage><enumeratedValue><name>Discard</name><description>Set the TXE flags. This allows to discard the transmit data</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXFRQ</name>
              <description>Receive data flush request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXFRQ</name><usage>read-write</usage><enumeratedValue><name>Discard</name><description>clears the RXNE flag. This allows to discard the received data without reading it, and avoid an overrun condition</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MMRQ</name>
              <description>Mute mode request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MMRQ</name><usage>read-write</usage><enumeratedValue><name>Mute</name><description>Puts the USART in mute mode and sets the RWU flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SBKRQ</name>
              <description>Send break request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SBKRQ</name><usage>read-write</usage><enumeratedValue><name>Break</name><description>sets the SBKF flag and request to send a BREAK on the line, as soon as the transmit machine is available</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR_enabled</displayName>
          <description>Interrupt and status register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x008000C0</resetValue>
          <fields>
            <field>
              <name>TXFT</name>
              <description>TXFIFO threshold flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFT</name>
              <description>RXFIFO threshold flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFF</name>
              <description>RXFIFO Full</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFE</name>
              <description>TXFIFO Empty</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REACK</name>
              <description>REACK</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEACK</name>
              <description>TEACK</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUF</name>
              <description>WUF</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RWU</name>
              <description>RWU</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBKF</name>
              <description>SBKF</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMF</name>
              <description>CMF</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>BUSY</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTS</name>
              <description>CTS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTSIF</name>
              <description>CTSIF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFNF</name>
              <description>TXFNF</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC</name>
              <description>TC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFNE</name>
              <description>RXFNE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDLE</name>
              <description>IDLE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ORE</name>
              <description>ORE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NE</name>
              <description>NE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FE</name>
              <description>FE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PE</name>
              <description>PE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>Interrupt flag clear register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>WUCF</name>
              <description>Wakeup from Stop mode clear               flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WUCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the WUF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMCF</name>
              <description>Character match clear flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the CMF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CTSCF</name>
              <description>CTS clear flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CTSCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the CTSIF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TCCF</name>
              <description>Transmission complete clear               flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TCCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the TC flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IDLECF</name>
              <description>Idle line detected clear               flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>IDLECF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the IDLE flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ORECF</name>
              <description>Overrun error clear flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ORECF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the ORE flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>NCF</name>
              <description>Noise detected clear flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>NCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the NF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FECF</name>
              <description>Framing error clear flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FECF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the FE flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PECF</name>
              <description>Parity error clear flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PECF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the PE flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
