tinygo-org/stm32-svd/svd/stm32wle5.svd
        <register>
          <name>RDR</name>
          <displayName>RDR</displayName>
          <description>Receive data register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>RDR</name>
              <description>Receive data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>511</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR</name>
          <displayName>TDR</displayName>
          <description>Transmit data register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>TDR</name>
              <description>Transmit data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>511</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESC</name>
          <displayName>PRESC</displayName>
          <description>Prescaler register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>PRESCALER</name>
              <description>Clock prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            <enumeratedValues><name>PRESCALER</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>/1</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>/2</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>/4</description><value>2</value></enumeratedValue><enumeratedValue><name>Div6</name><description>/6</description><value>3</value></enumeratedValue><enumeratedValue><name>Div8</name><description>/8</description><value>4</value></enumeratedValue><enumeratedValue><name>Div10</name><description>/10</description><value>5</value></enumeratedValue><enumeratedValue><name>Div12</name><description>/12</description><value>6</value></enumeratedValue><enumeratedValue><name>Div16</name><description>/16</description><value>7</value></enumeratedValue><enumeratedValue><name>Div32</name><description>/32</description><value>8</value></enumeratedValue><enumeratedValue><name>Div64</name><description>/64</description><value>9</value></enumeratedValue><enumeratedValue><name>Div128</name><description>/128</description><value>10</value></enumeratedValue><enumeratedValue><name>Div256</name><description>/256</description><value>11</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
      </peripheral>
      <peripheral>
         <name>MPU</name>
         <description>Memory protection unit</description>
         <groupName>MPU</groupName>
         <baseAddress>0xE000ED90</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x15</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MPU_TYPER</name>
               <displayName>MPU_TYPER</displayName>
               <description>MPU type register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0X00000800</resetValue>
               <fields>
                  <field>
                     <name>SEPARATE</name>
                     <description>Separate flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DREGION</name>
                     <description>Number of MPU data regions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IREGION</name>
                     <description>Number of MPU instruction               regions</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MPU_CTRL</name>
               <displayName>MPU_CTRL</displayName>
               <description>MPU control register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enables the MPU</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HFNMIENA</name>
                     <description>Enables the operation of MPU during hard               fault</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVDEFENA</name>
                     <description>Enable priviliged software access to               default memory map</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MPU_RNR</name>
               <displayName>MPU_RNR</displayName>
               <description>MPU region number register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>REGION</name>
                     <description>MPU region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MPU_RBAR</name>
               <displayName>MPU_RBAR</displayName>
               <description>MPU region base address           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>REGION</name>
                     <description>MPU region field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VALID</name>
                     <description>MPU region number valid</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>Region base address field</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>27</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MPU_RASR</name>
               <displayName>MPU_RASR</displayName>
               <description>MPU region attribute and size           register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Region enable bit.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Size of the MPU protection               region</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SRD</name>
                     <description>Subregion disable bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>B</name>
                     <description>memory attribute</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C</name>
                     <description>memory attribute</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S</name>
                     <description>Shareable memory attribute</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEX</name>
                     <description>memory attribute</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>AP</name>
                     <description>Access permission</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>XN</name>
                     <description>Instruction access disable               bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
