tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>NVIC_STIR</name>
         <description>Nested vectored interrupt       controller</description>
         <groupName>NVIC</groupName>
         <baseAddress>0xE000EF00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x5</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>STIR</name>
               <displayName>STIR</displayName>
               <description>Software trigger interrupt           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTID</name>
                     <description>Software generated interrupt               ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PKA</name>
         <description>Public key accelerator</description>
         <groupName>PKA</groupName>
         <baseAddress>0x58002000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x2000</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PKA</name>
            <description>Private key accelerator
        interrupt</description>
            <value>53</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDRERRIE</name>
                     <description>Address error interrupt               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADDRERRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt is generated when ADDRERRF flag is set in PKA_SR</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>An interrupt is generated when ADDRERRF flag is set in PKA_SR</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RAMERRIE</name>
                     <description>RAM error interrupt enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RAMERRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt is generated when RAMERRF flag is set in PKA_SR</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>An interrupt is generated when RAMERRF flag is set in PKA_SR</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PROCENDIE</name>
                     <description>PROCENDIE</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PROCENDIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt is generated when PROCENDF flag is set in PKA_SR</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>An interrupt is generated when PROCENDF flag is set in PKA_SR</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MODE</name>
                     <description>PKA operation code</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  <enumeratedValues><name>MODE</name><usage>read-write</usage><enumeratedValue><name>MontgomeryCompExp</name><description>Montgomery parameter computation then modular exponentiation</description><value>0</value></enumeratedValue><enumeratedValue><name>MontgomeryComp</name><description>Montgomery parameter computation only</description><value>1</value></enumeratedValue><enumeratedValue><name>MontgomeryExp</name><description>Modular exponentiation only (Montgomery parameter must be loaded first)</description><value>2</value></enumeratedValue><enumeratedValue><name>MontgomeryCompScalar</name><description>Montgomery parameter computation then ECC scalar multiplication</description><value>32</value></enumeratedValue><enumeratedValue><name>MontgomeryScalar</name><description>ECC scalar multiplication only (Montgomery parameter must be loaded first)</description><value>34</value></enumeratedValue><enumeratedValue><name>ECDSASign</name><description>ECDSA sign</description><value>36</value></enumeratedValue><enumeratedValue><name>ECDSAVerif</name><description>ECDSA verification</description><value>38</value></enumeratedValue><enumeratedValue><name>Elliptic</name><description>Point on elliptic curve Fp check</description><value>40</value></enumeratedValue><enumeratedValue><name>RSA</name><description>RSA CRT exponentiation</description><value>7</value></enumeratedValue><enumeratedValue><name>ModularInv</name><description>Modular inversion</description><value>8</value></enumeratedValue><enumeratedValue><name>ArithmeticAdd</name><description>Arithmetic addition</description><value>9</value></enumeratedValue><enumeratedValue><name>ArithmeticSub</name><description>Arithmetic subtraction</description><value>10</value></enumeratedValue><enumeratedValue><name>ArithmeticMul</name><description>Arithmetic multiplication</description><value>11</value></enumeratedValue><enumeratedValue><name>ArithmeticComp</name><description>Arithmetic comparison</description><value>12</value></enumeratedValue><enumeratedValue><name>ModularRed</name><description>Modular reduction</description><value>13</value></enumeratedValue><enumeratedValue><name>ModularAdd</name><description>Modular addition</description><value>14</value></enumeratedValue><enumeratedValue><name>ModularSub</name><description>Modular subtraction</description><value>15</value></enumeratedValue><enumeratedValue><name>ModularMul</name><description>Montgomery multiplication</description><value>16</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>START</name>
                     <description>start the operation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>STARTW</name><usage>write</usage><enumeratedValue><name>Start</name><description>Writing 1 to this bit starts the operation which is selected by MODE[5:0], using the operands and data already written to the PKA RAM - This bit is always read as 0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EN</name>
                     <description>PKA enable.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable PKA</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable PKA</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>status register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDRERRF</name>
                     <description>Address error flag</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADDRERRF</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>No error</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Address access is out of range (unmapped address)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RAMERRF</name>
                     <description>PKA RAM error flag</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RAMERRF</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>No error</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>An AHB access to the PKA RAM occurred while the PKA core was computing and using its internal RAM (AHB PKA_RAM access are not allowed while PKA operation is in progress)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PROCENDF</name>
                     <description>PKA End of Operation flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PROCENDF</name><usage>read-write</usage><enumeratedValue><name>InProgress</name><description>Operation in progress</description><value>0</value></enumeratedValue><enumeratedValue><name>Completed</name><description>PKA operation is completed - set when BUSY is deasserted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BUSY</name>
                     <description>PKA operation is in progressThis bit is               set to 1 whenever START bit in the PKA_CR is set. It               is automatically cleared when the computation is               complete, meaning that PKA RAM can be safely accessed               and a new operation can be started.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BUSY</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>No operation in pgoress</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>Operation in progress</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CLRFR</name>
               <displayName>CLRFR</displayName>
               <description>clear flag register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDRERRFC</name>
                     <description>Clear Address error flag</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADDRERRFC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear ADDRERRF flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RAMERRFC</name>
                     <description>Clear PKA RAM error flag</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RAMERRFC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear RAMERRF flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PROCENDFC</name>
                     <description>Clear PKA End of Operation               flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PROCENDFC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear PROCENDF flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>                		
               </fields>
            </register>
