tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PWR</name>
         <description>Power control</description>
         <groupName>PWR</groupName>
         <baseAddress>0x58000400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
			<register>
			  <name>CR1</name>
			  <displayName>CR1</displayName>
			  <description>Power control register 1</description>
			  <addressOffset>0x0</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000200</resetValue>
			  <fields>
				<field>
				  <name>LPR</name>
				  <description>Low-power run</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>LPR</name><usage>read-write</usage><enumeratedValue><name>MainMode</name><description>Voltage regulator in Main mode in Low-power run mode</description><value>0</value></enumeratedValue><enumeratedValue><name>LowPowerMode</name><description>Voltage regulator in low-power mode in Low-power run mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>VOS</name>
				  <description>Voltage scaling range               selection</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>2</bitWidth>
				<enumeratedValues><name>VOS</name><usage>read-write</usage><enumeratedValue><name>V1_2</name><description>1.2 V (range 1)</description><value>1</value></enumeratedValue><enumeratedValue><name>V1_0</name><description>1.0 V (range 2)</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>DBP</name>
				  <description>Disable backup domain write               protection</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>DBP</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Access to RTC and backup registers disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Access to RTC and backup registers enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>FPDS</name>
				  <description>Flash memory power down mode during               LPSleep for CPU1</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>FPDS</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>Flash memory in Idle mode when system is in LPSleep mode</description><value>0</value></enumeratedValue><enumeratedValue><name>PowerDown</name><description>Flash memory in Power-down mode when system is in LPSleep mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>FPDR</name>
				  <description>Flash memory power down mode during               LPRun for CPU1</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>FPDR</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>Flash memory in Idle mode when system is in LPRun mode</description><value>0</value></enumeratedValue><enumeratedValue><name>PowerDown</name><description>Flash memory in Power-down mode when system is in LPRun mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>SUBGHZSPINSSSEL</name>
				  <description>sub-GHz SPI NSS source select</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>SUBGHZSPINSSSEL</name><usage>read-write</usage><enumeratedValue><name>SUBGHZSPICR</name><description>sub-GHz SPI NSS signal driven from PWR_SUBGHZSPICR.NSS (RFBUSYMS functionality enabled)</description><value>0</value></enumeratedValue><enumeratedValue><name>LPTIM3</name><description>sub-GHz SPI NSS signal driven from LPTIM3_OUT (RFBUSYMS functionality disabled)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>LPMS</name>
				  <description>Low-power mode selection for               CPU1</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>3</bitWidth>
				<enumeratedValues><name>LPMS</name><usage>read-write</usage><enumeratedValue><name>Stop0</name><description>Stop 0 mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Stop1</name><description>Stop 1 mode</description><value>1</value></enumeratedValue><enumeratedValue><name>Stop2</name><description>Stop 2 mode</description><value>2</value></enumeratedValue><enumeratedValue><name>Standby</name><description>Standby mode</description><value>3</value></enumeratedValue><enumeratedValue><name>Shutdown</name><description>Shutdown mode</description><value>4</value></enumeratedValue></enumeratedValues>
            </field>          
			  </fields>
			</register>
            <register>
               <name>CR2</name>
               <displayName>CR2</displayName>
               <description>Power control register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PVME3</name>
                     <description>Peripheral voltage monitoring 3 enable:               VDDA vs. 1.62V</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PVME3</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>PVM3 (VDDA monitoring versus 1.62 V threshold) disable</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>PVM3 (VDDA monitoring versus 1.62 V threshold) enable</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PLS</name>
                     <description>Power voltage detector level               selection.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>PLS</name><usage>read-write</usage><enumeratedValue><name>V2_0</name><description>2.0V</description><value>0</value></enumeratedValue><enumeratedValue><name>V2_2</name><description>2.2V</description><value>1</value></enumeratedValue><enumeratedValue><name>V2_4</name><description>2.4V</description><value>2</value></enumeratedValue><enumeratedValue><name>V2_5</name><description>2.5V</description><value>3</value></enumeratedValue><enumeratedValue><name>V2_6</name><description>2.6V</description><value>4</value></enumeratedValue><enumeratedValue><name>V2_8</name><description>2.8V</description><value>5</value></enumeratedValue><enumeratedValue><name>V2_9</name><description>2.9V</description><value>6</value></enumeratedValue><enumeratedValue><name>External</name><description>External input analog voltage PVD_IN (compared internally to VREFINT)</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PVDE</name>
                     <description>Power voltage detector               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PVDE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>PVD Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>PVD Enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CR3</name>
               <displayName>CR3</displayName>
               <description>Power control register 3</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>EIWUL</name>
                     <description>Enable internal wakeup line for               CPU1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EIWUL</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Internal wakeup line interrupt to CPU1 disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Internal wakeup line interrupt to CPU1 enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EWRFIRQ</name>
                     <description>akeup for CPU1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EWRFIRQ</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Radio IRQ[2:0] is disabled and does not trigger a wakeup from Standby event to CPU1.</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Radio IRQ[2:0] is enabled and triggers a wakeup from Standby event to CPU1.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EWRFBUSY</name>
                     <description>Enable Radio BUSY Wakeup from Standby               for CPU1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EWRFBUSY</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Radio Busy is disabled and does not trigger a wakeup from Standby event to CPU1 when a rising or a falling edge occurs</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Radio Busy is enabled and triggers a wakeup from Standby event to CPU1 when a rising or a falling edge occurs. The active edge is configured via the WRFBUSYP bit in PWR_CR4</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>APC</name>
                     <description>Apply pull-up and pull-down               configuration from CPU1</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>APC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>I/O pull-up and pull-down configurations defined in the PWR_PUCRx and PWR_PDCRx registers are applied</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>PWR_PUCRx and PWR_PDCRx registers are NOT applied to the I/Os</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RRS</name>
                     <description>SRAM2 retention in Standby               mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RRS</name><usage>read-write</usage><enumeratedValue><name>PowerOff</name><description>SRAM2 powered off in Standby mode (SRAM2 content lost)</description><value>0</value></enumeratedValue><enumeratedValue><name>OnLPR</name><description>SRAM2 powered by the low-power regulator in Standby mode (SRAM2 content kept)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EWPVD</name>
                     <description>Enable wakeup PVD for CPU1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EWPVD</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>PVD not enabled by the sub-GHz radio active state</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>PVD enabled while the sub-GHz radio is active</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EULPEN</name>
                     <description>Ultra-low-power enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EULPEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable (the supply voltage is monitored continuously)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable, when set, the supply voltage is sampled for PDR/BOR reset condition only periodically</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EWUP3</name>
                     <description>Enable Wakeup pin WKUP3 for               CPU1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EWUP3</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>WKUP pin 3 is used for general purpose I/Os. An event on the WKUP pin 3 does not wakeup the device from Standby mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>WKUP pin 3 is used for wakeup from Standby mode and forced in input pull down configuration (rising edge on WKUP pin 3wakes-up the system from Standby mode)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EWUP2</name>
                     <description>Enable Wakeup pin WKUP2 for               CPU1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EWUP2</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>WKUP pin 2 is used for general purpose I/Os. An event on the WKUP pin 2 does not wakeup the device from Standby mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>WKUP pin 2 is used for wakeup from Standby mode and forced in input pull down configuration (rising edge on WKUP pin 2 wakes-up the system from Standby mode)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EWUP1</name>
                     <description>Enable Wakeup pin WKUP1 for               CPU1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EWUP1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>WKUP pin 1 is used for general purpose I/Os. An event on the WKUP pin 1 does not wakeup the device from Standby mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>WKUP pin 1 is used for wakeup from Standby mode and forced in input pull down configuration (rising edge on WKUP pin 1 wakes-up the system from Standby mode)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CR4</name>
               <displayName>CR4</displayName>
               <description>Power control register 4</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WRFBUSYP</name>
                     <description>Wakeup Radio BUSY polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WRFBUSYP</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>Detection on high level (rising edge)</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Detection on low level (falling edge)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>VBRS</name>
                     <description>VBAT battery charging resistor               selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>VBRS</name><usage>read-write</usage><enumeratedValue><name>R5k</name><description>VBAT charging through a 5 k&#937; resistor</description><value>0</value></enumeratedValue><enumeratedValue><name>R1_5k</name><description>VBAT charging through a 1.5 k&#937; resistor</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>VBE</name>
                     <description>VBAT battery charging               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>VBE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>VBAT battery charging disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>VBAT battery charging enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WP3</name>
                     <description>Wakeup pin WKUP3 polarity</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WP3</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>Detection on high level (rising edge)</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Detection on low level (falling edge)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WP2</name>
                     <description>Wakeup pin WKUP2 polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WP2</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>Detection on high level (rising edge)</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Detection on low level (falling edge)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WP1</name>
                     <description>Wakeup pin WKUP1 polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WP1</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>Detection on high level (rising edge)</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Detection on low level (falling edge)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
