tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>SR1</name>
               <displayName>SR1</displayName>
               <description>Power status register 1</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WUFI</name>
                     <description>Internal wakeup interrupt               flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WUFI</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>All internal wakeup sources are cleared</description><value>0</value></enumeratedValue><enumeratedValue><name>Wakeup</name><description>wakeup is detected on the internal wakeup line</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WRFBUSYF</name>
                     <description>Radio BUSY wakeup flag</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WRFBUSYF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>No wakeup event detected on radio busy</description><value>0</value></enumeratedValue><enumeratedValue><name>Wakeup</name><description>Wakeup event detected on radio busy</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WPVDF</name>
                     <description>Wakeup PVD flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WPVDF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>No wakeup event detected on PVD</description><value>0</value></enumeratedValue><enumeratedValue><name>Wakeup</name><description>Wakeup event detected on PVD</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WUF3</name>
                     <description>Wakeup flag 3</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WUF3</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>No wakeup event detected on WKUP3</description><value>0</value></enumeratedValue><enumeratedValue><name>Wakeup</name><description>Wakeup event detected on WKUP3</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WUF2</name>
                     <description>Wakeup flag 2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WUF2</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>No wakeup event detected on WKUP2</description><value>0</value></enumeratedValue><enumeratedValue><name>Wakeup</name><description>Wakeup event detected on WKUP2</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WUF1</name>
                     <description>Wakeup flag 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WUF1</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>No wakeup event detected on WKUP1</description><value>0</value></enumeratedValue><enumeratedValue><name>Wakeup</name><description>Wakeup event detected on WKUP1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>SR2</name>
               <displayName>SR2</displayName>
               <description>Power status register 2</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PVMO3</name>
                     <description>Peripheral voltage monitoring output:               VDDA vs. 1.62 V</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PVMO3</name><usage>read-write</usage><enumeratedValue><name>Above</name><description>VDDA voltage above PVM3 threshold (around 1.62 V)</description><value>0</value></enumeratedValue><enumeratedValue><name>Below</name><description>VDDA voltage below PVM3 threshold (around 1.62 V)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PVDO</name>
                     <description>Power voltage detector               output</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PVDO</name><usage>read-write</usage><enumeratedValue><name>Above</name><description>VDD or voltage level on PVD_IN above the selected PVD threshold</description><value>0</value></enumeratedValue><enumeratedValue><name>Below</name><description>VDD or voltage level on PVD_IN below the selected PVD threshold</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>VOSF</name>
                     <description>Voltage scaling flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>VOSF</name><usage>read-write</usage><enumeratedValue><name>Ready</name><description>Regulator ready in the selected voltage range</description><value>0</value></enumeratedValue><enumeratedValue><name>Change</name><description>Regulator output voltage changed to the required voltage level</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>REGLPF</name>
                     <description>regulator1 low power flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>REGLPF</name><usage>read-write</usage><enumeratedValue><name>Main</name><description>Main regulator (MR) ready and used</description><value>0</value></enumeratedValue><enumeratedValue><name>LowPower</name><description>Low-power regulator (LPR) used</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>REGLPS</name>
                     <description>regulator1 started</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>REGLPS</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>LPR not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>LPR ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FLASHRDY</name>
                     <description>Flash ready</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>FLASHRDY</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>Flash memory not ready to be accessed</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>Flash memory ready to be accessed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>REGMRS</name>
                     <description>regulator2 low power flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>REGMRS</name><usage>read-write</usage><enumeratedValue><name>V_DD</name><description>Main regulator supplied directly from VDD</description><value>0</value></enumeratedValue><enumeratedValue><name>LDO_SMPS</name><description>Main regulator supplied through LDO or SMPS</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				  <field>
                     <name>RFEOLF</name>
                     <description>Radio end of life flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RFEOLF</name><usage>read-write</usage><enumeratedValue><name>Above</name><description>Supply voltage above radio end-of-life operating low level</description><value>0</value></enumeratedValue><enumeratedValue><name>Below</name><description>Supply voltage below radio end-of-life operating low level</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LDORDY</name>
                     <description>LDO ready flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LDORDY</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>LDO not ready or off</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>LDO ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SMPSRDY</name>
                     <description>SMPS ready flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SMPSRDY</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>SMPS step-down converter not ready or off</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>SMPS step-down converter ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RFBUSYMS</name>
                     <description>Radio BUSY masked signal               status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RFBUSYMS</name><usage>read-write</usage><enumeratedValue><name>NotBusy</name><description>radio busy masked signal low (not busy)</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>radio busy masked signal high (busy)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RFBUSYS</name>
                     <description>Radio BUSY signal status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RFBUSYS</name><usage>read-write</usage><enumeratedValue><name>NotBusy</name><description>radio busy signal low (not busy)</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>radio busy signal high (busy)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <displayName>SCR</displayName>
               <description>Power status clear register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CWRFBUSYF</name>
                     <description>Clear wakeup Radio BUSY               flag</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CWRFBUSYFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Setting this bit clears the WRFBUSYF flag in the PWR_SR1. This bit is always read 0.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CWPVDF</name>
                     <description>Clear wakeup PVD interrupt               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CWPVDFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Setting this bit clears the WPVDF flag in the PWR_SR1. This bit is always read as 0.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CWUF3</name>
                     <description>Clear wakeup flag 3</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CWUF3W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Setting this bit clears the WUF3 flag in the PWR_SR1 register. This bit is always read as 0.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CWUF2</name>
                     <description>Clear wakeup flag 2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CWUF2W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Setting this bit clears the WUF2 flag in the PWR_SR1 register. This bit is always read as 0.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CWUF1</name>
                     <description>Clear wakeup flag 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CWUF1W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Setting this bit clears the WUF1 flag in the PWR_SR1 register. This bit is always read as 0.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CR5</name>
               <displayName>CR5</displayName>
               <description>Power control register 5</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMPSEN</name>
                     <description>Enable SMPS Step Down converter SMPS               mode enabled.</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SMPSEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SMPS step-down converter SMPS mode disabled (LDO mode enabled)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SMPS step-down converter SMPS mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RFEOLEN</name>
                     <description>Enable Radio End Of Life detector               enabled</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RFEOLEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Radio end-of-life detector disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Radio end-of-life detector enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>PUCRA</name>
               <displayName>PUCRA</displayName>
               <description>Power Port A pull-up control           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU15</name>
                     <description>Port PA15 pull-up</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU10"/>
            </field>
				  <field>
                     <name>PU14</name>
                     <description>PU14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU10"/>
            </field>
                  <field>
                     <name>PU13</name>
                     <description>Port PA[y] pull-up bit y (y=0 to               13)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU10"/>
            </field>
                  <field>
                     <name>PU12</name>
                     <description>PU12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU10"/>
            </field>
                  <field>
                     <name>PU11</name>
                     <description>PU11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU10"/>
            </field>
                  <field>
                     <name>PU10</name>
                     <description>PU10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PU10</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable pull-up on PA[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable pull-up on PA[y] when both APC bits are set in PWR control register 3 (PWR_CR3). The pull-up is not activated if the corresponding PA[y] bit is also set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PU9</name>
                     <description>PU9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU8</name>
                     <description>PU8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU7</name>
                     <description>PU7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU6</name>
                     <description>PU6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU5</name>
                     <description>PU5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU4</name>
                     <description>PU4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU3</name>
                     <description>PU3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU2</name>
                     <description>PU2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU1</name>
                     <description>PU1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU0</name>
                     <description>PU0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PU0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable pull-up on PA[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable pull-up on PA[y] when both APC bits are set in PWR control register 3 (PWR_CR3). The pull-up is not activated if the corresponding PA[y] bit is also set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>                 
               </fields>
            </register>
