tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>PDCRA</name>
               <displayName>PDCRA</displayName>
               <description>Power Port A pull-down control           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
			      <field>
                     <name>PD15</name>
                     <description>PD15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD10"/>
            </field>
                  <field>
                     <name>PD14</name>
                     <description>ull-down</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD10"/>
            </field>
				    <field>
                     <name>PD13</name>
                     <description>PD13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD10"/>
            </field>                 
                  <field>
                     <name>PD12</name>
                     <description>Port PA[y] pull-down (y=0 to               12)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD10"/>
            </field>
                  <field>
                     <name>PD11</name>
                     <description>PD11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD10"/>
            </field>
                  <field>
                     <name>PD10</name>
                     <description>PD10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PD10</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable the pull-down on PA[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable the pull-down on PA[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PD9</name>
                     <description>PD9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD8</name>
                     <description>PD8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD7</name>
                     <description>PD7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD6</name>
                     <description>PD6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD5</name>
                     <description>PD5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD4</name>
                     <description>PD4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD3</name>
                     <description>PD3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD2</name>
                     <description>PD2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD1</name>
                     <description>PD1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD0</name>
                     <description>PD0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PD0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable the pull-down on PA[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable the pull-down on PA[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>               
               </fields>
            </register>
            <register>
               <name>PUCRB</name>
               <displayName>PUCRB</displayName>
               <description>Power Port B pull-up control           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU15</name>
                     <description>Port PB[y] pull-up (y=0 to               15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU10"/>
            </field>
                  <field>
                     <name>PU14</name>
                     <description>PU14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU10"/>
            </field>
                  <field>
                     <name>PU13</name>
                     <description>PU13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU10"/>
            </field>
                  <field>
                     <name>PU12</name>
                     <description>PU12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU10"/>
            </field>
                  <field>
                     <name>PU11</name>
                     <description>PU11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU10"/>
            </field>
                  <field>
                     <name>PU10</name>
                     <description>PU10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PU10</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable pull-up on PB[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable pull-up on PB[y] when both APC bits are set in PWR control register 3 (PWR_CR3). The pull-up is not activated if the corresponding PB[y] bit is also set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PU9</name>
                     <description>PU9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU8</name>
                     <description>PU8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU7</name>
                     <description>PU7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU6</name>
                     <description>PU6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU5</name>
                     <description>PU5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU4</name>
                     <description>PU4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU3</name>
                     <description>PU3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU2</name>
                     <description>PU2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU1</name>
                     <description>PU1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU0</name>
                     <description>PU0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PU0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable pull-up on PB[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable pull-up on PB[y] when both APC bits are set in PWR control register 3 (PWR_CR3). The pull-up is not activated if the corresponding PB[y] bit is also set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>PDCRB</name>
               <displayName>PDCRB</displayName>
               <description>Power Port B pull-down control           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD15</name>
                     <description>Port PB[y] pull-down (y=5 to               15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD10"/>
            </field>
                  <field>
                     <name>PD14</name>
                     <description>PD14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD10"/>
            </field>
                  <field>
                     <name>PD13</name>
                     <description>PD13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD10"/>
            </field>
                  <field>
                     <name>PD12</name>
                     <description>PD12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD10"/>
            </field>
                  <field>
                     <name>PD11</name>
                     <description>PD11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD10"/>
            </field>
                  <field>
                     <name>PD10</name>
                     <description>PD10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PD10</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable the pull-down on PB[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable the pull-down on PB[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PD9</name>
                     <description>PD9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD8</name>
                     <description>PD8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD7</name>
                     <description>PD7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD6</name>
                     <description>PD6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD5</name>
                     <description>PD5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
				  <field>
                     <name>PD4</name>
                     <description>PD4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD3</name>
                     <description>Port PB[y] pull-down (y=0 to               3)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD2</name>
                     <description>PD2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD1</name>
                     <description>PD1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD0</name>
                     <description>PD0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PD0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable the pull-down on PB[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable the pull-down on PB[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>                  
               </fields>
            </register>
            <register>
               <name>PUCRC</name>
               <displayName>PUCRC</displayName>
               <description>Power Port C pull-up control           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU15</name>
                     <description>Port PC[y] pull-up (y=13 to               15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU13"/>
            </field>
                  <field>
                     <name>PU14</name>
                     <description>PU14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU13"/>
            </field>
                  <field>
                     <name>PU13</name>
                     <description>PU13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PU13</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable pull-up on PC[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable pull-up on PC[y] when both APC bits are set in PWR control register 3 (PWR_CR3). The pull-up is not activated if the corresponding PC[y] bit is also set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PU2</name>
                     <description>PU2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU1</name>
                     <description>PU1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU0</name>
                     <description>PU0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PU0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable pull-up on PC[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable pull-up on PC[y] when both APC bits are set in PWR control register 3 (PWR_CR3). The pull-up is not activated if the corresponding PC[y] bit is also set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PU3</name>
                     <description>PU3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU4</name>
                     <description>PU4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU5</name>
                     <description>PU5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
                  <field>
                     <name>PU6</name>
                     <description>PU6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PU0"/>
            </field>
               </fields>
            </register>
