tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>PDCRC</name>
               <displayName>PDCRC</displayName>
               <description>Power Port C pull-down control           register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD15</name>
                     <description>Port PC[y] pull-down (y=13 to               15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD13"/>
            </field>
                  <field>
                     <name>PD14</name>
                     <description>PD14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD13"/>
            </field>
                  <field>
                     <name>PD13</name>
                     <description>PD13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PD13</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable the pull-down on PC[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable the pull-down on PC[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PD2</name>
                     <description>PD2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD1</name>
                     <description>PD1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD0</name>
                     <description>PD0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PD0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable the pull-down on PC[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable the pull-down on PC[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PD3</name>
                     <description>PD3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD4</name>
                     <description>PD4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD5</name>
                     <description>PD5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
                  <field>
                     <name>PD6</name>
                     <description>PD6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PD0"/>
            </field>
               </fields>
            </register>
            <register>
               <name>PUCRH</name>
               <displayName>PUCRH</displayName>
               <description>Power Port H pull-up control           register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU3</name>
                     <description>pull-up</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PU3</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable pull-up on PH[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable pull-up on PH[y] when both APC bits are set in PWR control register 3 (PWR_CR3). The pull-up is not activated if the corresponding PH[y] bit is also set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>PDCRH</name>
               <displayName>PDCRH</displayName>
               <description>Power Port H pull-down control           register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD3</name>
                     <description>pull-down</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PD3</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable the pull-down on PH[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable the pull-down on PH[y] when both APC bits are set in PWR control register 3 (PWR_CR3)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>                      
            <register>
               <name>EXTSCR</name>
               <displayName>EXTSCR</displayName>
               <description>Power extended status and status clear           register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>               
                  <field>
                     <name>C1DS</name>
                     <description>CPU1 deepsleep mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>C1DS</name><usage>read-write</usage><enumeratedValue><name>RunningOrSleep</name><description>CPU is running or in sleep</description><value>0</value></enumeratedValue><enumeratedValue><name>DeepSleep</name><description>CPU is in Deep-Sleep</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>              
                  <field>
                     <name>C1STOPF</name>
                     <description>System Stop0, 1 flag for CPU1. (All core               states retained)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>C1STOPF</name><usage>read-write</usage><enumeratedValue><name>NoStop</name><description>System has not been in Stop 0 or 1 mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Stop</name><description>System has been in Stop 0 or 1 mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>C1STOP2F</name>
                     <description>System Stop2 flag for CPU1. (partial               core states retained)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>C1STOP2F</name><usage>read-write</usage><enumeratedValue><name>NoStop</name><description>System has not been in Stop 2 mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Stop</name><description>System has been in Stop 2 mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>C1SBF</name>
                     <description>System Standby flag for CPU1. (no core               states retained)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>C1SBF</name><usage>read-write</usage><enumeratedValue><name>NoStandby</name><description>System has not been in Standby mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Standby</name><description>System has been in Standby mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>C1CSSF</name>
                     <description>Clear CPU1 Stop Standby               flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  <enumeratedValues><name>C1CSSFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Setting this bit clears the C1STOPF and C1SBF bits</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>         
            <register>
               <name>SUBGHZSPICR</name>
               <displayName>SUBGHZSPICR</displayName>
               <description>Power SPI3 control register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>NSS</name>
                     <description>sub-GHz SPI NSS control</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>NSS</name><usage>read-write</usage><enumeratedValue><name>Low</name><description>Sub-GHz SPI NSS signal at level low</description><value>0</value></enumeratedValue><enumeratedValue><name>High</name><description>Sub-GHz SPI NSS signal is at level high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
