tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RCC</name>
         <description>Reset and clock control</description>
         <groupName>RCC</groupName>
         <baseAddress>0x58000000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RCC</name>
            <description>RCC global interrupt</description>
            <value>5</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Clock control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000061</resetValue>
			   <fields>
				<field>
				  <name>PLLRDY</name>
				  <description>Main PLL clock ready flag</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				<enumeratedValues><name>PLLRDY</name><usage>read-write</usage><enumeratedValue><name>Unlocked</name><description>PLL unlocked</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>PLL Locked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>PLLON</name>
				  <description>Main PLL enable</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>PLLON</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>Main PLL Off</description><value>0</value></enumeratedValue><enumeratedValue><name>On</name><description>Main PLL On</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HSEBYPPWR</name>
				  <description>Enable HSE32 VDDTCXO output on package               pin PB0-VDDTCXO.</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>HSEBYPPWR</name><usage>read-write</usage><enumeratedValue><name>PB0</name><description>PB0 selected</description><value>0</value></enumeratedValue><enumeratedValue><name>VDDTCXO</name><description>VDDTCXO selected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HSEPRE</name>
				  <description>HSE32 sysclk prescaler</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>HSEPRE</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>SYSCLK not divided (HSE32)</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>SYSCLK divided by two (HSE32/2)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>CSSON</name>
				  <description>HSE32 Clock security system               enable</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>CSSON</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>HSE32 CSS off</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>HSE32 CSS on if the HSE32 oscillator is stable and off if not</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HSERDY</name>
				  <description>HSE32 clock ready flag</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				<enumeratedValues><name>HSERDY</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>HSE32 oscillator not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>HSE32 oscillator ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HSEON</name>
				  <description>HSE32 clock enable</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>HSEON</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>HSE32 oscillator for CPU disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>HSE32 oscillator for CPU enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HSIKERDY</name>
				  <description>HSI16 kernel clock ready flag for               peripherals requests.</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				<enumeratedValues><name>HSIKERDY</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>HSI16 oscillator not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>HSI16 oscillator ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HSIASFS</name>
				  <description>HSI16 automatic start from               Stop</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>HSIASFS</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>HSI16 not enabled by hardware when exiting Stop modes with MSI as wakeup clock</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>HSI16 enabled by hardware when exiting Stop mode with MSI as wakeup clock</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HSIRDY</name>
				  <description>HSI16 clock ready flag. (After wakeup               from Stop this bit will be read 1 once the HSI16 is               ready)</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				<enumeratedValues><name>HSIRDY</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>HSI16 oscillator not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>HSI16 oscillator ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HSIKERON</name>
				  <description>HSI16 always enable for peripheral               kernel clocks.</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>HSIKERON</name><usage>read-write</usage><enumeratedValue><name>NotForced</name><description>No effect on HSI16 oscillator</description><value>0</value></enumeratedValue><enumeratedValue><name>Forced</name><description>HSI16 oscillator forced on even in Stop modes</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HSION</name>
				  <description>HSI16 clock enable</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>HSION</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>HSI16 oscillator off</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>HSI16 oscillator on</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>MSIRANGE</name>
				  <description>MSI clock ranges</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>MSIRANGE</name><usage>read-write</usage><enumeratedValue><name>Range100K</name><description>range 0 around 100 kHz</description><value>0</value></enumeratedValue><enumeratedValue><name>Range200K</name><description>range 1 around 200 kHz</description><value>1</value></enumeratedValue><enumeratedValue><name>Range400K</name><description>range 2 around 400 kHz</description><value>2</value></enumeratedValue><enumeratedValue><name>Range800K</name><description>range 3 around 800 kHz</description><value>3</value></enumeratedValue><enumeratedValue><name>Range1M</name><description>range 4 around 1 MHz</description><value>4</value></enumeratedValue><enumeratedValue><name>Range2M</name><description>range 5 around 2 MHz</description><value>5</value></enumeratedValue><enumeratedValue><name>Range4M</name><description>range 6 around 4 MHz (reset value)</description><value>6</value></enumeratedValue><enumeratedValue><name>Range8M</name><description>range 7 around 8 MHz</description><value>7</value></enumeratedValue><enumeratedValue><name>Range16M</name><description>range 8 around 16 MHz</description><value>8</value></enumeratedValue><enumeratedValue><name>Range24M</name><description>range 9 around 24 MHz</description><value>9</value></enumeratedValue><enumeratedValue><name>Range32M</name><description>range 10 around 32 MHz</description><value>10</value></enumeratedValue><enumeratedValue><name>Range48M</name><description>range 11 around 48 MHz</description><value>11</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>MSIRGSEL</name>
				  <description>MSI range control               selection</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>MSIRGSEL</name><usage>read-write</usage><enumeratedValue><name>CSR</name><description>MSI frequency range defined by MSISRANGE[3:0] in the RCC_CSR register</description><value>0</value></enumeratedValue><enumeratedValue><name>CR</name><description>MSI frequency range defined by MSIRANGE[3:0] in the RCC_CR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>MSIPLLEN</name>
				  <description>MSI clock PLL enable</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>MSIPLLEN</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>MSI PLL Off</description><value>0</value></enumeratedValue><enumeratedValue><name>On</name><description>MSI PLL On</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>MSIRDY</name>
				  <description>MSI clock ready flag (After reset this               bit will be read 1 once the MSI is               ready)</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-only</access>
				<enumeratedValues><name>MSIRDY</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>MSI oscillator not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>MSI oscillator ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>MSION</name>
				  <description>MSI clock enable</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>MSION</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MSI oscillator off</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MSI oscillator on</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
			  </fields>
            </register>
            <register>
               <name>ICSCR</name>
               <displayName>ICSCR</displayName>
               <description>Internal clock sources calibration           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x40000000</resetValue>
               <fields>
                  <field>
                     <name>HSITRIM</name>
                     <description>HSI16 clock trimming</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-write</access>
                  <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>HSICAL</name>
                     <description>HSI16 clock calibration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>MSITRIM</name>
                     <description>MSI clock trimming</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>MSICAL</name>
                     <description>MSI clock calibration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
