tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CFGR</name>
               <displayName>CFGR</displayName>
               <description>Clock configuration register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <resetValue>0x00070000</resetValue>
               <fields>
                  <field>
                     <name>MCOPRE</name>
                     <description>Microcontroller clock output               prescaler</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>MCOPRE</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>No division</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>Division by 2</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>Division by 4</description><value>2</value></enumeratedValue><enumeratedValue><name>Div8</name><description>Division by 8</description><value>3</value></enumeratedValue><enumeratedValue><name>Div16</name><description>Division by 16</description><value>4</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MCOSEL</name>
                     <description>Microcontroller clock               output</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>MCOSEL</name><usage>read-write</usage><enumeratedValue><name>NoClock</name><description>No clock</description><value>0</value></enumeratedValue><enumeratedValue><name>SYSCLK</name><description>SYSCLK clock selected</description><value>1</value></enumeratedValue><enumeratedValue><name>MSI</name><description>MSI oscillator clock selected</description><value>2</value></enumeratedValue><enumeratedValue><name>HSI16</name><description>HSI16 oscillator clock selected</description><value>3</value></enumeratedValue><enumeratedValue><name>HSE32</name><description>HSE32 oscillator clock selected</description><value>4</value></enumeratedValue><enumeratedValue><name>PLLR</name><description>Main PLLRCLK clock selected</description><value>5</value></enumeratedValue><enumeratedValue><name>LSI</name><description>LSI oscillator clock selected</description><value>6</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE oscillator clock selected</description><value>8</value></enumeratedValue><enumeratedValue><name>PLLP</name><description>Main PLLPCLK clock selected</description><value>13</value></enumeratedValue><enumeratedValue><name>PLLQ</name><description>Main PLLQCLK clock selected</description><value>14</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PPRE2F</name>
                     <description>PCLK2 prescaler flag               (APB2)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>PPRE2F</name><usage>read-write</usage><enumeratedValue><name>NotApplied</name><description>PCLK2 prescaler value not yet applied</description><value>0</value></enumeratedValue><enumeratedValue><name>Applied</name><description>PCLK2 prescaler value applied</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PPRE1F</name>
                     <description>PCLK1 prescaler flag               (APB1)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>PPRE1F</name><usage>read-write</usage><enumeratedValue><name>NotApplied</name><description>PCLK1 prescaler value not yet applied</description><value>0</value></enumeratedValue><enumeratedValue><name>Applied</name><description>PCLK1 prescaler value applied</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HPREF</name>
                     <description>HCLK1 prescaler flag (CPU1, AHB1, AHB2,               and SRAM1)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>HPREF</name><usage>read-write</usage><enumeratedValue><name>NotApplied</name><description>HCLK1 prescaler value not yet applied</description><value>0</value></enumeratedValue><enumeratedValue><name>Applied</name><description>HCLK1 prescaler value applied</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>STOPWUCK</name>
                     <description>Wakeup from Stop and CSS backup clock               selection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>STOPWUCK</name><usage>read-write</usage><enumeratedValue><name>MSI</name><description>MSI oscillator selected as wakeup from stop clock and CSS backup clock</description><value>0</value></enumeratedValue><enumeratedValue><name>HSI16</name><description>HSI16 oscillator selected as wakeup from stop clock and CSS backup clock</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PPRE2</name>
                     <description>PCLK2 high-speed prescaler               (APB2)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>PPRE2</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>HCLK not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>HCLK divided by 2</description><value>4</value></enumeratedValue><enumeratedValue><name>Div4</name><description>HCLK divided by 4</description><value>5</value></enumeratedValue><enumeratedValue><name>Div8</name><description>HCLK divided by 8</description><value>6</value></enumeratedValue><enumeratedValue><name>Div16</name><description>HCLK divided by 16</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PPRE1</name>
                     <description>PCLK1 low-speed prescaler               (APB1)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>PPRE1</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>HCLK not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>HCLK divided by 2</description><value>4</value></enumeratedValue><enumeratedValue><name>Div4</name><description>HCLK divided by 4</description><value>5</value></enumeratedValue><enumeratedValue><name>Div8</name><description>HCLK divided by 8</description><value>6</value></enumeratedValue><enumeratedValue><name>Div16</name><description>HCLK divided by 16</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HPRE</name>
                     <description>HCLK1 prescaler (CPU1, AHB1, AHB2, and               SRAM1.)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>HPRE</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>SYSCLK not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div3</name><description>SYSCLK divided by 3</description><value>1</value></enumeratedValue><enumeratedValue><name>Div5</name><description>SYSCLK divided by 5</description><value>2</value></enumeratedValue><enumeratedValue><name>Div6</name><description>SYSCLK divided by 6</description><value>5</value></enumeratedValue><enumeratedValue><name>Div10</name><description>SYSCLK divided by 10</description><value>6</value></enumeratedValue><enumeratedValue><name>Div32</name><description>SYSCLK divided by 32</description><value>7</value></enumeratedValue><enumeratedValue><name>Div2</name><description>SYSCLK divided by 2</description><value>8</value></enumeratedValue><enumeratedValue><name>Div4</name><description>SYSCLK divided by 4</description><value>9</value></enumeratedValue><enumeratedValue><name>Div8</name><description>SYSCLK divided by 8</description><value>10</value></enumeratedValue><enumeratedValue><name>Div16</name><description>SYSCLK divided by 16</description><value>11</value></enumeratedValue><enumeratedValue><name>Div64</name><description>SYSCLK divided by 64</description><value>12</value></enumeratedValue><enumeratedValue><name>Div128</name><description>SYSCLK divided by 128</description><value>13</value></enumeratedValue><enumeratedValue><name>Div256</name><description>SYSCLK divided by 128</description><value>14</value></enumeratedValue><enumeratedValue><name>Div512</name><description>SYSCLK divided by 512</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SWS</name>
                     <description>System clock switch status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>SWS</name><usage>read-write</usage><enumeratedValue><name>MSI</name><description>MSI oscillator used as system clock</description><value>0</value></enumeratedValue><enumeratedValue><name>HSI16</name><description>HSI16 oscillator used as system clock</description><value>1</value></enumeratedValue><enumeratedValue><name>HSE32</name><description>HSE32 oscillator used as system clock</description><value>2</value></enumeratedValue><enumeratedValue><name>PLLR</name><description>PLLRCLK used as system clock</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SW</name>
                     <description>System clock switch</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>SW</name><usage>read-write</usage><enumeratedValue><name>MSI</name><description>MSI oscillator used as system clock</description><value>0</value></enumeratedValue><enumeratedValue><name>HSI16</name><description>HSI16 oscillator used as system clock</description><value>1</value></enumeratedValue><enumeratedValue><name>HSE32</name><description>HSE32 oscillator used as system clock</description><value>2</value></enumeratedValue><enumeratedValue><name>PLLR</name><description>PLLRCLK used as system clock</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>PLLCFGR</name>
               <displayName>PLLCFGR</displayName>
               <description>PLL configuration register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x22040100</resetValue>
               <fields>
                  <field>
                     <name>PLLR</name>
                     <description>Main PLL division factor for               PLLRCLK</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues derivedFrom="PLLQ"/>
            </field>
                  <field>
                     <name>PLLREN</name>
                     <description>Main PLL PLLRCLK output               enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PLLPEN"/>
            </field>
                  <field>
                     <name>PLLQ</name>
                     <description>Main PLL division factor for               PLLQCLK</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>PLLQ</name><usage>read-write</usage><enumeratedValue><name>Div2</name><description>PLL = VCO/(N+1)</description><value>1</value></enumeratedValue><enumeratedValue><name>Div3</name><description>PLL = VCO/(N+1)</description><value>2</value></enumeratedValue><enumeratedValue><name>Div4</name><description>PLL = VCO/(N+1)</description><value>3</value></enumeratedValue><enumeratedValue><name>Div5</name><description>PLL = VCO/(N+1)</description><value>4</value></enumeratedValue><enumeratedValue><name>Div6</name><description>PLL = VCO/(N+1)</description><value>5</value></enumeratedValue><enumeratedValue><name>Div7</name><description>PLL = VCO/(N+1)</description><value>6</value></enumeratedValue><enumeratedValue><name>Div8</name><description>PLL = VCO/(N+1)</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PLLQEN</name>
                     <description>Main PLL PLLQCLK output               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PLLPEN"/>
            </field>
                  <field>
                     <name>PLLP</name>
                     <description>Main PLL division factor for               PLLPCLK.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>5</bitWidth>
                  <enumeratedValues><name>PLLP</name><usage>read-write</usage><enumeratedValue><name>Div2</name><description>PLL = VCO/(N+1)</description><value>1</value></enumeratedValue><enumeratedValue><name>Div3</name><description>PLL = VCO/(N+1)</description><value>2</value></enumeratedValue><enumeratedValue><name>Div4</name><description>PLL = VCO/(N+1)</description><value>3</value></enumeratedValue><enumeratedValue><name>Div5</name><description>PLL = VCO/(N+1)</description><value>4</value></enumeratedValue><enumeratedValue><name>Div6</name><description>PLL = VCO/(N+1)</description><value>5</value></enumeratedValue><enumeratedValue><name>Div7</name><description>PLL = VCO/(N+1)</description><value>6</value></enumeratedValue><enumeratedValue><name>Div8</name><description>PLL = VCO/(N+1)</description><value>7</value></enumeratedValue><enumeratedValue><name>Div9</name><description>PLL = VCO/(N+1)</description><value>8</value></enumeratedValue><enumeratedValue><name>Div10</name><description>PLL = VCO/(N+1)</description><value>9</value></enumeratedValue><enumeratedValue><name>Div11</name><description>PLL = VCO/(N+1)</description><value>10</value></enumeratedValue><enumeratedValue><name>Div12</name><description>PLL = VCO/(N+1)</description><value>11</value></enumeratedValue><enumeratedValue><name>Div13</name><description>PLL = VCO/(N+1)</description><value>12</value></enumeratedValue><enumeratedValue><name>Div14</name><description>PLL = VCO/(N+1)</description><value>13</value></enumeratedValue><enumeratedValue><name>Div15</name><description>PLL = VCO/(N+1)</description><value>14</value></enumeratedValue><enumeratedValue><name>Div16</name><description>PLL = VCO/(N+1)</description><value>15</value></enumeratedValue><enumeratedValue><name>Div17</name><description>PLL = VCO/(N+1)</description><value>16</value></enumeratedValue><enumeratedValue><name>Div18</name><description>PLL = VCO/(N+1)</description><value>17</value></enumeratedValue><enumeratedValue><name>Div19</name><description>PLL = VCO/(N+1)</description><value>18</value></enumeratedValue><enumeratedValue><name>Div20</name><description>PLL = VCO/(N+1)</description><value>19</value></enumeratedValue><enumeratedValue><name>Div21</name><description>PLL = VCO/(N+1)</description><value>20</value></enumeratedValue><enumeratedValue><name>Div22</name><description>PLL = VCO/(N+1)</description><value>21</value></enumeratedValue><enumeratedValue><name>Div23</name><description>PLL = VCO/(N+1)</description><value>22</value></enumeratedValue><enumeratedValue><name>Div24</name><description>PLL = VCO/(N+1)</description><value>23</value></enumeratedValue><enumeratedValue><name>Div25</name><description>PLL = VCO/(N+1)</description><value>24</value></enumeratedValue><enumeratedValue><name>Div26</name><description>PLL = VCO/(N+1)</description><value>25</value></enumeratedValue><enumeratedValue><name>Div27</name><description>PLL = VCO/(N+1)</description><value>26</value></enumeratedValue><enumeratedValue><name>Div28</name><description>PLL = VCO/(N+1)</description><value>27</value></enumeratedValue><enumeratedValue><name>Div29</name><description>PLL = VCO/(N+1)</description><value>28</value></enumeratedValue><enumeratedValue><name>Div30</name><description>PLL = VCO/(N+1)</description><value>29</value></enumeratedValue><enumeratedValue><name>Div31</name><description>PLL = VCO/(N+1)</description><value>30</value></enumeratedValue><enumeratedValue><name>Div32</name><description>PLL = VCO/(N+1)</description><value>31</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PLLPEN</name>
                     <description>Main PLL PLLPCLK output               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PLLPEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>PLLCLK output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>PLLCLK output enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PLLN</name>
                     <description>Main PLL multiplication factor for               VCO</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  <writeConstraint><range><minimum>6</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>PLLM</name>
                     <description>Division factor for the main PLL input               clock</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>PLLM</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>VCO input = PLL input / PLLM</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>VCO input = PLL input / PLLM</description><value>1</value></enumeratedValue><enumeratedValue><name>Div3</name><description>VCO input = PLL input / PLLM</description><value>2</value></enumeratedValue><enumeratedValue><name>Div4</name><description>VCO input = PLL input / PLLM</description><value>3</value></enumeratedValue><enumeratedValue><name>Div5</name><description>VCO input = PLL input / PLLM</description><value>4</value></enumeratedValue><enumeratedValue><name>Div6</name><description>VCO input = PLL input / PLLM</description><value>5</value></enumeratedValue><enumeratedValue><name>Div7</name><description>VCO input = PLL input / PLLM</description><value>6</value></enumeratedValue><enumeratedValue><name>Div8</name><description>VCO input = PLL input / PLLM</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PLLSRC</name>
                     <description>Main PLL entry clock               source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>PLLSRC</name><usage>read-write</usage><enumeratedValue><name>NoClock</name><description>No clock sent to PLL</description><value>0</value></enumeratedValue><enumeratedValue><name>MSI</name><description>MSI clock selected as PLL clock entry</description><value>1</value></enumeratedValue><enumeratedValue><name>HSI16</name><description>HSI16 clock selected as PLL clock entry</description><value>2</value></enumeratedValue><enumeratedValue><name>HSE32</name><description>HSE32 clock selected as PLL clock entry</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
