tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CIER</name>
               <displayName>CIER</displayName>
               <description>Clock interrupt enable           register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSECSSIE</name>
                     <description>LSE clock security system interrupt               enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LSECSSIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PLLRDYIE</name>
                     <description>PLL ready interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PLLRDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HSERDYIE</name>
                     <description>HSE32 ready interrupt               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HSERDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HSIRDYIE</name>
                     <description>HSI16 ready interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HSIRDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MSIRDYIE</name>
                     <description>MSI ready interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MSIRDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSERDYIE</name>
                     <description>LSE ready interrupt enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LSERDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSIRDYIE</name>
                     <description>LSI ready interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LSIRDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CIFR</name>
               <displayName>CIFR</displayName>
               <description>Clock interrupt flag register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSECSSF</name>
                     <description>LSE Clock security system interrupt               flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LSECSSF</name><usage>read-write</usage><enumeratedValue><name>NotInterrupted</name><description>Not interrupted</description><value>0</value></enumeratedValue><enumeratedValue><name>Interrupted</name><description>Interrupted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CSSF</name>
                     <description>HSE32 Clock security system interrupt               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CSSF</name><usage>read-write</usage><enumeratedValue><name>NotInterrupted</name><description>Not interrupted</description><value>0</value></enumeratedValue><enumeratedValue><name>Interrupted</name><description>Interrupted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PLLRDYF</name>
                     <description>PLL ready interrupt flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PLLRDYF</name><usage>read-write</usage><enumeratedValue><name>NotInterrupted</name><description>Not interrupted</description><value>0</value></enumeratedValue><enumeratedValue><name>Interrupted</name><description>Interrupted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HSERDYF</name>
                     <description>HSE32 ready interrupt flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HSERDYF</name><usage>read-write</usage><enumeratedValue><name>NotInterrupted</name><description>Not interrupted</description><value>0</value></enumeratedValue><enumeratedValue><name>Interrupted</name><description>Interrupted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HSIRDYF</name>
                     <description>HSI16 ready interrupt flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HSIRDYF</name><usage>read-write</usage><enumeratedValue><name>NotInterrupted</name><description>Not interrupted</description><value>0</value></enumeratedValue><enumeratedValue><name>Interrupted</name><description>Interrupted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MSIRDYF</name>
                     <description>MSI ready interrupt flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MSIRDYF</name><usage>read-write</usage><enumeratedValue><name>NotInterrupted</name><description>Not interrupted</description><value>0</value></enumeratedValue><enumeratedValue><name>Interrupted</name><description>Interrupted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSERDYF</name>
                     <description>LSE ready interrupt flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LSERDYF</name><usage>read-write</usage><enumeratedValue><name>NotInterrupted</name><description>Not interrupted</description><value>0</value></enumeratedValue><enumeratedValue><name>Interrupted</name><description>Interrupted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSIRDYF</name>
                     <description>LSI ready interrupt flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LSIRDYF</name><usage>read-write</usage><enumeratedValue><name>NotInterrupted</name><description>Not interrupted</description><value>0</value></enumeratedValue><enumeratedValue><name>Interrupted</name><description>Interrupted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CICR</name>
               <displayName>CICR</displayName>
               <description>Clock interrupt clear register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSECSSC</name>
                     <description>LSE Clock security system interrupt               clear</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LSECSSC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CSSC</name>
                     <description>HSE32 Clock security system interrupt               clear</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CSSC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PLLRDYC</name>
                     <description>PLL ready interrupt clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PLLRDYC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HSERDYC</name>
                     <description>HSE32 ready interrupt               clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HSERDYC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HSIRDYC</name>
                     <description>HSI16 ready interrupt               clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>HSIRDYC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MSIRDYC</name>
                     <description>MSI ready interrupt clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MSIRDYC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSERDYC</name>
                     <description>LSE ready interrupt clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LSERDYC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSIRDYC</name>
                     <description>LSI ready interrupt clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LSIRDYC</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>AHB1RSTR</name>
               <displayName>AHB1RSTR</displayName>
               <description>AHB1 peripheral reset register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000000</resetValue>
               <fields>
                  <field>
                     <name>CRCRST</name>
                     <description>CRC reset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="DMA1RST"/>
            </field>
                  <field>
                     <name>DMAMUX1RST</name>
                     <description>DMAMUX1 reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="DMA1RST"/>
            </field>
                  <field>
                     <name>DMA2RST</name>
                     <description>DMA2 reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="DMA1RST"/>
            </field>
                  <field>
                     <name>DMA1RST</name>
                     <description>DMA1 reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DMA1RST</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No effect</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset peripheral</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>AHB2RSTR</name>
               <displayName>AHB2RSTR</displayName>
               <description>AHB2 peripheral reset register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000000</resetValue>
               <fields>
                  <field>
                     <name>GPIOHRST</name>
                     <description>IO port H reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GPIOARST"/>
            </field>
                  <field>
                     <name>GPIOCRST</name>
                     <description>IO port C reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GPIOARST"/>
            </field>
                  <field>
                     <name>GPIOBRST</name>
                     <description>IO port B reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GPIOARST"/>
            </field>
                  <field>
                     <name>GPIOARST</name>
                     <description>IO port A reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GPIOARST</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No effect</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset peripheral</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>AHB3RSTR</name>
               <displayName>AHB3RSTR</displayName>
               <description>AHB3 peripheral reset register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000000</resetValue>
               <fields>
                  <field>
                     <name>FLASHRST</name>
                     <description>Flash interface reset</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PKARST"/>
            </field>
                  <field>
                     <name>HSEMRST</name>
                     <description>HSEMRST</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PKARST"/>
            </field>
                  <field>
                     <name>RNGRST</name>
                     <description>RNGRST</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PKARST"/>
            </field>
                  <field>
                     <name>AESRST</name>
                     <description>AESRST</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PKARST"/>
            </field>
                  <field>
                     <name>PKARST</name>
                     <description>PKARST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PKARST</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No effect</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset peripheral</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>APB1RSTR1</name>
               <displayName>APB1RSTR1</displayName>
               <description>APB1 peripheral reset register           1</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1RST</name>
                     <description>Low Power Timer 1 reset</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TIM2RST"/>
            </field>
                  <field>
                     <name>DACRST</name>
                     <description>DAC reset</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TIM2RST"/>
            </field>
                  <field>
                     <name>I2C3RST</name>
                     <description>I2C3 reset</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TIM2RST"/>
            </field>
                  <field>
                     <name>I2C2RST</name>
                     <description>I2C2 reset</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TIM2RST"/>
            </field>
                  <field>
                     <name>I2C1RST</name>
                     <description>I2C1 reset</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TIM2RST"/>
            </field>
                  <field>
                     <name>USART2RST</name>
                     <description>USART2 reset</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TIM2RST"/>
            </field>
                  <field>
                     <name>SPI2S2RST</name>
                     <description>SPI2S2 reset</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TIM2RST"/>
            </field>
                  <field>
                     <name>TIM2RST</name>
                     <description>TIM2 timer reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TIM2RST</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No effect</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset peripheral</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
