tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>APB1RSTR2</name>
               <displayName>APB1RSTR2</displayName>
               <description>APB1 peripheral reset register           2</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000000</resetValue>
               <fields>
                  <field>
                     <name>LPTIM3RST</name>
                     <description>Low-power timer 3 reset</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="LPUART1RST"/>
            </field>
                  <field>
                     <name>LPTIM2RST</name>
                     <description>Low-power timer 2 reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="LPUART1RST"/>
            </field>
                  <field>
                     <name>LPUART1RST</name>
                     <description>Low-power UART 1 reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LPUART1RST</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No effect</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset peripheral</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>APB2RSTR</name>
               <displayName>APB2RSTR</displayName>
               <description>APB2 peripheral reset register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000000</resetValue>
               <fields>
                  <field>
                     <name>TIM17RST</name>
                     <description>TIM17 timer reset</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM16RST</name>
                     <description>TIM16 timer reset</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1RST</name>
                     <description>USART1 reset</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI1RST</name>
                     <description>SPI1 reset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM1RST</name>
                     <description>TIM1 timer reset</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCRST</name>
                     <description>ADC reset</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB3RSTR</name>
               <displayName>APB3RSTR</displayName>
               <description>APB3 peripheral reset register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000000</resetValue>
               <fields>
                  <field>
                     <name>SUBGHZSPIRST</name>
                     <description>Sub-GHz radio SPI reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHB1ENR</name>
               <displayName>AHB1ENR</displayName>
               <description>AHB1 peripheral clock enable           register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCEN</name>
                     <description>CPU1 CRC clock enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
                  <field>
                     <name>DMAMUX1EN</name>
                     <description>CPU1 DMAMUX1 clock enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
                  <field>
                     <name>DMA2EN</name>
                     <description>CPU1 DMA2 clock enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="DMA1EN"/>
            </field>
                  <field>
                     <name>DMA1EN</name>
                     <description>CPU1 DMA1 clock enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DMA1EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Clock disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Clock enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>AHB2ENR</name>
               <displayName>AHB2ENR</displayName>
               <description>AHB2 peripheral clock enable           register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GPIOHEN</name>
                     <description>CPU1 IO port H clock               enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GPIOAEN"/>
            </field>
                  <field>
                     <name>GPIOCEN</name>
                     <description>CPU1 IO port C clock               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GPIOAEN"/>
            </field>
                  <field>
                     <name>GPIOBEN</name>
                     <description>CPU1 IO port B clock               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="GPIOAEN"/>
            </field>
                  <field>
                     <name>GPIOAEN</name>
                     <description>CPU1 IO port A clock               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GPIOAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Clock disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Clock enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>AHB3ENR</name>
               <displayName>AHB3ENR</displayName>
               <description>AHB3 peripheral clock enable           register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02080000</resetValue>
               <fields>
                  <field>
                     <name>FLASHEN</name>
                     <description>CPU1 Flash interface clock               enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PKAEN"/>
            </field>
                  <field>
                     <name>HSEMEN</name>
                     <description>HSEMEN</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PKAEN"/>
            </field>
                  <field>
                     <name>RNGEN</name>
                     <description>RNGEN</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PKAEN"/>
            </field>
                  <field>
                     <name>AESEN</name>
                     <description>AESEN</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="PKAEN"/>
            </field>
                  <field>
                     <name>PKAEN</name>
                     <description>PKAEN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PKAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Clock disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Clock enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>APB1ENR1</name>
               <displayName>APB1ENR1</displayName>
               <description>APB1 peripheral clock enable register           1</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1EN</name>
                     <description>CPU1 Low power timer 1 clocks               enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues derivedFrom="TIM2EN"/>
            </field>
                  <field>
                     <name>DAC1EN</name>
                     <description>CPU1 DAC1 clock enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues derivedFrom="TIM2EN"/>
            </field>
                  <field>
                     <name>I2C3EN</name>
                     <description>CPU1 I2C3 clocks enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues derivedFrom="TIM2EN"/>
            </field>
                  <field>
                     <name>I2C2EN</name>
                     <description>CPU1 I2C2 clocks enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues derivedFrom="TIM2EN"/>
            </field>
                  <field>
                     <name>I2C1EN</name>
                     <description>CPU1 I2C1 clocks enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues derivedFrom="TIM2EN"/>
            </field>
                  <field>
                     <name>USART2EN</name>
                     <description>CPU1 USART2 clock enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues derivedFrom="TIM2EN"/>
            </field>
                  <field>
                     <name>SPI2S2EN</name>
                     <description>CPU1 SPI2S2 clock enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues derivedFrom="TIM2EN"/>
            </field>
                  <field>
                     <name>WWDGEN</name>
                     <description>CPU1 Window watchdog clock               enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues derivedFrom="TIM2EN"/>
            </field>
                  <field>
                     <name>RTCAPBEN</name>
                     <description>CPU1 RTC APB clock enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues derivedFrom="TIM2EN"/>
            </field>
                  <field>
                     <name>TIM2EN</name>
                     <description>CPU1 TIM2 timer clock               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>TIM2EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Clock disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Clock enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>APB1ENR2</name>
               <displayName>APB1ENR2</displayName>
               <description>APB1 peripheral clock enable register           2</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000000</resetValue>
               <fields>
                  <field>
                     <name>LPTIM3EN</name>
                     <description>CPU1 Low power timer 3 clocks               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="LPUART1EN"/>
            </field>
                  <field>
                     <name>LPTIM2EN</name>
                     <description>CPU1 Low power timer 2 clocks               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="LPUART1EN"/>
            </field>
                  <field>
                     <name>LPUART1EN</name>
                     <description>CPU1 Low power UART 1 clocks               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LPUART1EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Clock disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Clock enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>APB2ENR</name>
               <displayName>APB2ENR</displayName>
               <description>APB2 peripheral clock enable           register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIM17EN</name>
                     <description>CPU1 TIM17 timer clock               enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ADCEN"/>
            </field>
                  <field>
                     <name>TIM16EN</name>
                     <description>CPU1 TIM16 timer clock               enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ADCEN"/>
            </field>
                  <field>
                     <name>USART1EN</name>
                     <description>CPU1 USART1clocks enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ADCEN"/>
            </field>
                  <field>
                     <name>SPI1EN</name>
                     <description>CPU1 SPI1 clock enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ADCEN"/>
            </field>
                  <field>
                     <name>TIM1EN</name>
                     <description>CPU1 TIM1 timer clock               enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ADCEN"/>
            </field>
                  <field>
                     <name>ADCEN</name>
                     <description>CPU1 ADC clocks enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ADCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Clock disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Clock enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>APB3ENR</name>
               <displayName>APB3ENR</displayName>
               <description>APB3 peripheral clock enable           register</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000000</resetValue>
               <fields>
                  <field>
                     <name>SUBGHZSPIEN</name>
                     <description>sub-GHz radio SPI clock enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SUBGHZSPIEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Clock disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Clock enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>AHB1SMENR</name>
               <displayName>AHB1SMENR</displayName>
               <description>AHB1 peripheral clocks enable in Sleep modes           register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00001007</resetValue>
               <fields>
                  <field>
                     <name>CRCSMEN</name>
                     <description>CRC clock enable during CPU1 CSleep               mode.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAMUX1SMEN</name>
                     <description>DMAMUX1 clock enable during CPU1 CSleep               mode.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2SMEN</name>
                     <description>DMA2 clock enable during CPU1 CSleep               mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1SMEN</name>
                     <description>DMA1 clock enable during CPU1 CSleep               mode.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHB2SMENR</name>
               <displayName>AHB2SMENR</displayName>
               <description>AHB2 peripheral clocks enable in Sleep modes           register</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000087</resetValue>
               <fields>
                  <field>
                     <name>GPIOHSMEN</name>
                     <description>IO port H clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOCSMEN</name>
                     <description>IO port C clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOBSMEN</name>
                     <description>IO port B clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOASMEN</name>
                     <description>IO port A clock enable during CPU1               CSleep mode.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
