tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>BDCR</name>
               <displayName>BDCR</displayName>
               <description>Backup domain control register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSCOSEL</name>
                     <description>Low speed clock output               selection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LSCOSEL</name><usage>read-write</usage><enumeratedValue><name>LSI</name><description>LSI clock selected</description><value>0</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE clock selected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSCOEN</name>
                     <description>Low speed clock output               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LSCOEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>LSCO disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>LSCO enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BDRST</name>
                     <description>Backup domain software               reset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>BDRST</name><usage>read-write</usage><enumeratedValue><name>NotActive</name><description>Reset not activated</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Entire Backup domain reset</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RTCEN</name>
                     <description>RTC clock enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>RTCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>RTC kernel clock disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>RTC kernel clock enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSESYSRDY</name>
                     <description>LSE system clock ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>LSESYSRDY</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>LSE system clock not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>LSE system clock ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RTCSEL</name>
                     <description>RTC clock source selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>RTCSEL</name><usage>read-write</usage><enumeratedValue><name>NoClock</name><description>No clock</description><value>0</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE oscillator clock selected</description><value>1</value></enumeratedValue><enumeratedValue><name>LSI</name><description>LSI oscillator clock selected</description><value>2</value></enumeratedValue><enumeratedValue><name>HSE32</name><description>HSE32 oscillator clock divided by 32 selected</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSESYSEN</name>
                     <description>LSE system clock enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LSESYSEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>LSE system clock disabled to USARTx, LPUARTx, LPTIMx, TIMx, RNG, system LSCO, MCO, MSI PLL mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>LSE system clock enabled to USARTx, LPUARTx, LPTIMx, TIMx, RNG, system LSCO, MCO, MSI PLL mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSECSSD</name>
                     <description>CSS on LSE failure               Detection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>LSECSSD</name><usage>read-write</usage><enumeratedValue><name>NoFailure</name><description>No failure detected on LSE</description><value>0</value></enumeratedValue><enumeratedValue><name>Failure</name><description>Failure detected on LSE</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSECSSON</name>
                     <description>CSS on LSE enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LSECSSON</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CSS on LSE disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CSS on LSE enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSEDRV</name>
                     <description>LSE oscillator drive               capability</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LSEDRV</name><usage>read-write</usage><enumeratedValue><name>Low</name><description>Xtal mode lower driving capability</description><value>0</value></enumeratedValue><enumeratedValue><name>MedLow</name><description>Xtal mode medium-low driving capability</description><value>1</value></enumeratedValue><enumeratedValue><name>MedHigh</name><description>Xtal mode medium-high driving capability</description><value>2</value></enumeratedValue><enumeratedValue><name>High</name><description>Xtal mode higher driving capability</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSEBYP</name>
                     <description>LSE oscillator bypass</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LSEBYP</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>LSE oscillator not bypassed</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>LSE oscillator bypassed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSERDY</name>
                     <description>LSE oscillator ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>LSERDY</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>LSE oscillator not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>LSE oscillator ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSEON</name>
                     <description>LSE oscillator enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LSEON</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>LSE oscillator off</description><value>0</value></enumeratedValue><enumeratedValue><name>On</name><description>LSE oscillator on</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>Control/status register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <resetValue>0x0C01C600</resetValue>
               <fields>
                  <field>
                     <name>LPWRRSTF</name>
                     <description>Low-power reset flag</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>LPWRRSTF</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No reset occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WWDGRSTF</name>
                     <description>Window watchdog reset flag</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>WWDGRSTF</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No reset occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>IWDGRSTF</name>
                     <description>Independent window watchdog reset               flag</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>IWDGRSTF</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No reset occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SFTRSTF</name>
                     <description>Software reset flag</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>SFTRSTF</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No reset occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BORRSTF</name>
                     <description>BOR flag</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>BORRSTF</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No reset occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PINRSTF</name>
                     <description>Pin reset flag</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>PINRSTF</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No reset occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OBLRSTF</name>
                     <description>Option byte loader reset               flag</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>OBLRSTF</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>No reset occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Reset occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RFILARSTF</name>
                     <description>Radio illegal access flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>RFILARSTF</name><usage>read-write</usage><enumeratedValue><name>NoIllegalCommand</name><description>No SUBGHZ radio illegal command occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>IllegalCommand</name><description>SUBGHZ radio illegal command occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RMVF</name>
                     <description>Remove reset flag</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>RMVF</name><usage>read-write</usage><enumeratedValue><name>NoEffect</name><description>No effect</description><value>0</value></enumeratedValue><enumeratedValue><name>Clear</name><description>Reset flags reset</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RFRST</name>
                     <description>Radio reset</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>RFRST</name><usage>read-write</usage><enumeratedValue><name>Removed</name><description>Sub-GHz radio software reset removed</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Sub-GHz radio software reset active</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RFRSTF</name>
                     <description>Radio in reset status flag</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>RFRSTF</name><usage>read-write</usage><enumeratedValue><name>NoReset</name><description>Sub-GHz radio out of reset</description><value>0</value></enumeratedValue><enumeratedValue><name>Reset</name><description>Sub-GHz radio in reset</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MSISRANGE</name>
                     <description>MSI clock ranges</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>MSISRANGE</name><usage>read-write</usage><enumeratedValue><name>f_1MHz</name><description>Range 4 around 1 MHz</description><value>4</value></enumeratedValue><enumeratedValue><name>f_2MHz</name><description>Range 5 around 2 MHz</description><value>5</value></enumeratedValue><enumeratedValue><name>f_4MHz</name><description>Range 6 around 4 MHz (reset value)</description><value>6</value></enumeratedValue><enumeratedValue><name>f_8MHz</name><description>Range 7 around 8 MHz</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
				  <field>
                     <name>LSIPRE</name>
                     <description>LSI frequency prescaler</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LSIPRE</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>LSI clock not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div128</name><description>LSI clock divided by 128</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSIRDY</name>
                     <description>LSI oscillator ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>LSIRDY</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>LSI oscillator not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>LSI oscillator ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSION</name>
                     <description>LSI oscillator enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>LSION</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>LSI oscillator off</description><value>0</value></enumeratedValue><enumeratedValue><name>On</name><description>LSI oscillator on</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>                  
               </fields>
            </register>
            <register>
               <name>EXTCFGR</name>
               <displayName>EXTCFGR</displayName>
               <description>Extended clock recovery           register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <resetValue>0x00030000</resetValue>
               <fields>
                  <field>
                     <name>SHDHPREF</name>
                     <description>HCLK3 shared prescaler flag (AHB3,               Flash, and SRAM2)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>SHDHPREF</name><usage>read-write</usage><enumeratedValue><name>NotApplied</name><description>HCLK3 prescaler value not yet applied</description><value>0</value></enumeratedValue><enumeratedValue><name>Applied</name><description>HCLK3 prescaler value applied</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SHDHPRE</name>
                     <description>HCLK3 shared prescaler (AHB3, Flash, and               SRAM2)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>SHDHPRE</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>SYSCLK not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div3</name><description>SYSCLK divided by 3</description><value>1</value></enumeratedValue><enumeratedValue><name>Div5</name><description>SYSCLK divided by 5</description><value>2</value></enumeratedValue><enumeratedValue><name>Div6</name><description>SYSCLK divided by 6</description><value>5</value></enumeratedValue><enumeratedValue><name>Div10</name><description>SYSCLK divided by 10</description><value>6</value></enumeratedValue><enumeratedValue><name>Div32</name><description>SYSCLK divided by 32</description><value>7</value></enumeratedValue><enumeratedValue><name>Div2</name><description>SYSCLK divided by 2</description><value>8</value></enumeratedValue><enumeratedValue><name>Div4</name><description>SYSCLK divided by 4</description><value>9</value></enumeratedValue><enumeratedValue><name>Div8</name><description>SYSCLK divided by 8</description><value>10</value></enumeratedValue><enumeratedValue><name>Div16</name><description>SYSCLK divided by 16</description><value>11</value></enumeratedValue><enumeratedValue><name>Div64</name><description>SYSCLK divided by 64</description><value>12</value></enumeratedValue><enumeratedValue><name>Div128</name><description>SYSCLK divided by 128</description><value>13</value></enumeratedValue><enumeratedValue><name>Div256</name><description>SYSCLK divided by 128</description><value>14</value></enumeratedValue><enumeratedValue><name>Div512</name><description>SYSCLK divided by 512</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>    
