tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RNG</name>
         <description>True random number generator</description>
         <groupName>RNG</groupName>
         <baseAddress>0x58001000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>True_RNG</name>
            <description>True random number generator
        interrupt</description>
            <value>52</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00800000</resetValue>
               <fields>  
                  <field>
                     <name>RNGEN</name>
                     <description>True random number generator               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RNGEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Random number generator is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Random number generator is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>               
                  <field>
                     <name>IE</name>
                     <description>Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>IE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>RNG interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>RNG interrupt is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>   
                  <field>
                    <name>CED</name>
                    <description>Interrupt Enable</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CED</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Clock error detection is enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Clock error detection is disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>				  
                  <field>
                     <name>RNG_CONFIG3</name>
                     <description>RNG_CONFIG3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>RNG_CONFIG3</name><usage>read-write</usage><enumeratedValue><name>ConfigA</name><description>Recommended value for config A (NIST certifiable)</description><value>13</value></enumeratedValue><enumeratedValue><name>ConfigB</name><description>Recommended value for config B (not NIST certifiable)</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>NISTC</name>
                     <description>NISTC</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>NISTC</name><usage>read-write</usage><enumeratedValue><name>Default</name><description>Hardware default values for NIST compliant RNG. In this configuration per 128-bit output two conditioning loops are performed and 256 bits of noise source are used</description><value>0</value></enumeratedValue><enumeratedValue><name>Custom</name><description>Custom values for NIST compliant RNG</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RNG_CONFIG2</name>
                     <description>RNG_CONFIG2</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>RNG_CONFIG2</name><usage>read-write</usage><enumeratedValue><name>ConfigA_B</name><description>Recommended value for config A and B</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CLKDIV</name>
                     <description>CLKDIV</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>CLKDIV</name><usage>read-write</usage><enumeratedValue><name>NoDiv</name><description>Internal RNG clock after divider is similar to incoming RNG clock</description><value>0</value></enumeratedValue><enumeratedValue><name>Div_2_1</name><description>Divide RNG clock by 2^1</description><value>1</value></enumeratedValue><enumeratedValue><name>Div_2_2</name><description>Divide RNG clock by 2^2</description><value>2</value></enumeratedValue><enumeratedValue><name>Div_2_3</name><description>Divide RNG clock by 2^3</description><value>3</value></enumeratedValue><enumeratedValue><name>Div_2_4</name><description>Divide RNG clock by 2^4</description><value>4</value></enumeratedValue><enumeratedValue><name>Div_2_5</name><description>Divide RNG clock by 2^5</description><value>5</value></enumeratedValue><enumeratedValue><name>Div_2_6</name><description>Divide RNG clock by 2^6</description><value>6</value></enumeratedValue><enumeratedValue><name>Div_2_7</name><description>Divide RNG clock by 2^7</description><value>7</value></enumeratedValue><enumeratedValue><name>Div_2_8</name><description>Divide RNG clock by 2^8</description><value>8</value></enumeratedValue><enumeratedValue><name>Div_2_9</name><description>Divide RNG clock by 2^9</description><value>9</value></enumeratedValue><enumeratedValue><name>Div_2_10</name><description>Divide RNG clock by 2^10</description><value>10</value></enumeratedValue><enumeratedValue><name>Div_2_11</name><description>Divide RNG clock by 2^11</description><value>11</value></enumeratedValue><enumeratedValue><name>Div_2_12</name><description>Divide RNG clock by 2^12</description><value>12</value></enumeratedValue><enumeratedValue><name>Div_2_13</name><description>Divide RNG clock by 2^13</description><value>13</value></enumeratedValue><enumeratedValue><name>Div_2_14</name><description>Divide RNG clock by 2^14</description><value>14</value></enumeratedValue><enumeratedValue><name>Div_2_15</name><description>Divide RNG clock by 2^15</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RNG_CONFIG1</name>
                     <description>RNG_CONFIG1</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>6</bitWidth>
                  <enumeratedValues><name>RNG_CONFIG1</name><usage>read-write</usage><enumeratedValue><name>ConfigA</name><description>Recommended value for config A (NIST certifiable)</description><value>15</value></enumeratedValue><enumeratedValue><name>ConfigB</name><description>Recommended value for config B (not NIST certifiable)</description><value>24</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CONDRST</name>
                     <description>Conditioning soft reset</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONFIGLOCK</name>
                     <description>CONFIGLOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CONFIGLOCK</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Writes to the RNG_CR configuration bits [29:4] are allowed</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Writes to the RNG_CR configuration bits [29:4] are ignored until the next RNG reset</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>status register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEIS</name>
                     <description>Seed error interrupt               status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>SEIS</name><usage>read-write</usage><enumeratedValue><name>NoFault</name><description>No faulty sequence detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Fault</name><description>At least one faulty sequence has been detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CEIS</name>
                     <description>Clock error interrupt               status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues derivedFrom="CECS"/>
            </field>
                  <field>
                     <name>SECS</name>
                     <description>Seed error current status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>SECS</name><usage>read-write</usage><enumeratedValue><name>NoFault</name><description>No faulty sequence has currently been detected. If the SEIS bit is set, this means that a faulty sequence was detected and the situation has been recovered</description><value>0</value></enumeratedValue><enumeratedValue><name>Fault</name><description>At least one faulty sequence has been detected - see ref manual for details</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CECS</name>
                     <description>Clock error current status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>CECS</name><usage>read-write</usage><enumeratedValue><name>Correct</name><description>The RNG clock is correct (fRNGCLK&gt; fHCLK/32)</description><value>0</value></enumeratedValue><enumeratedValue><name>Slow</name><description>The RNG clock before internal divider has been detected too slow (fRNGCLK&lt; fHCLK/32)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DRDY</name>
                     <description>Data Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>DRDY</name><usage>read-write</usage><enumeratedValue><name>Invalid</name><description>The RNG_DR register is not yet valid, no random data is available</description><value>0</value></enumeratedValue><enumeratedValue><name>Valid</name><description>The RNG_DR register contains valid random data</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>DR</name>
               <displayName>DR</displayName>
               <description>data register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RNDATA</name>
                     <description>Random data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
			<register>
               <name>HTCR</name>
               <displayName>HTCR</displayName>
               <description>health test control register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00005A4E</resetValue>
               <fields>
                  <field>
                     <name>HTCFG</name>
                     <description>health test configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <enumeratedValues><name>HTCFG</name><usage>read-write</usage><enumeratedValue><name>Magic</name><description>Magic number to be written before any write (0x1759_0ABC)</description><value>391711420</value></enumeratedValue><enumeratedValue><name>Recommended</name><description>Recommended value for RNG certification (0x0000_AA74)</description><value>43636</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>         
