tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
          <name>RTC</name>
          <description>Real-time clock</description>
          <groupName>RTC</groupName>
          <baseAddress>0x40002800</baseAddress>
          <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
          </addressBlock>
          <interrupt>
            <name>TAMP_RTCSTAMP_LSECSS_RTCSSRU</name>
            <description>Tamper, TimeStamp, LSECSS,RTC_SSRU interrupt</description>
            <value>2</value>
          </interrupt>
		  <interrupt>
			<name>RTC_WKUP</name>
			<description>RTC wakeup interrupt</description>
			<value>3</value>
		  </interrupt>
		  <interrupt>
			<name>RTC_ALARM</name>
			<description>RTC alarms A and B interrupt</description>
			<value>42</value>
		  </interrupt>
		  <registers>
			<register>
			  <name>TR</name>
			  <displayName>TR</displayName>
			  <description>Time register</description>
			  <addressOffset>0x0</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>PM</name>
				  <description>AM/PM notation</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>PM</name><usage>read-write</usage><enumeratedValue><name>AM</name><description>AM or 24-hour format</description><value>0</value></enumeratedValue><enumeratedValue><name>PM</name><description>PM</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HT</name>
				  <description>Hour tens in BCD format</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>HU</name>
				  <description>Hour units in BCD format</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MNT</name>
				  <description>Minute tens in BCD format</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MNU</name>
				  <description>Minute units in BCD format</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>ST</name>
				  <description>Second tens in BCD format</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>SU</name>
				  <description>Second units in BCD format</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>DR</name>
			  <displayName>DR</displayName>
			  <description>Date register</description>
			  <addressOffset>0x4</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00002101</resetValue>
			  <fields>
				<field>
				  <name>YT</name>
				  <description>Year tens in BCD format</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>YU</name>
				  <description>Year units in BCD format</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>WDU</name>
				  <description>Week day units</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>3</bitWidth>
				<writeConstraint><range><minimum>1</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MT</name>
				  <description>Month tens in BCD format</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>1</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MU</name>
				  <description>Month units in BCD format</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>DT</name>
				  <description>Date tens in BCD format</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>2</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>DU</name>
				  <description>Date units in BCD format</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>SSR</name>
			  <displayName>SSR</displayName>
			  <description>Sub second register</description>
			  <addressOffset>0x8</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SS</name>
				  <description>Synchronous binary counter</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>ICSR</name>
			  <displayName>ICSR</displayName>
			  <description>Initialization control and status register</description>
			  <addressOffset>0xC</addressOffset>
			  <size>0x20</size>
			  <resetValue>0x00000007</resetValue>
			   <fields>
					  <field>
						 <name>RECALPF</name>
						 <description>Recalibration pending Flag</description>
						 <bitOffset>16</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-only</access>
					  <enumeratedValues><name>RECALPFR</name><usage>read</usage><enumeratedValue><name>Pending</name><description>The RECALPF status flag is automatically set to 1 when software writes to the RTC_CALR register, indicating that the RTC_CALR register is blocked. When the new calibration settings are taken into account, this bit returns to 0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
					  <field>
						 <name>BCDU</name>
						 <description>BCD update</description>
						 <bitOffset>10</bitOffset>
						 <bitWidth>3</bitWidth>
						 <access>read-write</access>
					  <enumeratedValues><name>BCDU</name><usage>read-write</usage><enumeratedValue><name>Bit7</name><description>1s increment each time SS[7:0]=0</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit8</name><description>1s increment each time SS[8:0]=0</description><value>1</value></enumeratedValue><enumeratedValue><name>Bit9</name><description>1s increment each time SS[9:0]=0</description><value>2</value></enumeratedValue><enumeratedValue><name>Bit10</name><description>1s increment each time SS[10:0]=0</description><value>3</value></enumeratedValue><enumeratedValue><name>Bit11</name><description>1s increment each time SS[11:0]=0</description><value>4</value></enumeratedValue><enumeratedValue><name>Bit12</name><description>1s increment each time SS[12:0]=0</description><value>5</value></enumeratedValue><enumeratedValue><name>Bit13</name><description>1s increment each time SS[13:0]=0</description><value>6</value></enumeratedValue><enumeratedValue><name>Bit14</name><description>1s increment each time SS[14:0]=0</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
					  <field>
						 <name>BIN</name>
						 <description>Binary mode</description>
						 <bitOffset>8</bitOffset>
						 <bitWidth>2</bitWidth>
						 <access>read-write</access>
					  <enumeratedValues><name>BIN</name><usage>read-write</usage><enumeratedValue><name>BCD</name><description>Free running BCD calendar mode (Binary mode disabled)</description><value>0</value></enumeratedValue><enumeratedValue><name>Binary</name><description>Free running Binary mode (BCD mode disabled)</description><value>1</value></enumeratedValue><enumeratedValue><name>BinBCD</name><description>Free running BCD calendar and Binary modes</description><value>2</value></enumeratedValue><enumeratedValue><name>BinBCD2</name><description>Free running BCD calendar and Binary modes</description><value>3</value></enumeratedValue></enumeratedValues>
            </field> 
					  <field>
						 <name>INIT</name>
						 <description>Initialization mode</description>
						 <bitOffset>7</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-write</access>
					  <enumeratedValues><name>INIT</name><usage>read-write</usage><enumeratedValue><name>FreeRunningMode</name><description>Free running mode</description><value>0</value></enumeratedValue><enumeratedValue><name>InitMode</name><description>Initialization mode used to program time and date register (RTC_TR and RTC_DR), and prescaler register (RTC_PRER). Counters are stopped and start counting from the new value when INIT is reset.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
					  <field>
						 <name>INITF</name>
						 <description>Initialization flag</description>
						 <bitOffset>6</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-only</access>
					  <enumeratedValues><name>INITFR</name><usage>read</usage><enumeratedValue><name>NotAllowed</name><description>Calendar registers update is not allowed</description><value>0</value></enumeratedValue><enumeratedValue><name>Allowed</name><description>Calendar registers update is allowed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
					  <field>
						 <name>RSF</name>
						 <description>Registers synchronization               flag</description>
						 <bitOffset>5</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-write</access>
					  <enumeratedValues><name>RSFR</name><usage>read</usage><enumeratedValue><name>NotSynced</name><description>Calendar shadow registers not yet synchronized</description><value>0</value></enumeratedValue><enumeratedValue><name>Synced</name><description>Calendar shadow registers synchronized</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>RSFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>This flag is cleared by software by writing 0</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
					  <field>
						 <name>INITS</name>
						 <description>Initialization status flag</description>
						 <bitOffset>4</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-only</access>
					  <enumeratedValues><name>INITSR</name><usage>read</usage><enumeratedValue><name>NotInitalized</name><description>Calendar has not been initialized</description><value>0</value></enumeratedValue><enumeratedValue><name>Initalized</name><description>Calendar has been initialized</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
					  <field>
						 <name>SHPF</name>
						 <description>Shift operation pending</description>
						 <bitOffset>3</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-only</access>
					  <enumeratedValues><name>SHPFR</name><usage>read</usage><enumeratedValue><name>NoShiftPending</name><description>No shift operation is pending</description><value>0</value></enumeratedValue><enumeratedValue><name>ShiftPending</name><description>A shift operation is pending</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
					  <field>
						 <name>WUTWF</name>
						 <description>Wakeup timer write flag</description>
						 <bitOffset>2</bitOffset>
						 <bitWidth>1</bitWidth>
						 <access>read-only</access>
					  <enumeratedValues><name>WUTWFR</name><usage>read</usage><enumeratedValue><name>UpdateNotAllowed</name><description>Wakeup timer configuration update not allowed</description><value>0</value></enumeratedValue><enumeratedValue><name>UpdateAllowed</name><description>Wakeup timer configuration update allowed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>                               
				   </fields>
			</register>
			<register>
			  <name>PRER</name>
			  <displayName>PRER</displayName>
			  <description>Pre-scaler register</description>
			  <addressOffset>0x10</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x007F00FF</resetValue>
			  <fields>
				<field>
				  <name>PREDIV_A</name>
				  <description>Asynchronous prescaler               factor</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>7</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>PREDIV_S</name>
				  <description>Synchronous prescaler               factor</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>15</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>32767</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>WUTR</name>
			  <displayName>WUTR</displayName>
			  <description>Wakeup timer register</description>
			  <addressOffset>0x14</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x0000FFFF</resetValue>
			  <fields>
				<field>
				  <name>WUTOCLR</name>
				  <description>Wakeup auto-reload output clear value</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>16</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>WUT</name>
				  <description>Wakeup auto-reload value               bits</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
