tinygo-org/stm32-svd/svd/stm32wle5.svd
			<register>
			  <name>CR</name>
			  <displayName>CR</displayName>
			  <description>Control register</description>
			  <addressOffset>0x18</addressOffset>
			  <size>0x20</size>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>OUT2EN</name>
				  <description>RTC_OUT2 output enable</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>OUT2EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>RTC output 2 disable</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>RTC output 2 enable</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TAMPALRM_TYPE</name>
				  <description>TAMPALRM output type</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>TAMPALRM_TYPE</name><usage>read-write</usage><enumeratedValue><name>PushPull</name><description>TAMPALRM is push-pull output</description><value>0</value></enumeratedValue><enumeratedValue><name>OpenDrain</name><description>TAMPALRM is open-drain output</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TAMPALRM_PU</name>
				  <description>TAMPALRM pull-up enable</description>
				  <bitOffset>29</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>TAMPALRM_PU</name><usage>read-write</usage><enumeratedValue><name>NoPullUp</name><description>No pull-up is applied on TAMPALRM output</description><value>0</value></enumeratedValue><enumeratedValue><name>PullUp</name><description>A pull-up is applied on TAMPALRM output</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TAMPOE</name>
				  <description>Tamper detection output enable on               TAMPALRM</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>TAMPOE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>The tamper flag is not routed on TAMPALRM</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>The tamper flag is routed on TAMPALRM, combined with the signal provided by OSEL and with the polarity provided by POL</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TAMPTS</name>
				  <description>Activate timestamp on tamper detection               event</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>TAMPTS</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Tamper detection event does not cause a RTC timestamp to be saved</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Save RTC timestamp on tamper detection event</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ITSE</name>
				  <description>timestamp on internal event               enable</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>ITSE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Internal event timestamp disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Internal event timestamp enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>COE</name>
				  <description>Calibration output enable</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>COE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Calibration output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Calibration output enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>OSEL</name>
				  <description>Output selection</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>OSEL</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>AlarmA</name><description>Alarm A output enabled</description><value>1</value></enumeratedValue><enumeratedValue><name>AlarmB</name><description>Alarm B output enabled</description><value>2</value></enumeratedValue><enumeratedValue><name>Wakeup</name><description>Wakeup output enabled</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>POL</name>
				  <description>Output polarity</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>POL</name><usage>read-write</usage><enumeratedValue><name>High</name><description>The pin is high when ALRAF/ALRBF/WUTF is asserted (depending on OSEL[1:0])</description><value>0</value></enumeratedValue><enumeratedValue><name>Low</name><description>The pin is low when ALRAF/ALRBF/WUTF is asserted (depending on OSEL[1:0])</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>COSEL</name>
				  <description>Calibration output               selection</description>
				  <bitOffset>19</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>COSEL</name><usage>read-write</usage><enumeratedValue><name>CalFreq_512Hz</name><description>Calibration output is 512 Hz (with default prescaler setting)</description><value>0</value></enumeratedValue><enumeratedValue><name>CalFreq_1Hz</name><description>Calibration output is 1 Hz (with default prescaler setting)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>BKP</name>
				  <description>Backup</description>
				  <bitOffset>18</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>BKP</name><usage>read-write</usage><enumeratedValue><name>DSTNotChanged</name><description>Daylight Saving Time change has not been performed</description><value>0</value></enumeratedValue><enumeratedValue><name>DSTChanged</name><description>Daylight Saving Time change has been performed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>SUB1H</name>
				  <description>Subtract 1 hour (winter time               change)</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				<enumeratedValues><name>SUB1HW</name><usage>write</usage><enumeratedValue><name>Sub1</name><description>Subtracts 1 hour to the current time. This can be used for winter time change outside initialization mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ADD1H</name>
				  <description>Add 1 hour (summer time               change)</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				<enumeratedValues><name>ADD1HW</name><usage>write</usage><enumeratedValue><name>Add1</name><description>Adds 1 hour to the current time. This can be used for summer time change outside initialization mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TSIE</name>
				  <description>Timestamp interrupt enable</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>TSIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Time-stamp Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Time-stamp Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>WUTIE</name>
				  <description>Wakeup timer interrupt               enable</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>WUTIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wakeup timer interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wakeup timer interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ALRBIE</name>
				  <description>Alarm B interrupt enable</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>ALRBIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Alarm B Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Alarm B Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ALRAIE</name>
				  <description>Alarm A interrupt enable</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>ALRAIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Alarm A interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Alarm A interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TSE</name>
				  <description>timestamp enable</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>TSE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Timestamp disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Timestamp enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>WUTE</name>
				  <description>Wakeup timer enable</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>WUTE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wakeup timer disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wakeup timer enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ALRBE</name>
				  <description>Alarm B enable</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>ALRBE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Alarm B disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Alarm B enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ALRAE</name>
				  <description>Alarm A enable</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>ALRAE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Alarm A disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Alarm A enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>SSRUIE</name>
				  <description>SSR underflow interrupt enable</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>SSRUIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SSR underflow interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SSR underflow interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>FMT</name>
				  <description>Hour format</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>FMT</name><usage>read-write</usage><enumeratedValue><name>TwentyFourHour</name><description>24 hour/day format</description><value>0</value></enumeratedValue><enumeratedValue><name>AmPm</name><description>AM/PM hour format</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>BYPSHAD</name>
				  <description>Bypass the shadow               registers</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>BYPSHAD</name><usage>read-write</usage><enumeratedValue><name>ShadowReg</name><description>Calendar values (when reading from RTC_SSR, RTC_TR, and RTC_DR) are taken from the shadow registers, which are updated once every two RTCCLK cycles</description><value>0</value></enumeratedValue><enumeratedValue><name>BypassShadowReg</name><description>Calendar values (when reading from RTC_SSR, RTC_TR, and RTC_DR) are taken directly from the calendar counters</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>REFCKON</name>
				  <description>RTC_REFIN reference clock detection               enable (50 or 60 Hz)</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>REFCKON</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>RTC_REFIN detection disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>RTC_REFIN detection enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TSEDGE</name>
				  <description>Timestamp event active               edge</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>TSEDGE</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>RTC_TS input rising edge generates a time-stamp event</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>RTC_TS input falling edge generates a time-stamp event</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>WUCKSEL</name>
				  <description>Wakeup clock selection</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				<enumeratedValues><name>WUCKSEL</name><usage>read-write</usage><enumeratedValue><name>Div16</name><description>RTC/16 clock is selected</description><value>0</value></enumeratedValue><enumeratedValue><name>Div8</name><description>RTC/8 clock is selected</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>RTC/4 clock is selected</description><value>2</value></enumeratedValue><enumeratedValue><name>Div2</name><description>RTC/2 clock is selected</description><value>3</value></enumeratedValue><enumeratedValue><name>ClockSpare</name><description>ck_spre (usually 1 Hz) clock is selected</description><value>4</value></enumeratedValue><enumeratedValue><name>ClockSpareWithOffset</name><description>ck_spre (usually 1 Hz) clock is selected and 2^16 is added to the WUT counter value</description><value>6</value></enumeratedValue></enumeratedValues>
            </field>
			  </fields>
			</register>
			<register>
			  <name>WPR</name>
			  <displayName>WPR</displayName>
			  <description>Write protection register</description>
			  <addressOffset>0x24</addressOffset>
			  <size>0x20</size>
			  <access>write-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>KEY</name>
				  <description>Write protection key</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>8</bitWidth>
				<enumeratedValues><name>KEY</name><usage>read-write</usage><enumeratedValue><name>Deactivate1</name><description>Key 1</description><value>202</value></enumeratedValue><enumeratedValue><name>Deactivate2</name><description>Key 2</description><value>83</value></enumeratedValue><enumeratedValue><name>Activate</name><description>Activate write protection (any value that is not the keys)</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
			  </fields>
			</register>
			<register>
			  <name>CALR</name>
			  <displayName>CALR</displayName>
			  <description>Calibration register</description>
			  <addressOffset>0x28</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>CALP</name>
				  <description>Use an 8-second calibration cycle               period</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>CALP</name><usage>read-write</usage><enumeratedValue><name>NoChange</name><description>No RTCCLK pulses are added</description><value>0</value></enumeratedValue><enumeratedValue><name>IncreaseFreq</name><description>One RTCCLK pulse is effectively inserted every 2^11 pulses (frequency increased by 488.5 ppm)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>CALW8</name>
				  <description>Use a 16-second calibration cycle               period</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>CALW8</name><usage>read-write</usage><enumeratedValue><name>EightSeconds</name><description>When CALW8 is set to &#8216;1&#8217;, the 8-second calibration cycle period is selected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>CALW16</name>
				  <description>CALW16</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>CALW16</name><usage>read-write</usage><enumeratedValue><name>SixteenSeconds</name><description>When CALW16 is set to &#8216;1&#8217;, the 16-second calibration cycle period is selected.This bit must not be set to &#8216;1&#8217; if CALW8=1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>LPCAL</name>
				  <description>Calibration low-power mode</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>LPCAL</name><usage>read-write</usage><enumeratedValue><name>RTCCLK</name><description>Calibration window is 220 RTCCLK, which is a high-consumption mode. This mode should be set only when less than 32s calibration window is required</description><value>0</value></enumeratedValue><enumeratedValue><name>CkApre</name><description>Calibration window is 220 ck_apre, which is the required configuration for ultra-low consumption mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>CALM</name>
				  <description>Calibration minus</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>9</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>511</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>SHIFTR</name>
			  <displayName>SHIFTR</displayName>
			  <description>Shift control register</description>
			  <addressOffset>0x2C</addressOffset>
			  <size>0x20</size>
			  <access>write-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>ADD1S</name>
				  <description>Add one second</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>ADD1SW</name><usage>write</usage><enumeratedValue><name>Add1</name><description>Add one second to the clock/calendar</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>SUBFS</name>
				  <description>Subtract a fraction of a               second</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>15</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>32767</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>TSTR</name>
			  <displayName>TSTR</displayName>
			  <description>Timestamp time register</description>
			  <addressOffset>0x30</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>PM</name>
				  <description>AM/PM notation</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>HT</name>
				  <description>Hour tens in BCD format.</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>HU</name>
				  <description>Hour units in BCD format.</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>MNT</name>
				  <description>Minute tens in BCD format.</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>MNU</name>
				  <description>Minute units in BCD               format.</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>ST</name>
				  <description>Second tens in BCD format.</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>SU</name>
				  <description>Second units in BCD               format.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TSDR</name>
			  <displayName>TSDR</displayName>
			  <description>Timestamp date register</description>
			  <addressOffset>0x34</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>WDU</name>
				  <description>Week day units</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>3</bitWidth>
				</field>
				<field>
				  <name>MT</name>
				  <description>Month tens in BCD format</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				</field>
				<field>
				  <name>MU</name>
				  <description>Month units in BCD format</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
				<field>
				  <name>DT</name>
				  <description>Date tens in BCD format</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>2</bitWidth>
				</field>
				<field>
				  <name>DU</name>
				  <description>Date units in BCD format</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				</field>
			  </fields>
			</register>
