tinygo-org/stm32-svd/svd/stm32wle5.svd
			<register>
			  <name>TSSSR</name>
			  <displayName>TSSSR</displayName>
			  <description>Timestamp sub second register</description>
			  <addressOffset>0x38</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SS</name>
				  <description>Sub second value</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				</field>
			  </fields>
			</register>
			<register>
			  <name>ALRMAR</name>
			  <displayName>ALRMAR</displayName>
			  <description>Alarm A register</description>
			  <addressOffset>0x40</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>MSK4</name>
				  <description>Alarm A date mask</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="MSK1"/>
            </field>
				<field>
				  <name>WDSEL</name>
				  <description>Week day selection</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>WDSEL</name><usage>read-write</usage><enumeratedValue><name>DateUnits</name><description>DU[3:0] represents the date units</description><value>0</value></enumeratedValue><enumeratedValue><name>WeekDay</name><description>DU[3:0] represents the week day. DT[1:0] is don&#8217;t care.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>DT</name>
				  <description>Date tens in BCD format</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>2</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>DU</name>
				  <description>Date units or day in BCD               format</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MSK3</name>
				  <description>Alarm A hours mask</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="MSK1"/>
            </field>
				<field>
				  <name>PM</name>
				  <description>AM/PM notation</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>PM</name><usage>read-write</usage><enumeratedValue><name>AM</name><description>AM or 24-hour format</description><value>0</value></enumeratedValue><enumeratedValue><name>PM</name><description>PM</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HT</name>
				  <description>Hour tens in BCD format</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>HU</name>
				  <description>Hour units in BCD format</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MSK2</name>
				  <description>Alarm A minutes mask</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="MSK1"/>
            </field>
				<field>
				  <name>MNT</name>
				  <description>Minute tens in BCD format</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MNU</name>
				  <description>Minute units in BCD format</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MSK1</name>
				  <description>Alarm A seconds mask</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>MSK1</name><usage>read-write</usage><enumeratedValue><name>Mask</name><description>Alarm set if the date/day match</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMask</name><description>Date/day don&#8217;t care in Alarm comparison</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ST</name>
				  <description>Second tens in BCD format.</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>SU</name>
				  <description>Second units in BCD               format.</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>ALRMASSR</name>
			  <displayName>ALRMASSR</displayName>
			  <description>Alarm A sub second register</description>
			  <addressOffset>0x44</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SSCLR</name>
				  <description>Clear synchronous counter on alarm (Binary mode only)</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>SSCLR</name><usage>read-write</usage><enumeratedValue><name>FreeRunning</name><description>The synchronous binary counter (SS[31:0] in RTC_SSR) is free-running</description><value>0</value></enumeratedValue><enumeratedValue><name>ALRMBINR</name><description>The synchronous binary counter (SS[31:0] in RTC_SSR) is running from 0xFFFF FFFF to RTC_ALRMABINR &#8594; SS[31:0] value and is automatically reloaded with 0xFFFF FFFF when reaching RTC_ALRMABINR &#8594; SS[31:0]</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>MASKSS</name>
				  <description>Mask the most-significant bits starting               at this bit</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>6</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>SS</name>
				  <description>Sub seconds value</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>15</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>32767</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>ALRMBR</name>
			  <displayName>ALRMBR</displayName>
			  <description>Alarm B register</description>
			  <addressOffset>0x48</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>MSK4</name>
				  <description>Alarm B date mask</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="MSK1"/>
            </field>
				<field>
				  <name>WDSEL</name>
				  <description>Week day selection</description>
				  <bitOffset>30</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>WDSEL</name><usage>read-write</usage><enumeratedValue><name>DateUnits</name><description>DU[3:0] represents the date units</description><value>0</value></enumeratedValue><enumeratedValue><name>WeekDay</name><description>DU[3:0] represents the week day. DT[1:0] is don&#8217;t care.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>DT</name>
				  <description>Date tens in BCD format</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>2</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>DU</name>
				  <description>Date units or day in BCD               format</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MSK3</name>
				  <description>Alarm B hours mask</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="MSK1"/>
            </field>
				<field>
				  <name>PM</name>
				  <description>AM/PM notation</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>PM</name><usage>read-write</usage><enumeratedValue><name>AM</name><description>AM or 24-hour format</description><value>0</value></enumeratedValue><enumeratedValue><name>PM</name><description>PM</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>HT</name>
				  <description>Hour tens in BCD format</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>HU</name>
				  <description>Hour units in BCD format</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MSK2</name>
				  <description>Alarm B minutes mask</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="MSK1"/>
            </field>
				<field>
				  <name>MNT</name>
				  <description>Minute tens in BCD format</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MNU</name>
				  <description>Minute units in BCD format</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>MSK1</name>
				  <description>Alarm B seconds mask</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>MSK1</name><usage>read-write</usage><enumeratedValue><name>Mask</name><description>Alarm set if the date/day match</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMask</name><description>Date/day don&#8217;t care in Alarm comparison</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ST</name>
				  <description>Second tens in BCD format</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>SU</name>
				  <description>Second units in BCD format</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>ALRMBSSR</name>
			  <displayName>ALRMBSSR</displayName>
			  <description>Alarm B sub second register</description>
			  <addressOffset>0x4C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SSCLR</name>
				  <description>Clear synchronous counter on alarm (Binary mode only)</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>SSCLR</name><usage>read-write</usage><enumeratedValue><name>FreeRunning</name><description>The synchronous binary counter (SS[31:0] in RTC_SSR) is free-running</description><value>0</value></enumeratedValue><enumeratedValue><name>ALRMBINR</name><description>The synchronous binary counter (SS[31:0] in RTC_SSR) is running from 0xFFFF FFFF to RTC_ALRMABINR &#8594; SS[31:0] value and is automatically reloaded with 0xFFFF FFFF when reaching RTC_ALRMABINR &#8594; SS[31:0]</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>MASKSS</name>
				  <description>Mask the most-significant bits starting               at this bit</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>6</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
				<field>
				  <name>SS</name>
				  <description>Sub seconds value</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>15</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>32767</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>SR</name>
			  <displayName>SR</displayName>
			  <description>Status register (interrupts)</description>
			  <addressOffset>0x50</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SSRUF</name>
				  <description>SSR underflow flag</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>SSRUF</name><usage>read-write</usage><enumeratedValue><name>Underflow</name><description>This flag is set by hardware when the SSR rolls under 0. SSRUF is not set when SSCLR=1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ITSF</name>
				  <description>Internal timestamp flag</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>ITSF</name><usage>read-write</usage><enumeratedValue><name>TimestampEvent</name><description>This flag is set by hardware when a timestamp on the internal event occurs</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TSOVF</name>
				  <description>Timestamp overflow flag</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>TSOVF</name><usage>read-write</usage><enumeratedValue><name>Overflow</name><description>This flag is set by hardware when a time-stamp event occurs while TSF is already set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TSF</name>
				  <description>Timestamp flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>TSF</name><usage>read-write</usage><enumeratedValue><name>TimestampEvent</name><description>This flag is set by hardware when a time-stamp event occurs</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>WUTF</name>
				  <description>Wakeup timer flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>WUTF</name><usage>read-write</usage><enumeratedValue><name>Zero</name><description>This flag is set by hardware when the wakeup auto-reload counter reaches 0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ALRBF</name>
				  <description>Alarm B flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>ALRBF</name><usage>read-write</usage><enumeratedValue><name>Match</name><description>This flag is set by hardware when the time/date registers (RTC_TR and RTC_DR) match the Alarm B register (RTC_ALRMBR)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ALRAF</name>
				  <description>Alarm A flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>ALRAF</name><usage>read-write</usage><enumeratedValue><name>Match</name><description>This flag is set by hardware when the time/date registers (RTC_TR and RTC_DR) match the Alarm A register (RTC_ALRMAR)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
			  </fields>
			</register>
			<register>
			  <name>MISR</name>
			  <displayName>MISR</displayName>
			  <description>Masked interrupt status register</description>
			  <addressOffset>0x54</addressOffset>
			  <size>0x20</size>
			  <access>read-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SSRUMF</name>
				  <description>SSR underflow masked flag</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>SSRUMF</name><usage>read-write</usage><enumeratedValue><name>Underflow</name><description>This flag is set by hardware when the SSR rolls under 0. SSRUF is not set when SSCLR=1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ITSMF</name>
				  <description>Internal timestamp masked               flag</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>ITSMF</name><usage>read-write</usage><enumeratedValue><name>TimestampEvent</name><description>This flag is set by hardware when a timestamp on the internal event occurs</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TSOVMF</name>
				  <description>Timestamp overflow masked               flag</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>TSOVMF</name><usage>read-write</usage><enumeratedValue><name>Overflow</name><description>This flag is set by hardware when a time-stamp event occurs while TSF is already set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>TSMF</name>
				  <description>Timestamp masked flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>TSMF</name><usage>read-write</usage><enumeratedValue><name>TimestampEvent</name><description>This flag is set by hardware when a time-stamp event occurs</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>WUTMF</name>
				  <description>Wakeup timer masked flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>WUTMF</name><usage>read-write</usage><enumeratedValue><name>Zero</name><description>This flag is set by hardware when the wakeup auto-reload counter reaches 0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ALRBMF</name>
				  <description>Alarm B masked flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>ALRBMF</name><usage>read-write</usage><enumeratedValue><name>Match</name><description>This flag is set by hardware when the time/date registers (RTC_TR and RTC_DR) match the Alarm B register (RTC_ALRMBR)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
				<field>
				  <name>ALRAMF</name>
				  <description>Alarm A masked flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>ALRAMF</name><usage>read-write</usage><enumeratedValue><name>Match</name><description>This flag is set by hardware when the time/date registers (RTC_TR and RTC_DR) match the Alarm A register (RTC_ALRMAR)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
			  </fields>
			</register>
			<register>
			  <name>SCR</name>
			  <displayName>SCR</displayName>
			  <description>Status clear register (interrupts)</description>
			  <addressOffset>0x5C</addressOffset>
			  <size>0x20</size>
			  <access>write-only</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>CSSRUF</name>
				  <description>Clear SSR underflow flag</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="CALRAF"/>
            </field>
				<field>
				  <name>CITSF</name>
				  <description>Clear internal timestamp               flag</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="CALRAF"/>
            </field>
				<field>
				  <name>CTSOVF</name>
				  <description>Clear timestamp overflow               flag</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="CALRAF"/>
            </field>
				<field>
				  <name>CTSF</name>
				  <description>Clear timestamp flag</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="CALRAF"/>
            </field>
				<field>
				  <name>CWUTF</name>
				  <description>Clear wakeup timer flag</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="CALRAF"/>
            </field>
				<field>
				  <name>CALRBF</name>
				  <description>Clear alarm B flag</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues derivedFrom="CALRAF"/>
            </field>
				<field>
				  <name>CALRAF</name>
				  <description>Clear alarm A flag</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				<enumeratedValues><name>CALRAF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag by writing 1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
			  </fields>
			</register>
			<register>
			  <name>ALRABINR</name>
			  <displayName>ALRABINR</displayName>
			  <description>RTC alarm A binary mode           register</description>
			  <addressOffset>0x70</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SS</name>
				  <description>Synchronous counter alarm value in               Binary mode</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
			<register>
			  <name>ALRBBINR</name>
			  <displayName>ALRBBINR</displayName>
			  <description>RTC alarm B binary mode           register</description>
			  <addressOffset>0x74</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <fields>
				<field>
				  <name>SS</name>
				  <description>Synchronous counter alarm value in               Binary mode</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>32</bitWidth>
				<writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
			  </fields>
			</register>
