tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>HFSR</name>
               <displayName>HFSR</displayName>
               <description>Hard fault status register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VECTTBL</name>
                     <description>Vector table hard fault</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCED</name>
                     <description>Forced hard fault</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEBUG_VT</name>
                     <description>Reserved for Debug use</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMFAR</name>
               <displayName>MMFAR</displayName>
               <description>Memory management fault address           register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MMFAR</name>
                     <description>Memory management fault               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BFAR</name>
               <displayName>BFAR</displayName>
               <description>Bus fault address register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BFAR</name>
                     <description>Bus fault address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFSR</name>
               <displayName>AFSR</displayName>
               <description>Auxiliary fault status           register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IMPDEF</name>
                     <description>Implementation defined</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SCB_ACTRL</name>
         <description>System control block ACTLR</description>
         <groupName>SCB</groupName>
         <baseAddress>0xE000E008</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x5</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ACTRL</name>
               <displayName>ACTRL</displayName>
               <description>Auxiliary control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DISMCYCINT</name>
                     <description>DISMCYCINT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISDEFWBUF</name>
                     <description>DISDEFWBUF</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISFOLD</name>
                     <description>DISFOLD</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISFPCA</name>
                     <description>DISFPCA</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISOOFP</name>
                     <description>DISOOFP</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SPI1</name>
         <description>Serial peripheral interface/Inter-IC       sound</description>
         <groupName>SPI</groupName>
         <baseAddress>0x40013000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SPI1</name>
            <description>SPI 1 global interrupt</description>
            <value>34</value>
         </interrupt>
         <registers>
            <register>
               <name>CR1</name>
               <displayName>CR1</displayName>
               <description>control register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>BIDIMODE</name>
                     <description>Bidirectional data mode               enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BIDIMODE</name><usage>read-write</usage><enumeratedValue><name>Unidirectional</name><description>2-line unidirectional data mode selected</description><value>0</value></enumeratedValue><enumeratedValue><name>Bidirectional</name><description>1-line bidirectional data mode selected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BIDIOE</name>
                     <description>Output enable in bidirectional               mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BIDIOE</name><usage>read-write</usage><enumeratedValue><name>OutputDisabled</name><description>Output disabled (receive-only mode)</description><value>0</value></enumeratedValue><enumeratedValue><name>OutputEnabled</name><description>Output enabled (transmit-only mode)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CRCEN</name>
                     <description>Hardware CRC calculation               enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CRCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CRC calculation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CRC calculation enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CRCNEXT</name>
                     <description>CRC transfer next</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CRCNEXT</name><usage>read-write</usage><enumeratedValue><name>TxBuffer</name><description>Next transmit value is from Tx buffer</description><value>0</value></enumeratedValue><enumeratedValue><name>CRC</name><description>Next transmit value is from Tx CRC register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CRCL</name>
                     <description>CRC length</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CRCL</name><usage>read-write</usage><enumeratedValue><name>EightBit</name><description>8-bit CRC length</description><value>0</value></enumeratedValue><enumeratedValue><name>SixteenBit</name><description>16-bit CRC length</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RXONLY</name>
                     <description>Receive only</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RXONLY</name><usage>read-write</usage><enumeratedValue><name>FullDuplex</name><description>Full duplex (Transmit and receive)</description><value>0</value></enumeratedValue><enumeratedValue><name>OutputDisabled</name><description>Output disabled (Receive-only mode)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SSM</name>
                     <description>Software slave management</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SSM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Software slave management disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Software slave management enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SSI</name>
                     <description>Internal slave select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SSI</name><usage>read-write</usage><enumeratedValue><name>SlaveSelected</name><description>0 is forced onto the NSS pin and the I/O value of the NSS pin is ignored</description><value>0</value></enumeratedValue><enumeratedValue><name>SlaveNotSelected</name><description>1 is forced onto the NSS pin and the I/O value of the NSS pin is ignored</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LSBFIRST</name>
                     <description>Frame format</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LSBFIRST</name><usage>read-write</usage><enumeratedValue><name>MSBFirst</name><description>Data is transmitted/received with the MSB first</description><value>0</value></enumeratedValue><enumeratedValue><name>LSBFirst</name><description>Data is transmitted/received with the LSB first</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SPE</name>
                     <description>SPI enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SPE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Peripheral disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Peripheral enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BR</name>
                     <description>Baud rate control</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>BR</name><usage>read-write</usage><enumeratedValue><name>Div2</name><description>f_PCLK / 2</description><value>0</value></enumeratedValue><enumeratedValue><name>Div4</name><description>f_PCLK / 4</description><value>1</value></enumeratedValue><enumeratedValue><name>Div8</name><description>f_PCLK / 8</description><value>2</value></enumeratedValue><enumeratedValue><name>Div16</name><description>f_PCLK / 16</description><value>3</value></enumeratedValue><enumeratedValue><name>Div32</name><description>f_PCLK / 32</description><value>4</value></enumeratedValue><enumeratedValue><name>Div64</name><description>f_PCLK / 64</description><value>5</value></enumeratedValue><enumeratedValue><name>Div128</name><description>f_PCLK / 128</description><value>6</value></enumeratedValue><enumeratedValue><name>Div256</name><description>f_PCLK / 256</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MSTR</name>
                     <description>Master selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MSTR</name><usage>read-write</usage><enumeratedValue><name>Slave</name><description>Slave configuration</description><value>0</value></enumeratedValue><enumeratedValue><name>Master</name><description>Master configuration</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CPOL</name>
                     <description>Clock polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CPOL</name><usage>read-write</usage><enumeratedValue><name>IdleLow</name><description>CK to 0 when idle</description><value>0</value></enumeratedValue><enumeratedValue><name>IdleHigh</name><description>CK to 1 when idle</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CPHA</name>
                     <description>Clock phase</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CPHA</name><usage>read-write</usage><enumeratedValue><name>FirstEdge</name><description>The first clock transition is the first data capture edge</description><value>0</value></enumeratedValue><enumeratedValue><name>SecondEdge</name><description>The second clock transition is the first data capture edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
