tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CR2</name>
               <displayName>CR2</displayName>
               <description>control register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>RXDMAEN</name>
                     <description>Rx buffer DMA enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RXDMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Rx buffer DMA disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Rx buffer DMA enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TXDMAEN</name>
                     <description>Tx buffer DMA enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TXDMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Tx buffer DMA disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Tx buffer DMA enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SSOE</name>
                     <description>SS output enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>SSOE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SS output is disabled in master mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SS output is enabled in master mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>NSSP</name>
                     <description>NSS pulse management</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>NSSP</name><usage>read-write</usage><enumeratedValue><name>NoPulse</name><description>No NSS pulse</description><value>0</value></enumeratedValue><enumeratedValue><name>PulseGenerated</name><description>NSS pulse generated</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FRF</name>
                     <description>Frame format</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>FRF</name><usage>read-write</usage><enumeratedValue><name>Motorola</name><description>SPI Motorola mode</description><value>0</value></enumeratedValue><enumeratedValue><name>TI</name><description>SPI TI mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ERRIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Error interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>Error interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RXNEIE</name>
                     <description>RX buffer not empty interrupt               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RXNEIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>RXE interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>RXE interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TXEIE</name>
                     <description>Tx buffer empty interrupt               enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TXEIE</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>TXE interrupt masked</description><value>0</value></enumeratedValue><enumeratedValue><name>NotMasked</name><description>TXE interrupt not masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DS</name>
                     <description>Data size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>DS</name><usage>read-write</usage><enumeratedValue><name>FourBit</name><description>4-bit</description><value>3</value></enumeratedValue><enumeratedValue><name>FiveBit</name><description>5-bit</description><value>4</value></enumeratedValue><enumeratedValue><name>SixBit</name><description>6-bit</description><value>5</value></enumeratedValue><enumeratedValue><name>SevenBit</name><description>7-bit</description><value>6</value></enumeratedValue><enumeratedValue><name>EightBit</name><description>8-bit</description><value>7</value></enumeratedValue><enumeratedValue><name>NineBit</name><description>9-bit</description><value>8</value></enumeratedValue><enumeratedValue><name>TenBit</name><description>10-bit</description><value>9</value></enumeratedValue><enumeratedValue><name>ElevenBit</name><description>11-bit</description><value>10</value></enumeratedValue><enumeratedValue><name>TwelveBit</name><description>12-bit</description><value>11</value></enumeratedValue><enumeratedValue><name>ThirteenBit</name><description>13-bit</description><value>12</value></enumeratedValue><enumeratedValue><name>FourteenBit</name><description>14-bit</description><value>13</value></enumeratedValue><enumeratedValue><name>FifteenBit</name><description>15-bit</description><value>14</value></enumeratedValue><enumeratedValue><name>SixteenBit</name><description>16-bit</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FRXTH</name>
                     <description>FIFO reception threshold</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>FRXTH</name><usage>read-write</usage><enumeratedValue><name>Half</name><description>RXNE event is generated if the FIFO level is greater than or equal to 1/2 (16-bit)</description><value>0</value></enumeratedValue><enumeratedValue><name>Quarter</name><description>RXNE event is generated if the FIFO level is greater than or equal to 1/4 (8-bit)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LDMA_RX</name>
                     <description>Last DMA transfer for               reception</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LDMA_RX</name><usage>read-write</usage><enumeratedValue><name>Even</name><description>Number of data to transfer for receive is even</description><value>0</value></enumeratedValue><enumeratedValue><name>Odd</name><description>Number of data to transfer for receive is odd</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LDMA_TX</name>
                     <description>Last DMA transfer for               transmission</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LDMA_TX</name><usage>read-write</usage><enumeratedValue><name>Even</name><description>Number of data to transfer for transmit is even</description><value>0</value></enumeratedValue><enumeratedValue><name>Odd</name><description>Number of data to transfer for transmit is odd</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>status register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <resetValue>0x0002</resetValue>
               <fields>
                  <field>
                     <name>RXNE</name>
                     <description>Receive buffer not empty</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>RXNE</name><usage>read-write</usage><enumeratedValue><name>Empty</name><description>Rx buffer empty</description><value>0</value></enumeratedValue><enumeratedValue><name>NotEmpty</name><description>Rx buffer not empty</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TXE</name>
                     <description>Transmit buffer empty</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>TXE</name><usage>read-write</usage><enumeratedValue><name>NotEmpty</name><description>Tx buffer not empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Empty</name><description>Tx buffer empty</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CHSIDE</name>
                     <description>CHSIDE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>CHSIDE</name><usage>read-write</usage><enumeratedValue><name>Left</name><description>Channel left has to be transmitted or has been received</description><value>0</value></enumeratedValue><enumeratedValue><name>Right</name><description>Channel right has to be transmitted or has been received</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UDR</name>
                     <description>UDR</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>UDRR</name><usage>read</usage><enumeratedValue><name>NoUnderrun</name><description>No underrun occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Underrun</name><description>Underrun occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CRCERR</name>
                     <description>CRC error flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>CRCERR</name><usage>read-write</usage><enumeratedValue><name>Match</name><description>CRC value received matches the SPIx_RXCRCR value</description><value>0</value></enumeratedValue><enumeratedValue><name>NoMatch</name><description>CRC value received does not match the SPIx_RXCRCR value</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MODF</name>
                     <description>Mode fault</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>MODFR</name><usage>read</usage><enumeratedValue><name>NoFault</name><description>No mode fault occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Fault</name><description>Mode fault occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OVR</name>
                     <description>Overrun flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>OVRR</name><usage>read</usage><enumeratedValue><name>NoOverrun</name><description>No overrun occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Overrun occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BSY</name>
                     <description>Busy flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>BSYR</name><usage>read</usage><enumeratedValue><name>NotBusy</name><description>SPI not busy</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>SPI busy</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FRE</name>
                     <description>Frame format error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>FRER</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No frame format error</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>A frame format error occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FRLVL</name>
                     <description>FIFO reception level</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>FRLVLR</name><usage>read</usage><enumeratedValue><name>Empty</name><description>Rx FIFO Empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Quarter</name><description>Rx 1/4 FIFO</description><value>1</value></enumeratedValue><enumeratedValue><name>Half</name><description>Rx 1/2 FIFO</description><value>2</value></enumeratedValue><enumeratedValue><name>Full</name><description>Rx FIFO full</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FTLVL</name>
                     <description>FIFO transmission level</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>FTLVLR</name><usage>read</usage><enumeratedValue><name>Empty</name><description>Tx FIFO Empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Quarter</name><description>Tx 1/4 FIFO</description><value>1</value></enumeratedValue><enumeratedValue><name>Half</name><description>Tx 1/2 FIFO</description><value>2</value></enumeratedValue><enumeratedValue><name>Full</name><description>Tx FIFO full</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>DR</name>
               <displayName>DR</displayName>
               <description>data register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DR</name>
                     <description>Data register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CRCPR</name>
               <displayName>CRCPR</displayName>
               <description>CRC polynomial register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0007</resetValue>
               <fields>
                  <field>
                     <name>CRCPOLY</name>
                     <description>CRC polynomial register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>RXCRCR</name>
               <displayName>RXCRCR</displayName>
               <description>RX CRC register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>RxCRC</name>
                     <description>Rx CRC register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>TXCRCR</name>
               <displayName>TXCRCR</displayName>
               <description>TX CRC register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TxCRC</name>
                     <description>Tx CRC register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
