tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>I2SCFGR</name>
               <displayName>I2SCFGR</displayName>
               <description>configuration register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHLEN</name>
                     <description>CHLEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CHLEN</name><usage>read-write</usage><enumeratedValue><name>SixteenBit</name><description>16-bit wide</description><value>0</value></enumeratedValue><enumeratedValue><name>ThirtyTwoBit</name><description>32-bit wide</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DATLEN</name>
                     <description>DATLEN</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>DATLEN</name><usage>read-write</usage><enumeratedValue><name>SixteenBit</name><description>16-bit data length</description><value>0</value></enumeratedValue><enumeratedValue><name>TwentyFourBit</name><description>24-bit data length</description><value>1</value></enumeratedValue><enumeratedValue><name>ThirtyTwoBit</name><description>32-bit data length</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CKPOL</name>
                     <description>CKPOL</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CKPOL</name><usage>read-write</usage><enumeratedValue><name>IdleLow</name><description>I2S clock inactive state is low level</description><value>0</value></enumeratedValue><enumeratedValue><name>IdleHigh</name><description>I2S clock inactive state is high level</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>I2SSTD</name>
                     <description>I2SSTD</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>I2SSTD</name><usage>read-write</usage><enumeratedValue><name>Philips</name><description>I2S Philips standard</description><value>0</value></enumeratedValue><enumeratedValue><name>MSB</name><description>MSB justified standard</description><value>1</value></enumeratedValue><enumeratedValue><name>LSB</name><description>LSB justified standard</description><value>2</value></enumeratedValue><enumeratedValue><name>PCM</name><description>PCM standard</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PCMSYNC</name>
                     <description>PCMSYNC</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PCMSYNC</name><usage>read-write</usage><enumeratedValue><name>Short</name><description>Short frame synchronisation</description><value>0</value></enumeratedValue><enumeratedValue><name>Long</name><description>Long frame synchronisation</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>I2SCFG</name>
                     <description>I2SCFG</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>I2SCFG</name><usage>read-write</usage><enumeratedValue><name>SlaveTx</name><description>Slave - transmit</description><value>0</value></enumeratedValue><enumeratedValue><name>SlaveRx</name><description>Slave - receive</description><value>1</value></enumeratedValue><enumeratedValue><name>MasterTx</name><description>Master - transmit</description><value>2</value></enumeratedValue><enumeratedValue><name>MasterRx</name><description>Master - receive</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>I2SE</name>
                     <description>I2SE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>I2SE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>I2S peripheral is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>I2S peripheral is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>I2SMOD</name>
                     <description>I2SMOD</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>I2SMOD</name><usage>read-write</usage><enumeratedValue><name>SPIMode</name><description>SPI mode is selected</description><value>0</value></enumeratedValue><enumeratedValue><name>I2SMode</name><description>I2S mode is selected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ASTRTEN</name>
                     <description>ASTRTEN</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2SPR</name>
               <displayName>I2SPR</displayName>
               <description>prescaler register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>I2SDIV</name>
                     <description>I2SDIV</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>2</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>ODD</name>
                     <description>ODD</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ODD</name><usage>read-write</usage><enumeratedValue><name>Even</name><description>Real divider value is I2SDIV * 2</description><value>0</value></enumeratedValue><enumeratedValue><name>Odd</name><description>Real divider value is (I2SDIV * 2) + 1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MCKOE</name>
                     <description>MCKOE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MCKOE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Master clock output is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Master clock output is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>						      
