tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="SPI1">
         <name>SPI2</name>
         <baseAddress>0x40003800</baseAddress>
         <interrupt>
            <name>SPI2S2</name>
            <description>SPI2S2 global interrupt</description>
            <value>35</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SPI1">
         <name>SPI3</name>
         <baseAddress>0x58010000</baseAddress>        
      </peripheral>	  
      <peripheral>
         <name>STK</name>
         <description>SysTick timer</description>
         <groupName>STK</groupName>
         <baseAddress>0xE000E010</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x11</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <displayName>CTRL</displayName>
               <description>SysTick control and status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Counter enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TICKINT</name>
                     <description>SysTick exception request               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKSOURCE</name>
                     <description>Clock source selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COUNTFLAG</name>
                     <description>COUNTFLAG</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOAD</name>
               <displayName>LOAD</displayName>
               <description>SysTick reload value register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>RELOAD value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VAL</name>
               <displayName>VAL</displayName>
               <description>SysTick current value register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CURRENT</name>
                     <description>Current counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALIB</name>
               <displayName>CALIB</displayName>
               <description>SysTick calibration value           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TENMS</name>
                     <description>Calibration value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>SKEW</name>
                     <description>SKEW flag: Indicates whether the TENMS               value is exact</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOREF</name>
                     <description>NOREF flag. Reads as zero</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>    	  
      <peripheral>
         <name>SYSCFG</name>
         <description>System configuration controller</description>
         <groupName>SYSCFG</groupName>
         <baseAddress>0x40010000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MEMRMP</name>
               <displayName>MEMRMP</displayName>
               <description>memory remap register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEM_MODE</name>
                     <description>Memory mapping selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>MEM_MODE</name><usage>read-write</usage><enumeratedValue><name>MainFlash</name><description>Main Flash memory mapped at 0x0000_0000</description><value>0</value></enumeratedValue><enumeratedValue><name>SystemFlash</name><description>System Flash memory mapped at 0x0000_0000</description><value>1</value></enumeratedValue><enumeratedValue><name>SRAM</name><description>Embedded SRAM mapped at 0x0000_0000</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CFGR1</name>
               <displayName>CFGR1</displayName>
               <description>configuration register 1</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x7C000001</resetValue>
               <fields>
                  <field>
                     <name>I2C3_FMP</name>
                     <description>I2C3 Fast-mode Plus driving capability               activation</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>I2C3_FMP</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>FM+ mode is controlled by I2C_Pxx_FMP bits only</description><value>0</value></enumeratedValue><enumeratedValue><name>FMP</name><description>FM+ mode is enabled on all I2C3 pins selected through selection bits in GPIOx_AFR registers</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>I2C2_FMP</name>
                     <description>I2C2 Fast-mode Plus driving capability               activation</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>I2C2_FMP</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>FM+ mode is controlled by I2C_Pxx_FMP bits only</description><value>0</value></enumeratedValue><enumeratedValue><name>FMP</name><description>FM+ mode is enabled on all I2C2 pins selected through selection bits in GPIOx_AFR registers</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>I2C1_FMP</name>
                     <description>I2C1 Fast-mode Plus driving capability               activation</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>I2C1_FMP</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>FM+ mode is controlled by I2C_Pxx_FMP bits only</description><value>0</value></enumeratedValue><enumeratedValue><name>FMP</name><description>FM+ mode is enabled on all I2C1 pins selected through selection bits in GPIOx_AFR registers</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>I2C_PB9_FMP</name>
                     <description>Fast-mode Plus (Fm+) driving capability               activation on PB9</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>I2C_PB9_FMP</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>PB9 pin operate in standard mode</description><value>0</value></enumeratedValue><enumeratedValue><name>FMP</name><description>I2C FM+ mode enabled on PB9 and the Speed control is bypassed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>I2C_PB8_FMP</name>
                     <description>Fast-mode Plus (Fm+) driving capability               activation on PB8</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>I2C_PB8_FMP</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>PB8 pin operate in standard mode</description><value>0</value></enumeratedValue><enumeratedValue><name>FMP</name><description>I2C FM+ mode enabled on PB8 and the Speed control is bypassed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>I2C_PB7_FMP</name>
                     <description>Fast-mode Plus (Fm+) driving capability               activation on PB7</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>I2C_PB7_FMP</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>PB7 pin operate in standard mode</description><value>0</value></enumeratedValue><enumeratedValue><name>FMP</name><description>I2C FM+ mode enabled on PB7 and the Speed control is bypassed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>I2C_PB6_FMP</name>
                     <description>Fast-mode Plus (Fm+) driving capability               activation on PB6</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>I2C_PB6_FMP</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>PB6 pin operate in standard mode</description><value>0</value></enumeratedValue><enumeratedValue><name>FMP</name><description>I2C FM+ mode enabled on PB6 and the Speed control is bypassed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BOOSTEN</name>
                     <description>I/O analog switch voltage booster               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BOOSTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>I/O analog switches are supplied by VDDA voltage. This is the recommended configuration when using the ADC in high VDDA voltage operation</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>I/O analog switches are supplied by a dedicated voltage booster (supplied by VDD). This is the recommended configuration when using the ADC in low VDDA voltage operation</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>EXTICR1</name>
               <displayName>EXTICR1</displayName>
               <description>external interrupt configuration register           1</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTI3</name>
                     <description>EXTI 3 configuration bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI3</name><usage>read-write</usage><enumeratedValue><name>PA3</name><description>Select PA3 as the source input for the EXTI3 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB3</name><description>Select PB3 as the source input for the EXTI3 external interrupt</description><value>1</value></enumeratedValue><enumeratedValue><name>PC3</name><description>Select PC3 as the source input for the EXTI3 external interrupt</description><value>2</value></enumeratedValue><enumeratedValue><name>PH3</name><description>Select PH3 as the source input for the EXTI3 external interrupt</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI2</name>
                     <description>EXTI 2 configuration bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI2</name><usage>read-write</usage><enumeratedValue><name>PA2</name><description>Select PA2 as the source input for the EXTI2 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB2</name><description>Select PB2 as the source input for the EXTI2 external interrupt</description><value>1</value></enumeratedValue><enumeratedValue><name>PC2</name><description>Select PC2 as the source input for the EXTI2 external interrupt</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI1</name>
                     <description>EXTI 1 configuration bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI1</name><usage>read-write</usage><enumeratedValue><name>PA1</name><description>Select PA1 as the source input for the EXTI1 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB1</name><description>Select PB1 as the source input for the EXTI1 external interrupt</description><value>1</value></enumeratedValue><enumeratedValue><name>PC1</name><description>Select PC1 as the source input for the EXTI1 external interrupt</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI0</name>
                     <description>EXTI 0 configuration bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI0</name><usage>read-write</usage><enumeratedValue><name>PA0</name><description>Select PA0 as the source input for the EXTI0 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB0</name><description>Select PB0 as the source input for the EXTI0 external interrupt</description><value>1</value></enumeratedValue><enumeratedValue><name>PC0</name><description>Select PC0 as the source input for the EXTI0 external interrupt</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>EXTICR2</name>
               <displayName>EXTICR2</displayName>
               <description>external interrupt configuration register           2</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTI7</name>
                     <description>EXTI 7 configuration bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI7</name><usage>read-write</usage><enumeratedValue><name>PA7</name><description>Select PA7 as the source input for the EXTI7 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB7</name><description>Select PB7 as the source input for the EXTI7 external interrupt</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI6</name>
                     <description>EXTI 6 configuration bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI6</name><usage>read-write</usage><enumeratedValue><name>PA6</name><description>Select PA6 as the source input for the EXTI6 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB6</name><description>Select PB6 as the source input for the EXTI6 external interrupt</description><value>1</value></enumeratedValue><enumeratedValue><name>PC6</name><description>Select PC6 as the source input for the EXTI6 external interrupt</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI5</name>
                     <description>EXTI 5 configuration bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI5</name><usage>read-write</usage><enumeratedValue><name>PA5</name><description>Select PA5 as the source input for the EXTI5 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB5</name><description>Select PB5 as the source input for the EXTI5 external interrupt</description><value>1</value></enumeratedValue><enumeratedValue><name>PC5</name><description>Select PC5 as the source input for the EXTI5 external interrupt</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI4</name>
                     <description>EXTI 4 configuration bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI4</name><usage>read-write</usage><enumeratedValue><name>PA4</name><description>Select PA4 as the source input for the EXTI4 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB4</name><description>Select PB4 as the source input for the EXTI4 external interrupt</description><value>1</value></enumeratedValue><enumeratedValue><name>PC4</name><description>Select PC4 as the source input for the EXTI4 external interrupt</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>EXTICR3</name>
               <displayName>EXTICR3</displayName>
               <description>external interrupt configuration register           3</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTI11</name>
                     <description>EXTI 11 configuration bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI11</name><usage>read-write</usage><enumeratedValue><name>PA11</name><description>Select PA11 as the source input for the EXTI11 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB11</name><description>Select PB11 as the source input for the EXTI11 external interrupt</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI10</name>
                     <description>EXTI 10 configuration bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI10</name><usage>read-write</usage><enumeratedValue><name>PA10</name><description>Select PA10 as the source input for the EXTI10 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB10</name><description>Select PB10 as the source input for the EXTI10 external interrupt</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI9</name>
                     <description>EXTI 9 configuration bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI9</name><usage>read-write</usage><enumeratedValue><name>PA9</name><description>Select PA9 as the source input for the EXTI9 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB9</name><description>Select PB9 as the source input for the EXTI9 external interrupt</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI8</name>
                     <description>EXTI 8 configuration bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI8</name><usage>read-write</usage><enumeratedValue><name>PA8</name><description>Select PA8 as the source input for the EXTI8 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB8</name><description>Select PB8 as the source input for the EXTI8 external interrupt</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
