tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>EXTICR4</name>
               <displayName>EXTICR4</displayName>
               <description>external interrupt configuration register           4</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTI15</name>
                     <description>EXTI15 configuration bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI15</name><usage>read-write</usage><enumeratedValue><name>PA15</name><description>Select PA15 as the source input for the EXTI15 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB15</name><description>Select PB15 as the source input for the EXTI15 external interrupt</description><value>1</value></enumeratedValue><enumeratedValue><name>PC15</name><description>Select PC15 as the source input for the EXTI15 external interrupt</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI14</name>
                     <description>EXTI14 configuration bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI14</name><usage>read-write</usage><enumeratedValue><name>PA14</name><description>Select PA14 as the source input for the EXTI14 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB14</name><description>Select PB14 as the source input for the EXTI14 external interrupt</description><value>1</value></enumeratedValue><enumeratedValue><name>PC14</name><description>Select PC14 as the source input for the EXTI14 external interrupt</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI13</name>
                     <description>EXTI13 configuration bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI13</name><usage>read-write</usage><enumeratedValue><name>PA13</name><description>Select PA13 as the source input for the EXTI13 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB13</name><description>Select PB13 as the source input for the EXTI13 external interrupt</description><value>1</value></enumeratedValue><enumeratedValue><name>PC13</name><description>Select PC13 as the source input for the EXTI13 external interrupt</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EXTI12</name>
                     <description>EXTI12 configuration bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>EXTI12</name><usage>read-write</usage><enumeratedValue><name>PA12</name><description>Select PA12 as the source input for the EXTI12 external interrupt</description><value>0</value></enumeratedValue><enumeratedValue><name>PB12</name><description>Select PB12 as the source input for the EXTI12 external interrupt</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>SCSR</name>
               <displayName>SCSR</displayName>
               <description>SCSR</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
			      <field>
                     <name>PKASRAMBSY</name>
                     <description>PKA SRAM busy by erase operation</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>PKASRAMBSY</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>No PKA SRAM erase operation is ongoing</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>PKA SRAM erase operation is ongoing</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SRAMBSY</name>
                     <description>SRAM1, SRAM2 and PKA SRAM busy by erase               operation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>SRAMBSY</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>No SRAM1 or SRAM2 erase operation is ongoing</description><value>0</value></enumeratedValue><enumeratedValue><name>Busy</name><description>SRAM1 or SRAM2 erase operation is ongoing</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SRAM2ER</name>
                     <description>SRAM2 erase</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>SRAM2ERW</name><usage>write</usage><enumeratedValue><name>Erase</name><description>Start SRAM2 erase operation</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CFGR2</name>
               <displayName>CFGR2</displayName>
               <description>CFGR2</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPF</name>
                     <description>SRAM2 parity error flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>SPFR</name><usage>read</usage><enumeratedValue><name>Nominal</name><description>No SRAM2 parity error detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>SRAM2 parity error detected</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>SPFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear SRAM2 parity error flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ECCL</name>
                     <description>ECC Lock</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>ECCLR</name><usage>read</usage><enumeratedValue><name>Disconnected</name><description>ECC error disconnected from TIM1/16/17 break input</description><value>0</value></enumeratedValue><enumeratedValue><name>Connected</name><description>ECC error connected to TIM1/16/17 break input</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ECCLW</name><usage>write</usage><enumeratedValue><name>Connect</name><description>Connect ECC error to TIM1/16/17 break input</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PVDL</name>
                     <description>PVD lock enable bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>PVDLR</name><usage>read</usage><enumeratedValue><name>Disconnected</name><description>PVD interrupt disconnected from TIM1/16/17 break input. PVDE and PLS[2:0] bits can be programmed by the application</description><value>0</value></enumeratedValue><enumeratedValue><name>Connected</name><description>PVD interrupt connected to TIM1/16/17 break input. PVDE and PLS[2:0] bits are read only</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>PVDLW</name><usage>write</usage><enumeratedValue><name>Connect</name><description>Connect PVD interretup to TIM1/16/17 break input</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>SPL</name>
                     <description>SRAM2 parity lock bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>SPLR</name><usage>read</usage><enumeratedValue><name>Disconnected</name><description>SRAM2 parity error signal disconnected from TIM1/16/17 break input</description><value>0</value></enumeratedValue><enumeratedValue><name>Connected</name><description>SRAM2 parity error signal connected to TIM1/16/17 break input</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>SPLW</name><usage>write</usage><enumeratedValue><name>Connect</name><description>Connect SRAM2 parity error signal to TIM1/16/17 break input</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CLL</name>
                     <description>CPU1 LOCKUP (Hardfault) output enable               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>CLLR</name><usage>read</usage><enumeratedValue><name>Disconnected</name><description>CPU LOCKUP output disconnected from TIM1/16/17 break input</description><value>0</value></enumeratedValue><enumeratedValue><name>Connected</name><description>CPU LOCKUP output connected to TIM1/16/17 break input</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>CLLW</name><usage>write</usage><enumeratedValue><name>Connect</name><description>Connect CPU LOCKUP output to TIM1/16/17 break input</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>SWPR</name>
               <displayName>SWPR</displayName>
               <description>SWPR</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>P31WP</name>
                     <description>SRAM2 1Kbyte page 31 write               protection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P30WP</name>
                     <description>SRAM2 1Kbyte page 30 write               protection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P29WP</name>
                     <description>SRAM2 1Kbyte page 29 write               protection</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P28WP</name>
                     <description>SRAM2 1Kbyte page 28 write               protection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P27WP</name>
                     <description>SRAM2 1Kbyte page 27 write               protection</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P26WP</name>
                     <description>SRAM2 1Kbyte page 26 write               protection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P25WP</name>
                     <description>SRAM2 1Kbyte page 25 write               protection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P24WP</name>
                     <description>SRAM2 1Kbyte page 24 write               protection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P23WP</name>
                     <description>SRAM2 1Kbyte page 23 write               protection</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P22WP</name>
                     <description>SRAM2 1Kbyte page 22 write               protection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P21WP</name>
                     <description>SRAM2 1Kbyte page 21 write               protection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P20WP</name>
                     <description>SRAM2 1Kbyte page 20 write               protection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P19WP</name>
                     <description>SRAM2 1Kbyte page 19 write               protection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P18WP</name>
                     <description>SRAM2 1Kbyte page 18 write               protection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P17WP</name>
                     <description>SRAM2 1Kbyte page 17 write               protection</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P16WP</name>
                     <description>SRAM2 1Kbyte page 16 write               protection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P15WP</name>
                     <description>SRAM2 1Kbyte page 15 write               protection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P14WP</name>
                     <description>SRAM2 1Kbyte page 14 write               protection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P13WP</name>
                     <description>SRAM2 1Kbyte page 13 write               protection</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P12WP</name>
                     <description>SRAM2 1Kbyte page 12 write               protection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P11WP</name>
                     <description>SRAM2 1Kbyte page 11 write               protection</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P10WP"/>
            </field>
                  <field>
                     <name>P10WP</name>
                     <description>SRAM2 1Kbyte page 10 write               protection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>P10WP</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SRAM2 1 KB page protection disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SRAM2 1 KB page protection enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>P9WP</name>
                     <description>SRAM2 1Kbyte page 9 write               protection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P0WP"/>
            </field>
                  <field>
                     <name>P8WP</name>
                     <description>SRAM2 1Kbyte page 8 write               protection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P0WP"/>
            </field>
                  <field>
                     <name>P7WP</name>
                     <description>SRAM2 1Kbyte page 7 write               protection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P0WP"/>
            </field>
                  <field>
                     <name>P6WP</name>
                     <description>SRAM2 1Kbyte page 6 write               protection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P0WP"/>
            </field>
                  <field>
                     <name>P5WP</name>
                     <description>SRAM2 1Kbyte page 5 write               protection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P0WP"/>
            </field>
                  <field>
                     <name>P4WP</name>
                     <description>SRAM2 1Kbyte page 4 write               protection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P0WP"/>
            </field>
                  <field>
                     <name>P3WP</name>
                     <description>SRAM2 1Kbyte page 3 write               protection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P0WP"/>
            </field>
                  <field>
                     <name>P2WP</name>
                     <description>SRAM2 1Kbyte page 2 write               protection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P0WP"/>
            </field>
                  <field>
                     <name>P1WP</name>
                     <description>SRAM2 1Kbyte page 1 write               protection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="P0WP"/>
            </field>
                  <field>
                     <name>P0WP</name>
                     <description>SRAM2 1Kbyte page 0 write               protection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>P0WP</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SRAM2 1 KB page protection disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SRAM2 1 KB page protection enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>SKR</name>
               <displayName>SKR</displayName>
               <description>SKR</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>SRAM2 write protection key for software               erase</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <enumeratedValues><name>KEY</name><usage>read-write</usage><enumeratedValue><name>Step1</name><description>Step 1 to remove SRAM2ER bits write protection</description><value>202</value></enumeratedValue><enumeratedValue><name>Step2</name><description>Step 2 to remove SRAM2ER bits write protection</description><value>83</value></enumeratedValue><enumeratedValue><name>WriteProtect</name><description>Activate SRAM2ER bits write protection</description><value>17</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
