tinygo-org/stm32-svd/svd/stm32wle5.svd
			<register>
               <name>RFDCR</name>
               <displayName>RFDCR</displayName>
               <description>radio debug control register</description>
               <addressOffset>0x208</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFTBSEL</name>
                     <description>radio debug test bus selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RFTBSEL</name><usage>read-write</usage><enumeratedValue><name>Digital</name><description>Digital test bus selected on RF_ADTB[3:0]</description><value>0</value></enumeratedValue><enumeratedValue><name>Analog</name><description>Analog test bus selected on RF_ADTB[3:0]</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>TAMP</name>
         <description>Tamper and backup registers</description>
         <groupName>TAMP</groupName>
         <baseAddress>0x4000B000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CR1</name>
               <displayName>CR1</displayName>
               <description>control register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFF0000</resetValue>
               <fields>
                  <field>
                     <name>TAMP1E</name>
                     <description>TAMP1E</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TAMP1E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Tamper detection on TAMP_INx is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Tamper detection on TAMP_IN3 is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMP2E</name>
                     <description>TAMP2E</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1E"/>
            </field>
                  <field>
                     <name>TAMP3E</name>
                     <description>TAMP2E</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1E"/>
            </field>
                  <field>
                     <name>ITAMP3E</name>
                     <description>ITAMP3E</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ITAMP3E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Internal tamper x disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Internal tamper x enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ITAMP5E</name>
                     <description>ITAMP5E</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3E"/>
            </field>
				  <field>
                     <name>ITAMP6E</name>
                     <description>ITAMP6E</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3E"/>
            </field>
                  <field>
                     <name>ITAMP8E</name>
                     <description>ITAMP8E</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3E"/>
            </field>
               </fields>
            </register>
            <register>
               <name>CR2</name>
               <displayName>CR2</displayName>
               <description>control register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAMP1NOER</name>
                     <description>TAMP1NOER</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TAMP1NOER</name><usage>read-write</usage><enumeratedValue><name>Erase</name><description>Tamper x event erases the backup registers</description><value>0</value></enumeratedValue><enumeratedValue><name>NotErase</name><description>Tamper x event does not erase the backup registers</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMP2NOER</name>
                     <description>TAMP2NOER</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1NOER"/>
            </field>
                  <field>
                     <name>TAMP3NOER</name>
                     <description>TAMP3NOER</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1NOER"/>
            </field>
                  <field>
                     <name>TAMP1MSK</name>
                     <description>TAMP1MSK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TAMP1MSK</name><usage>read-write</usage><enumeratedValue><name>ResetBySoftware</name><description>Tamper x event generates a trigger event and TAMPxF must be cleared by software to allow next tamper event detection</description><value>0</value></enumeratedValue><enumeratedValue><name>ResetByHardware</name><description>Tamper x event generates a trigger event. TAMPxF is masked and internally cleared by hardware. The backup registers are not erased. The tamper x interrupt must not be enabled when TAMP3MSK is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMP2MSK</name>
                     <description>TAMP2MSK</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1MSK"/>
            </field>
                  <field>
                     <name>TAMP3MSK</name>
                     <description>TAMP3MSK</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1MSK"/>
            </field>
				   <field>
                     <name>BKERASE</name>
                     <description>Backup registerserase</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKERASEW</name><usage>write</usage><enumeratedValue><name>Reset</name><description>Reset backup registers</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMP1TRG</name>
                     <description>TAMP1TRG</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TAMP1TRG</name><usage>read-write</usage><enumeratedValue><name>FilteredLowOrUnfilteredHigh</name><description>If TAMPFLT != 00 Tamper x input staying low triggers a tamper detection event. If TAMPFLT = 00 Tamper x input rising edge and high level triggers a tamper detection event</description><value>0</value></enumeratedValue><enumeratedValue><name>FilteredHighOrUnfilteredLow</name><description>If TAMPFLT != 00 Tamper x input staying high triggers a tamper detection event. If TAMPFLT = 00 Tamper x input falling edge and low level triggers a tamper detection event</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMP2TRG</name>
                     <description>TAMP2TRG</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1TRG"/>
            </field>
                  <field>
                     <name>TAMP3TRG</name>
                     <description>TAMP3TRG</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1TRG"/>
            </field>
               </fields>
            </register>
            <register>
               <name>CR3</name>
               <displayName>CR3</displayName>
               <description>TAMP control register 3</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ITAMP3NOER</name>
                     <description>ITAMP3NOER</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ITAMP3NOER</name><usage>read-write</usage><enumeratedValue><name>Erase</name><description>Internal tamper x event erases the backup registers</description><value>0</value></enumeratedValue><enumeratedValue><name>NotErase</name><description>Internal tamper x event does not erase the backup registers</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ITAMP5NOER</name>
                     <description>ITAMP5NOER</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3NOER"/>
            </field>
                  <field>
                     <name>ITAMP6NOER</name>
                     <description>ITAMP6NOER</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3NOER"/>
            </field>
                  <field>
                     <name>ITAMP8NOER</name>
                     <description>ITAMP8NOER</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3NOER"/>
            </field>
               </fields>
            </register>
            <register>
               <name>FLTCR</name>
               <displayName>FLTCR</displayName>
               <description>TAMP filter control register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAMPFREQ</name>
                     <description>TAMPFREQ</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>TAMPFREQ</name><usage>read-write</usage><enumeratedValue><name>Hz_1</name><description>RTCCLK / 32768 (1 Hz when RTCCLK = 32768 Hz)</description><value>0</value></enumeratedValue><enumeratedValue><name>Hz_2</name><description>RTCCLK / 16384 (2 Hz when RTCCLK = 32768 Hz)</description><value>1</value></enumeratedValue><enumeratedValue><name>Hz_4</name><description>RTCCLK / 8192 (4 Hz when RTCCLK = 32768 Hz)</description><value>2</value></enumeratedValue><enumeratedValue><name>Hz_8</name><description>RTCCLK / 4096 (8 Hz when RTCCLK = 32768 Hz)</description><value>3</value></enumeratedValue><enumeratedValue><name>Hz_16</name><description>RTCCLK / 2048 (16 Hz when RTCCLK = 32768 Hz)</description><value>4</value></enumeratedValue><enumeratedValue><name>Hz_32</name><description>RTCCLK / 1024 (32 Hz when RTCCLK = 32768 Hz)</description><value>5</value></enumeratedValue><enumeratedValue><name>Hz_64</name><description>RTCCLK / 512 (64 Hz when RTCCLK = 32768 Hz)</description><value>6</value></enumeratedValue><enumeratedValue><name>Hz_128</name><description>RTCCLK / 256 (128 Hz when RTCCLK = 32768 Hz)</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMPFLT</name>
                     <description>TAMPFLT</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>TAMPFLT</name><usage>read-write</usage><enumeratedValue><name>NoFilter</name><description>Tamper event is activated on edge of TAMP_INx input transitions to the active level (no internal pull-up on TAMP_INx input)"</description><value>0</value></enumeratedValue><enumeratedValue><name>Filter2</name><description>Tamper event is activated after 2 consecutive samples at the active level"</description><value>1</value></enumeratedValue><enumeratedValue><name>Filter4</name><description>Tamper event is activated after 4 consecutive samples at the active level"</description><value>2</value></enumeratedValue><enumeratedValue><name>Filter8</name><description>Tamper event is activated after 8 consecutive samples at the active level"</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMPPRCH</name>
                     <description>TAMPPRCH</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>TAMPPRCH</name><usage>read-write</usage><enumeratedValue><name>Cycles1</name><description>1 RTCCLK cycle</description><value>0</value></enumeratedValue><enumeratedValue><name>Cycles2</name><description>2 RTCCLK cycles</description><value>1</value></enumeratedValue><enumeratedValue><name>Cycles4</name><description>4 RTCCLK cycles</description><value>2</value></enumeratedValue><enumeratedValue><name>Cycles8</name><description>8 RTCCLK cycles</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMPPUDIS</name>
                     <description>TAMPPUDIS</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TAMPPUDIS</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Precharge TAMP_INx pins before sampling (enable internal pull-up)</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Disable precharge of TAMP_INx pins</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <displayName>IER</displayName>
               <description>TAMP interrupt enable register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAMP1IE</name>
                     <description>TAMP1IE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TAMP1IE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Tamper x interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Tampoer x interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMP2IE</name>
                     <description>TAMP2IE</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1IE"/>
            </field>
                  <field>
                     <name>TAMP3IE</name>
                     <description>TAMP3IE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1IE"/>
            </field>
                  <field>
                     <name>ITAMP3IE</name>
                     <description>ITAMP3IE</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ITAMP3IE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Internal tamper x interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Internal tamper x interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ITAMP5IE</name>
                     <description>ITAMP5IE</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3IE"/>
            </field>
				   <field>
                     <name>ITAMP6IE</name>
                     <description>ITAMP6IE</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3IE"/>
            </field>
                  <field>
                     <name>ITAMP8IE</name>
                     <description>ITAMP8IE</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3IE"/>
            </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>TAMP status register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAMP1F</name>
                     <description>TAMP1F</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TAMP1F</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>No tamper detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Tamper</name><description>Tamper detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMP2F</name>
                     <description>TAMP2F</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1F"/>
            </field>
                  <field>
                     <name>TAMP3F</name>
                     <description>TAMP3F</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1F"/>
            </field>
                  <field>
                     <name>ITAMP3F</name>
                     <description>ITAMP3F</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ITAMP3F</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>No tamper detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Tamper</name><description>Internal tamper detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ITAMP5F</name>
                     <description>ITAMP5F</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3F"/>
            </field>
				  <field>
                     <name>ITAMP6F</name>
                     <description>ITAMP6F</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3F"/>
            </field>
                  <field>
                     <name>ITAMP8F</name>
                     <description>ITAMP8F</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3F"/>
            </field>
               </fields>
            </register>
