tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>MISR</name>
               <displayName>MISR</displayName>
               <description>TAMP masked interrupt status           register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAMP1MF</name>
                     <description>TAMP1MF:</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TAMP1MF</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>No tamper detected - Masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Tamper</name><description>Tamper detected - Masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TAMP2MF</name>
                     <description>TAMP2MF</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1MF"/>
            </field>
                  <field>
                     <name>TAMP3MF</name>
                     <description>TAMP3MF</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="TAMP1MF"/>
            </field>
                  <field>
                     <name>ITAMP3MF</name>
                     <description>ITAMP3MF</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ITAMP3MF</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>No tamper detected - Masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Tamper</name><description>Internal tamper detected - Masked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ITAMP5MF</name>
                     <description>ITAMP5MF</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3MF"/>
            </field>
				  <field>
                     <name>ITAMP6MF</name>
                     <description>ITAMP6MF</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3MF"/>
            </field>
                  <field>
                     <name>ITAMP8MF</name>
                     <description>ITAMP8MF</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="ITAMP3MF"/>
            </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <displayName>SCR</displayName>
               <description>TAMP status clear register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CTAMP1F</name>
                     <description>CTAMP1F</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CTAMP1FW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear tamper flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CTAMP2F</name>
                     <description>CTAMP2F</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CTAMP1FW"/>
            </field>
                  <field>
                     <name>CTAMP3F</name>
                     <description>CTAMP3F</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CTAMP1FW"/>
            </field>
                  <field>
                     <name>CITAMP3F</name>
                     <description>CITAMP3F</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CITAMP3FW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear tamper flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CITAMP5F</name>
                     <description>CITAMP5F</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CITAMP3FW"/>
            </field>
				  <field>
                     <name>CITAMP6F</name>
                     <description>CITAMP6F</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CITAMP3FW"/>
            </field>
                  <field>
                     <name>CITAMP8F</name>
                     <description>CITAMP8F</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CITAMP3FW"/>
            </field>
               </fields>
            </register>
            <register>
               <name>COUNTR</name>
               <displayName>COUNTR</displayName>
               <description>monotonic counter register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>COUNT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP0R</name>
               <displayName>BKP0R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP1R</name>
               <displayName>BKP1R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP2R</name>
               <displayName>BKP2R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP3R</name>
               <displayName>BKP3R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP4R</name>
               <displayName>BKP4R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x110</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP5R</name>
               <displayName>BKP5R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x114</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP6R</name>
               <displayName>BKP6R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x118</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP7R</name>
               <displayName>BKP7R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x11C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP8R</name>
               <displayName>BKP8R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x120</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP9R</name>
               <displayName>BKP9R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x124</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP10R</name>
               <displayName>BKP10R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP11R</name>
               <displayName>BKP11R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP12R</name>
               <displayName>BKP12R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x148</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP13R</name>
               <displayName>BKP13R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x14C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP14R</name>
               <displayName>BKP14R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x150</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP15R</name>
               <displayName>BKP15R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x154</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP16R</name>
               <displayName>BKP16R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x158</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP17R</name>
               <displayName>BKP17R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x15C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP18R</name>
               <displayName>BKP18R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x160</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BKP19R</name>
               <displayName>BKP19R</displayName>
               <description>TAMP backup register</description>
               <addressOffset>0x164</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
