tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>TIM1</name>
         <description>Advanced-control timers</description>
         <groupName>TIM</groupName>
         <baseAddress>0x40012C00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TIM1_BRK</name>
            <description>Timer 1 break interrupt</description>
            <value>23</value>
         </interrupt>
         <interrupt>
            <name>TIM1_UP</name>
            <description>Timer 1 Update</description>
            <value>24</value>
         </interrupt>
         <interrupt>
            <name>TIM1_TRG_COM</name>
            <description>Timer 1 trigger and communication</description>
            <value>25</value>
         </interrupt>
         <interrupt>
            <name>TIM1_CC</name>
            <description>Timer 1 capture compare interrupt</description>
            <value>26</value>
         </interrupt>
         <registers>
            <register>
               <name>CR1</name>
               <displayName>CR1</displayName>
               <description>control register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>UIFREMAP</name>
                     <description>UIF status bit remapping</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UIFREMAP</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No remapping. UIF status bit is not copied to TIMx_CNT register bit 31</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Remapping enabled. UIF status bit is copied to TIMx_CNT register bit 31</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CKD</name>
                     <description>Clock division</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CKD</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>t_DTS = t_CK_INT</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>t_DTS = 2 &#215; t_CK_INT</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>t_DTS = 4 &#215; t_CK_INT</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ARPE</name>
                     <description>Auto-reload preload enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ARPE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>TIMx_APRR register is not buffered</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>TIMx_APRR register is buffered</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CMS</name>
                     <description>Center-aligned mode               selection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CMS</name><usage>read-write</usage><enumeratedValue><name>EdgeAligned</name><description>The counter counts up or down depending on the direction bit</description><value>0</value></enumeratedValue><enumeratedValue><name>CenterAligned1</name><description>The counter counts up and down alternatively. Output compare interrupt flags are set only when the counter is counting down.</description><value>1</value></enumeratedValue><enumeratedValue><name>CenterAligned2</name><description>The counter counts up and down alternatively. Output compare interrupt flags are set only when the counter is counting up.</description><value>2</value></enumeratedValue><enumeratedValue><name>CenterAligned3</name><description>The counter counts up and down alternatively. Output compare interrupt flags are set both when the counter is counting up or down.</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DIR</name>
                     <description>Direction</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>DIR</name><usage>read-write</usage><enumeratedValue><name>Up</name><description>Counter used as upcounter</description><value>0</value></enumeratedValue><enumeratedValue><name>Down</name><description>Counter used as downcounter</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OPM</name>
                     <description>One pulse mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OPM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Counter is not stopped at update event</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Counter stops counting at the next update event (clearing the CEN bit)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>URS</name>
                     <description>Update request source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>URS</name><usage>read-write</usage><enumeratedValue><name>AnyEvent</name><description>Any of counter overflow/underflow, setting UG, or update through slave mode, generates an update interrupt or DMA request</description><value>0</value></enumeratedValue><enumeratedValue><name>CounterOnly</name><description>Only counter overflow/underflow generates an update interrupt or DMA request</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UDIS</name>
                     <description>Update disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UDIS</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Update event enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Update event disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CEN</name>
                     <description>Counter enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Counter disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Counter enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CR2</name>
               <displayName>CR2</displayName>
               <description>control register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MMS2</name>
                     <description>Master mode selection 2</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>MMS2</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>Reset - the UG bit from the TIMx_EGR register is used as trigger output (TRGO2). If the reset is generated by the trigger input (slave mode controller configured in reset mode), the signal on TRGO2 is delayed compared to the actual reset</description><value>0</value></enumeratedValue><enumeratedValue><name>Enable</name><description>Enable - the Counter Enable signal CNT_EN is used as trigger output (TRGO2). It is useful to start several timers at the same time or to control a window in which a slave timer is enabled. The Counter Enable signal is generated by a logic AND between the CEN control bit and the trigger input when configured in Gated mode. When the Counter Enable signal is controlled by the trigger input, there is a delay on TRGO2, except if the Master/Slave mode is selected (see the MSM bit description in TIMx_SMCR register)</description><value>1</value></enumeratedValue><enumeratedValue><name>Update</name><description>Update - the update event is selected as trigger output (TRGO2). For instance, a master timer can then be used as a prescaler for a slave timer</description><value>2</value></enumeratedValue><enumeratedValue><name>ComparePulse</name><description>Compare pulse - the trigger output sends a positive pulse when the CC1IF flag is to be set (even if it was already high), as soon as a capture or compare match occurs (TRGO2)</description><value>3</value></enumeratedValue><enumeratedValue><name>CompareOC1</name><description>Compare - OC1REFC signal is used as trigger output (TRGO2)</description><value>4</value></enumeratedValue><enumeratedValue><name>CompareOC2</name><description>Compare - OC2REFC signal is used as trigger output (TRGO2)</description><value>5</value></enumeratedValue><enumeratedValue><name>CompareOC3</name><description>Compare - OC3REFC signal is used as trigger output (TRGO2)</description><value>6</value></enumeratedValue><enumeratedValue><name>CompareOC4</name><description>Compare - OC4REFC signal is used as trigger output (TRGO2)</description><value>7</value></enumeratedValue><enumeratedValue><name>CompareOC5</name><description>Compare - OC5REFC signal is used as trigger output (TRGO2)</description><value>8</value></enumeratedValue><enumeratedValue><name>CompareOC6</name><description>Compare - OC6REFC signal is used as trigger output (TRGO2)</description><value>9</value></enumeratedValue><enumeratedValue><name>PulseOC4</name><description>Compare Pulse - OC4REFC rising or falling edges generate pulses on TRGO2</description><value>10</value></enumeratedValue><enumeratedValue><name>PulseOC6</name><description>Compare Pulse - OC6REFC rising or falling edges generate pulses on TRGO2</description><value>11</value></enumeratedValue><enumeratedValue><name>RisingOC4_6</name><description>Compare Pulse - OC4REFC or OC6REFC rising edges generate pulses on TRGO2</description><value>12</value></enumeratedValue><enumeratedValue><name>RisingOC4_FallingOC6</name><description>Compare Pulse - OC4REFC rising or OC6REFC falling edges generate pulses on TRGO2</description><value>13</value></enumeratedValue><enumeratedValue><name>RisingOC5_6</name><description>Compare Pulse - OC5REFC or OC6REFC rising edges generate pulses on TRGO2</description><value>14</value></enumeratedValue><enumeratedValue><name>RisingOC5_FallingOC6</name><description>Compare Pulse - OC5REFC rising or OC6REFC falling edges generate pulses on TRGO2</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OIS6</name>
                     <description>Output Idle state 6 (OC6               output)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OIS1"/>
            </field>
                  <field>
                     <name>OIS5</name>
                     <description>Output Idle state 5 (OC5               output)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OIS1"/>
            </field>
                  <field>
                     <name>OIS4</name>
                     <description>Output Idle state 4 (OC4               output)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OIS1"/>
            </field>
                  <field>
                     <name>OIS3N</name>
                     <description>Output Idle state 3 (OC3N               output)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OIS1N"/>
            </field>
                  <field>
                     <name>OIS3</name>
                     <description>Output Idle state 3 (OC3               output)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OIS1"/>
            </field>
                  <field>
                     <name>OIS2N</name>
                     <description>Output Idle state 2 (OC2N               output)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OIS1N"/>
            </field>
                  <field>
                     <name>OIS2</name>
                     <description>Output Idle state 2 (OC2               output)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OIS1"/>
            </field>
                  <field>
                     <name>OIS1N</name>
                     <description>Output Idle state 1 (OC1N               output)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OIS1N</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>OCxN=0 after a dead-time when MOE=0</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OCxN=1 after a dead-time when MOE=0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OIS1</name>
                     <description>Output Idle state 1 (OC1               output)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OIS1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>OCx=0 (after a dead-time if OCx(N) is implemented) when MOE=0</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OCx=1 (after a dead-time if OCx(N) is implemented) when MOE=0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TI1S</name>
                     <description>TI1 selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TI1S</name><usage>read-write</usage><enumeratedValue><name>Normal</name><description>The TIMx_CH1 pin is connected to TI1 input</description><value>0</value></enumeratedValue><enumeratedValue><name>XOR</name><description>The TIMx_CH1, CH2, CH3 pins are connected to TI1 input</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MMS</name>
                     <description>Master mode selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>MMS</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>The UG bit from the TIMx_EGR register is used as trigger output</description><value>0</value></enumeratedValue><enumeratedValue><name>Enable</name><description>The counter enable signal, CNT_EN, is used as trigger output</description><value>1</value></enumeratedValue><enumeratedValue><name>Update</name><description>The update event is selected as trigger output</description><value>2</value></enumeratedValue><enumeratedValue><name>ComparePulse</name><description>The trigger output send a positive pulse when the CC1IF flag it to be set, as soon as a capture or a compare match occurred</description><value>3</value></enumeratedValue><enumeratedValue><name>CompareOC1</name><description>OC1REF signal is used as trigger output</description><value>4</value></enumeratedValue><enumeratedValue><name>CompareOC2</name><description>OC2REF signal is used as trigger output</description><value>5</value></enumeratedValue><enumeratedValue><name>CompareOC3</name><description>OC3REF signal is used as trigger output</description><value>6</value></enumeratedValue><enumeratedValue><name>CompareOC4</name><description>OC4REF signal is used as trigger output</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CCDS</name>
                     <description>Capture/compare DMA               selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CCDS</name><usage>read-write</usage><enumeratedValue><name>OnCompare</name><description>CCx DMA request sent when CCx event occurs</description><value>0</value></enumeratedValue><enumeratedValue><name>OnUpdate</name><description>CCx DMA request sent when update event occurs</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CCUS</name>
                     <description>Capture/compare control update               selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CCUS</name><usage>read-write</usage><enumeratedValue><name>Bit</name><description>When capture/compare control bits are preloaded (CCPC=1), they are updated by setting the COMG bit only</description><value>0</value></enumeratedValue><enumeratedValue><name>BitOrEdge</name><description>When capture/compare control bits are preloaded (CCPC=1), they are updated by setting the COMG bit or when an rising edge occurs on TRGI</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CCPC</name>
                     <description>Capture/compare preloaded               control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CCPC</name><usage>read-write</usage><enumeratedValue><name>NotPreloaded</name><description>CCxE, CCxNE and OCxM bits are not preloaded</description><value>0</value></enumeratedValue><enumeratedValue><name>Preloaded</name><description>CCxE, CCxNE and OCxM bits are preloaded</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
