tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CCMR1_Input</name>
               <displayName>CCMR1_Input</displayName>
               <description>capture/compare mode register 1 (input           mode)</description>
               <alternateRegister>CCMR1_Output</alternateRegister>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC2F</name>
                     <description>Input capture 2 filter</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="IC1F"/>
            </field>
                  <field>
                     <name>IC2PSC</name>
                     <description>Input capture 2 prescaler</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="IC1PSC"/>
            </field>
                  <field>
                     <name>CC2S</name>
                     <description>Capture/compare 2               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="CC1S"/>
            </field>
                  <field>
                     <name>IC1F</name>
                     <description>Input capture 1 filter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>IC1F</name><usage>read-write</usage><enumeratedValue><name>NoFilter</name><description>No filter, sampling is done at fDTS</description><value>0</value></enumeratedValue><enumeratedValue><name>FCK_INT_N2</name><description>fSAMPLING=fCK_INT, N=2</description><value>1</value></enumeratedValue><enumeratedValue><name>FCK_INT_N4</name><description>fSAMPLING=fCK_INT, N=4</description><value>2</value></enumeratedValue><enumeratedValue><name>FCK_INT_N8</name><description>fSAMPLING=fCK_INT, N=8</description><value>3</value></enumeratedValue><enumeratedValue><name>FDTS_Div2_N6</name><description>fSAMPLING=fDTS/2, N=6</description><value>4</value></enumeratedValue><enumeratedValue><name>FDTS_Div2_N8</name><description>fSAMPLING=fDTS/2, N=8</description><value>5</value></enumeratedValue><enumeratedValue><name>FDTS_Div4_N6</name><description>fSAMPLING=fDTS/4, N=6</description><value>6</value></enumeratedValue><enumeratedValue><name>FDTS_Div4_N8</name><description>fSAMPLING=fDTS/4, N=8</description><value>7</value></enumeratedValue><enumeratedValue><name>FDTS_Div8_N6</name><description>fSAMPLING=fDTS/8, N=6</description><value>8</value></enumeratedValue><enumeratedValue><name>FDTS_Div8_N8</name><description>fSAMPLING=fDTS/8, N=8</description><value>9</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N5</name><description>fSAMPLING=fDTS/16, N=5</description><value>10</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N6</name><description>fSAMPLING=fDTS/16, N=6</description><value>11</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N8</name><description>fSAMPLING=fDTS/16, N=8</description><value>12</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N5</name><description>fSAMPLING=fDTS/32, N=5</description><value>13</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N6</name><description>fSAMPLING=fDTS/32, N=6</description><value>14</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N8</name><description>fSAMPLING=fDTS/32, N=8</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>IC1PSC</name>
                     <description>Input capture 1 prescaler</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>IC1PSC</name><usage>read-write</usage><enumeratedValue><name>Output</name><description>CCx channel is configured as output</description><value>0</value></enumeratedValue><enumeratedValue><name>Capture2</name><description>Capture is done once every 2 events</description><value>1</value></enumeratedValue><enumeratedValue><name>Capture4</name><description>Capture is done once every 4 events</description><value>2</value></enumeratedValue><enumeratedValue><name>Capture8</name><description>Capture is done once every 8 events</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1S</name>
                     <description>Capture/Compare 1               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CC1S</name><usage>read-write</usage><enumeratedValue><name>Output</name><description>CCx channel is configured as output</description><value>0</value></enumeratedValue><enumeratedValue><name>TI1</name><description>CCx channel is configured as input, ICx is mapped on TI1</description><value>1</value></enumeratedValue><enumeratedValue><name>TI2</name><description>CCx channel is configured as input, ICx is mapped on TI2</description><value>2</value></enumeratedValue><enumeratedValue><name>TRC</name><description>CCx channel is configured as input, ICx is mapped on TRC</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CCMR2_Output</name>
               <displayName>CCMR2_Output</displayName>
               <description>capture/compare mode register 2 (output           mode)</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OC4M_3</name>
                     <description>Output Compare 4 mode - bit               3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OC3M_3"/>
            </field>
                  <field>
                     <name>OC3M_3</name>
                     <description>Output Compare 3 mode - bit               3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OC3M_3</name><usage>read-write</usage><enumeratedValue><name>Normal</name><description>Normal output compare mode (modes 0-7)</description><value>0</value></enumeratedValue><enumeratedValue><name>Extended</name><description>Extended output compare mode (modes 7-15)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OC4CE</name>
                     <description>Output compare 4 clear               enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OC3CE"/>
            </field>
                  <field>
                     <name>OC4M</name>
                     <description>Output compare 4 mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues derivedFrom="OC3M"/>
            </field>
                  <field>
                     <name>OC4PE</name>
                     <description>Output compare 4 preload               enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OC3PE"/>
            </field>
                  <field>
                     <name>OC4FE</name>
                     <description>Output compare 4 fast               enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OC3FE"/>
            </field>
                  <field>
                     <name>CC4S</name>
                     <description>Capture/Compare 4               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="CC3S"/>
            </field>
                  <field>
                     <name>OC3CE</name>
                     <description>Output compare 3 clear               enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OC3CE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>OCxRef is not affected by the ocref_clr_int signal</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OCxRef is cleared as soon as a High level is detected on ocref_clr_int signal</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OC3M</name>
                     <description>Output compare 3 mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>OC3M</name><usage>read-write</usage><enumeratedValue><name>Frozen</name><description>The comparison between the output compare register TIMx_CCRy and the counter TIMx_CNT has no effect on the outputs / OpmMode1: Retriggerable OPM mode 1 - In up-counting mode, the channel is active until a trigger event is detected (on TRGI signal). In down-counting mode, the channel is inactive</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveOnMatch</name><description>Set channel to active level on match. OCyREF signal is forced high when the counter matches the capture/compare register / OpmMode2: Inversely to OpmMode1</description><value>1</value></enumeratedValue><enumeratedValue><name>InactiveOnMatch</name><description>Set channel to inactive level on match. OCyREF signal is forced low when the counter matches the capture/compare register / Reserved</description><value>2</value></enumeratedValue><enumeratedValue><name>Toggle</name><description>OCyREF toggles when TIMx_CNT=TIMx_CCRy / Reserved</description><value>3</value></enumeratedValue><enumeratedValue><name>ForceInactive</name><description>OCyREF is forced low / CombinedPwmMode1: OCyREF has the same behavior as in PWM mode 1. OCyREFC is the logical OR between OC1REF and OC2REF</description><value>4</value></enumeratedValue><enumeratedValue><name>ForceActive</name><description>OCyREF is forced high / CombinedPwmMode2: OCyREF has the same behavior as in PWM mode 2. OCyREFC is the logical AND between OC1REF and OC2REF</description><value>5</value></enumeratedValue><enumeratedValue><name>PwmMode1</name><description>In upcounting, channel is active as long as TIMx_CNT&lt;TIMx_CCRy else inactive. In downcounting, channel is inactive as long as TIMx_CNT&gt;TIMx_CCRy else active / AsymmetricPwmMode1: OCyREF has the same behavior as in PWM mode 1. OCyREFC outputs OC1REF when the counter is counting up, OC2REF when it is counting down</description><value>6</value></enumeratedValue><enumeratedValue><name>PwmMode2</name><description>Inversely to PwmMode1 / AsymmetricPwmMode2: Inversely to AsymmetricPwmMode1</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OC3PE</name>
                     <description>Output compare 3 preload               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OC3PE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Preload register on CCRx disabled. New values written to CCRx are taken into account immediately</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Preload register on CCRx enabled. Preload value is loaded into active register on each update event</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OC3FE</name>
                     <description>Output compare 3 fast               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OC3FE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Fast output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Fast output enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC3S</name>
                     <description>Capture/Compare 3               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CC3S</name><usage>read-write</usage><enumeratedValue><name>Output</name><description>CCx channel is configured as output</description><value>0</value></enumeratedValue><enumeratedValue><name>TI1</name><description>CCx channel is configured as input, ICx is mapped on TI1</description><value>1</value></enumeratedValue><enumeratedValue><name>TI2</name><description>CCx channel is configured as input, ICx is mapped on TI2</description><value>2</value></enumeratedValue><enumeratedValue><name>TRC</name><description>CCx channel is configured as input, ICx is mapped on TRC</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CCMR2_Input</name>
               <displayName>CCMR2_Input</displayName>
               <description>capture/compare mode register 2 (input           mode)</description>
               <alternateRegister>CCMR2_Output</alternateRegister>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC4F</name>
                     <description>Input capture 4 filter</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="IC3F"/>
            </field>
                  <field>
                     <name>IC4PSC</name>
                     <description>Input capture 4 prescaler</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="IC3PSC"/>
            </field>
                  <field>
                     <name>CC4S</name>
                     <description>Capture/Compare 4               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues derivedFrom="CC3S"/>
            </field>
                  <field>
                     <name>IC3F</name>
                     <description>Input capture 3 filter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>IC3F</name><usage>read-write</usage><enumeratedValue><name>NoFilter</name><description>No filter, sampling is done at fDTS</description><value>0</value></enumeratedValue><enumeratedValue><name>FCK_INT_N2</name><description>fSAMPLING=fCK_INT, N=2</description><value>1</value></enumeratedValue><enumeratedValue><name>FCK_INT_N4</name><description>fSAMPLING=fCK_INT, N=4</description><value>2</value></enumeratedValue><enumeratedValue><name>FCK_INT_N8</name><description>fSAMPLING=fCK_INT, N=8</description><value>3</value></enumeratedValue><enumeratedValue><name>FDTS_Div2_N6</name><description>fSAMPLING=fDTS/2, N=6</description><value>4</value></enumeratedValue><enumeratedValue><name>FDTS_Div2_N8</name><description>fSAMPLING=fDTS/2, N=8</description><value>5</value></enumeratedValue><enumeratedValue><name>FDTS_Div4_N6</name><description>fSAMPLING=fDTS/4, N=6</description><value>6</value></enumeratedValue><enumeratedValue><name>FDTS_Div4_N8</name><description>fSAMPLING=fDTS/4, N=8</description><value>7</value></enumeratedValue><enumeratedValue><name>FDTS_Div8_N6</name><description>fSAMPLING=fDTS/8, N=6</description><value>8</value></enumeratedValue><enumeratedValue><name>FDTS_Div8_N8</name><description>fSAMPLING=fDTS/8, N=8</description><value>9</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N5</name><description>fSAMPLING=fDTS/16, N=5</description><value>10</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N6</name><description>fSAMPLING=fDTS/16, N=6</description><value>11</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N8</name><description>fSAMPLING=fDTS/16, N=8</description><value>12</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N5</name><description>fSAMPLING=fDTS/32, N=5</description><value>13</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N6</name><description>fSAMPLING=fDTS/32, N=6</description><value>14</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N8</name><description>fSAMPLING=fDTS/32, N=8</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>IC3PSC</name>
                     <description>Input capture 3 prescaler</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>IC3PSC</name><usage>read-write</usage><enumeratedValue><name>Output</name><description>CCx channel is configured as output</description><value>0</value></enumeratedValue><enumeratedValue><name>Capture2</name><description>Capture is done once every 2 events</description><value>1</value></enumeratedValue><enumeratedValue><name>Capture4</name><description>Capture is done once every 4 events</description><value>2</value></enumeratedValue><enumeratedValue><name>Capture8</name><description>Capture is done once every 8 events</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC3S</name>
                     <description>Capture/Compare 3               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CC3S</name><usage>read-write</usage><enumeratedValue><name>Output</name><description>CCx channel is configured as output</description><value>0</value></enumeratedValue><enumeratedValue><name>TI1</name><description>CCx channel is configured as input, ICx is mapped on TI1</description><value>1</value></enumeratedValue><enumeratedValue><name>TI2</name><description>CCx channel is configured as input, ICx is mapped on TI2</description><value>2</value></enumeratedValue><enumeratedValue><name>TRC</name><description>CCx channel is configured as input, ICx is mapped on TRC</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
