tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CCER</name>
               <displayName>CCER</displayName>
               <description>capture/compare enable           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CC6P</name>
                     <description>CC6P</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1P"/>
            </field>
                  <field>
                     <name>CC6E</name>
                     <description>CC6E</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1E"/>
            </field>
                  <field>
                     <name>CC5P</name>
                     <description>CC5P</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1P"/>
            </field>
                  <field>
                     <name>CC5E</name>
                     <description>CC5E</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1E"/>
            </field>
                  <field>
                     <name>CC4P</name>
                     <description>CC4P</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1P"/>
            </field>
                  <field>
                     <name>CC4E</name>
                     <description>CC4E</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1E"/>
            </field>
                  <field>
                     <name>CC3NP</name>
                     <description>CC3NP</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1NP"/>
            </field>
                  <field>
                     <name>CC3NE</name>
                     <description>CC3NE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1NE"/>
            </field>
                  <field>
                     <name>CC3P</name>
                     <description>CC3P</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1P"/>
            </field>
                  <field>
                     <name>CC3E</name>
                     <description>CC3E</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1E"/>
            </field>
                  <field>
                     <name>CC2NP</name>
                     <description>CC2NP</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1NP"/>
            </field>
                  <field>
                     <name>CC2NE</name>
                     <description>CC2NE</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1NE"/>
            </field>
                  <field>
                     <name>CC2P</name>
                     <description>CC2P</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1P"/>
            </field>
                  <field>
                     <name>CC2E</name>
                     <description>CC2E</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1E"/>
            </field>
                  <field>
                     <name>CC1NP</name>
                     <description>CC1NP</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1NP</name><usage>read-write</usage><enumeratedValue><name>ActiveHigh</name><description>OCxN active high</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveLow</name><description>OCxN active low</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1NE</name>
                     <description>CC1NE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1NE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Complementary output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Complementary output enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1P</name>
                     <description>CC1P</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1P</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>Noninverted/rising edge</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Inverted/falling edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1E</name>
                     <description>CC1E</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Capture disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Capture enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <displayName>CNT</displayName>
               <description>counter</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UIFCPY</name>
                     <description>UIF copy</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNT</name>
                     <description>CNT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>PSC</name>
               <displayName>PSC</displayName>
               <description>prescaler</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>PSC</name>
                     <description>Prescaler value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>ARR</name>
               <displayName>ARR</displayName>
               <description>auto-reload register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>ARR</name>
                     <description>Auto-reload value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>RCR</name>
               <displayName>RCR</displayName>
               <description>repetition counter register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>REP</name>
                     <description>Repetition counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR1</name>
               <displayName>CCR1</displayName>
               <description>capture/compare register 1</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CCR1</name>
                     <description>Capture/Compare 1 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR2</name>
               <displayName>CCR2</displayName>
               <description>capture/compare register 2</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CCR2</name>
                     <description>Capture/Compare 2 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR3</name>
               <displayName>CCR3</displayName>
               <description>capture/compare register 3</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CCR3</name>
                     <description>Capture/Compare value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR4</name>
               <displayName>CCR4</displayName>
               <description>capture/compare register 4</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CCR4</name>
                     <description>Capture/Compare value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
