tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>BDTR</name>
               <displayName>BDTR</displayName>
               <description>break and dead-time register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BK2BID</name>
                     <description>Break2 bidirectional</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BK2BID</name><usage>read-write</usage><enumeratedValue><name>Input</name><description>Break input BRK2 in input mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Bidirectional</name><description>Break input BRK2 in bidirectional mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKBID</name>
                     <description>BKBID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKBID</name><usage>read-write</usage><enumeratedValue><name>Input</name><description>Break input BRK in input mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Bidirectional</name><description>Break input BRK in bidirectional mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BK2DSRM</name>
                     <description>Break2 Disarm</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BK2DSRM</name><usage>read-write</usage><enumeratedValue><name>Armed</name><description>Break input BRK2 is armed</description><value>0</value></enumeratedValue><enumeratedValue><name>Disarmed</name><description>Break input BRK2 is disarmed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKDSRM</name>
                     <description>BKDSRM</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKDSRM</name><usage>read-write</usage><enumeratedValue><name>Armed</name><description>Break input BRK is armed</description><value>0</value></enumeratedValue><enumeratedValue><name>Disarmed</name><description>Break input BRK is disarmed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BK2P</name>
                     <description>Break 2 polarity</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BK2P</name><usage>read-write</usage><enumeratedValue><name>Low</name><description>Break input BRK2 is active low</description><value>0</value></enumeratedValue><enumeratedValue><name>High</name><description>Break input BRK2 is active high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BK2E</name>
                     <description>Break 2 enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BK2E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Break function disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Break function enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BK2F</name>
                     <description>Break 2 filter</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>BK2F</name><usage>read-write</usage><enumeratedValue><name>NoFilter</name><description>No filter, sampling is done at fDTS</description><value>0</value></enumeratedValue><enumeratedValue><name>FCK_INT_N2</name><description>fSAMPLING=fCK_INT, N=2</description><value>1</value></enumeratedValue><enumeratedValue><name>FCK_INT_N4</name><description>fSAMPLING=fCK_INT, N=4</description><value>2</value></enumeratedValue><enumeratedValue><name>FCK_INT_N8</name><description>fSAMPLING=fCK_INT, N=8</description><value>3</value></enumeratedValue><enumeratedValue><name>FDTS_Div2_N6</name><description>fSAMPLING=fDTS/2, N=6</description><value>4</value></enumeratedValue><enumeratedValue><name>FDTS_Div2_N8</name><description>fSAMPLING=fDTS/2, N=8</description><value>5</value></enumeratedValue><enumeratedValue><name>FDTS_Div4_N6</name><description>fSAMPLING=fDTS/4, N=6</description><value>6</value></enumeratedValue><enumeratedValue><name>FDTS_Div4_N8</name><description>fSAMPLING=fDTS/4, N=8</description><value>7</value></enumeratedValue><enumeratedValue><name>FDTS_Div8_N6</name><description>fSAMPLING=fDTS/8, N=6</description><value>8</value></enumeratedValue><enumeratedValue><name>FDTS_Div8_N8</name><description>fSAMPLING=fDTS/8, N=8</description><value>9</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N5</name><description>fSAMPLING=fDTS/16, N=5</description><value>10</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N6</name><description>fSAMPLING=fDTS/16, N=6</description><value>11</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N8</name><description>fSAMPLING=fDTS/16, N=8</description><value>12</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N5</name><description>fSAMPLING=fDTS/32, N=5</description><value>13</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N6</name><description>fSAMPLING=fDTS/32, N=6</description><value>14</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N8</name><description>fSAMPLING=fDTS/32, N=8</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKF</name>
                     <description>Break filter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>BKF</name><usage>read-write</usage><enumeratedValue><name>NoFilter</name><description>No filter, sampling is done at fDTS</description><value>0</value></enumeratedValue><enumeratedValue><name>FCK_INT_N2</name><description>fSAMPLING=fCK_INT, N=2</description><value>1</value></enumeratedValue><enumeratedValue><name>FCK_INT_N4</name><description>fSAMPLING=fCK_INT, N=4</description><value>2</value></enumeratedValue><enumeratedValue><name>FCK_INT_N8</name><description>fSAMPLING=fCK_INT, N=8</description><value>3</value></enumeratedValue><enumeratedValue><name>FDTS_Div2_N6</name><description>fSAMPLING=fDTS/2, N=6</description><value>4</value></enumeratedValue><enumeratedValue><name>FDTS_Div2_N8</name><description>fSAMPLING=fDTS/2, N=8</description><value>5</value></enumeratedValue><enumeratedValue><name>FDTS_Div4_N6</name><description>fSAMPLING=fDTS/4, N=6</description><value>6</value></enumeratedValue><enumeratedValue><name>FDTS_Div4_N8</name><description>fSAMPLING=fDTS/4, N=8</description><value>7</value></enumeratedValue><enumeratedValue><name>FDTS_Div8_N6</name><description>fSAMPLING=fDTS/8, N=6</description><value>8</value></enumeratedValue><enumeratedValue><name>FDTS_Div8_N8</name><description>fSAMPLING=fDTS/8, N=8</description><value>9</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N5</name><description>fSAMPLING=fDTS/16, N=5</description><value>10</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N6</name><description>fSAMPLING=fDTS/16, N=6</description><value>11</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N8</name><description>fSAMPLING=fDTS/16, N=8</description><value>12</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N5</name><description>fSAMPLING=fDTS/32, N=5</description><value>13</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N6</name><description>fSAMPLING=fDTS/32, N=6</description><value>14</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N8</name><description>fSAMPLING=fDTS/32, N=8</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MOE</name>
                     <description>Main output enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MOE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>In response to a break 2 event OC and OCN outputs are disabled - In response to a break event or if MOE is written to 0 OC and OCN outputs are disabled or forced to idle state depending on the OSSI bit</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OC and OCN outputs are enabled if their respective enable bits are set (CCxE, CCxNE in TIMx_CCER register)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AOE</name>
                     <description>Automatic output enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>AOE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MOE can be set only by software</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MOE can be set by software or automatically at the next update event (if none of the break inputs BRK and BRK2 is active)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKP</name>
                     <description>Break polarity</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKP</name><usage>read-write</usage><enumeratedValue><name>ActiveLow</name><description>Break input BRK is active low</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveHigh</name><description>Break input BRK is active high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKE</name>
                     <description>Break enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Break function disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Break function enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OSSR</name>
                     <description>Off-state selection for Run               mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OSSR</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>OC/OCN outputs are disabled when inactive</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OC/OCN outputs are enabled with their inactive level as soon as CCxE=1 or CCxNE=1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OSSI</name>
                     <description>Off-state selection for Idle               mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OSSI</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>OC/OCN outputs are disabled when inactive</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OC/OCN outputs are first forced with their inactive level then forced to their idle level after the deadtime</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock configuration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>LOCK</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>No write protection</description><value>0</value></enumeratedValue><enumeratedValue><name>Level1</name><description>Level 1 write protection</description><value>1</value></enumeratedValue><enumeratedValue><name>Level2</name><description>Level 2 write protection</description><value>2</value></enumeratedValue><enumeratedValue><name>Level3</name><description>Level 3 write protection</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DTG</name>
                     <description>Dead-time generator setup</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DCR</name>
               <displayName>DCR</displayName>
               <description>DMA control register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DBL</name>
                     <description>DMA burst length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>17</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>DBA</name>
                     <description>DMA base address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DMAR</name>
               <displayName>DMAR</displayName>
               <description>DMA address for full transfer</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DMAB</name>
                     <description>DMA register for burst               accesses</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>OR1</name>
               <displayName>OR1</displayName>
               <description>option register 1</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TI1_RMP</name>
                     <description>Input Capture 1 remap</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TI1_RMP</name><usage>read-write</usage><enumeratedValue><name>IO</name><description>TIM1 input capture 1 is connected to I/O</description><value>0</value></enumeratedValue><enumeratedValue><name>COMP1</name><description>TIM1 input capture 1 is connected to COMP1 output</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TIM1_ETR_ADC1_RMP</name>
                     <description>TIM1_ETR_ADC1 remapping               capability</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>TIM1_ETR_ADC1_RMP</name><usage>read-write</usage><enumeratedValue><name>Select</name><description>TIM1_ETR is not connected to ADC AWDx (must be selected when the ETR comes from the ETR input pin)</description><value>0</value></enumeratedValue><enumeratedValue><name>ADC_AWD1</name><description>TIM1_ETR is connected to ADC AWD1</description><value>1</value></enumeratedValue><enumeratedValue><name>ADC_AWD2</name><description>TIM1_ETR is connected to ADC AWD2</description><value>2</value></enumeratedValue><enumeratedValue><name>ADC_AWD3</name><description>TIM1_ETR is connected to ADC AWD3</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
