tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CCMR3_Output</name>
               <displayName>CCMR3OutputComparemode</displayName>
               <description>capture/compare mode register           3</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>OC6M_3</name>
                     <description>OC6M</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OC5M_3"/>
            </field>
                  <field>
                     <name>OC5M_3</name>
                     <description>OC5M</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OC5M_3</name><usage>read-write</usage><enumeratedValue><name>Normal</name><description>Normal output compare mode (modes 0-7)</description><value>0</value></enumeratedValue><enumeratedValue><name>Extended</name><description>Extended output compare mode (modes 7-15)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OC6CE</name>
                     <description>OC6CE</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OC5CE"/>
            </field>
                  <field>
                     <name>OC6M</name>
                     <description>OC6M</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues derivedFrom="OC5M"/>
            </field>
                  <field>
                     <name>OC6PE</name>
                     <description>OC6PE</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OC5PE"/>
            </field>
                  <field>
                     <name>OC6FE</name>
                     <description>OC6FE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="OC5FE"/>
            </field>
                  <field>
                     <name>OC5CE</name>
                     <description>OC5CE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OC5CE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>OCxRef is not affected by the ocref_clr_int signal</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OCxRef is cleared as soon as a High level is detected on ocref_clr_int signal</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OC5M</name>
                     <description>OC5M</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>OC5M</name><usage>read-write</usage><enumeratedValue><name>Frozen</name><description>The comparison between the output compare register TIMx_CCRy and the counter TIMx_CNT has no effect on the outputs / OpmMode1: Retriggerable OPM mode 1 - In up-counting mode, the channel is active until a trigger event is detected (on TRGI signal). In down-counting mode, the channel is inactive</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveOnMatch</name><description>Set channel to active level on match. OCyREF signal is forced high when the counter matches the capture/compare register / OpmMode2: Inversely to OpmMode1</description><value>1</value></enumeratedValue><enumeratedValue><name>InactiveOnMatch</name><description>Set channel to inactive level on match. OCyREF signal is forced low when the counter matches the capture/compare register / Reserved</description><value>2</value></enumeratedValue><enumeratedValue><name>Toggle</name><description>OCyREF toggles when TIMx_CNT=TIMx_CCRy / Reserved</description><value>3</value></enumeratedValue><enumeratedValue><name>ForceInactive</name><description>OCyREF is forced low / CombinedPwmMode1: OCyREF has the same behavior as in PWM mode 1. OCyREFC is the logical OR between OC1REF and OC2REF</description><value>4</value></enumeratedValue><enumeratedValue><name>ForceActive</name><description>OCyREF is forced high / CombinedPwmMode2: OCyREF has the same behavior as in PWM mode 2. OCyREFC is the logical AND between OC1REF and OC2REF</description><value>5</value></enumeratedValue><enumeratedValue><name>PwmMode1</name><description>In upcounting, channel is active as long as TIMx_CNT&lt;TIMx_CCRy else inactive. In downcounting, channel is inactive as long as TIMx_CNT&gt;TIMx_CCRy else active / AsymmetricPwmMode1: OCyREF has the same behavior as in PWM mode 1. OCyREFC outputs OC1REF when the counter is counting up, OC2REF when it is counting down</description><value>6</value></enumeratedValue><enumeratedValue><name>PwmMode2</name><description>Inversely to PwmMode1 / AsymmetricPwmMode2: Inversely to AsymmetricPwmMode1</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OC5PE</name>
                     <description>OC5PE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OC5PE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Preload register on CCRx disabled. New values written to CCRx are taken into account immediately</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Preload register on CCRx enabled. Preload value is loaded into active register on each update event</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OC5FE</name>
                     <description>OC5FE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OC5FE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Fast output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Fast output enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR5</name>
               <displayName>CCR5</displayName>
               <description>capture/compare register 5</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GC5C3</name>
                     <description>Group Channel 5 and Channel               3</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GC5C3</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No effect of OC5REF on OC3REFC</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OC3REFC is the logical AND of OC3REFC and OC5REF</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>GC5C2</name>
                     <description>Group Channel 5 and Channel               2</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GC5C2</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No effect of OC5REF on OC2REFC</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OC2REFC is the logical AND of OC2REFC and OC5REF</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>GC5C1</name>
                     <description>Group Channel 5 and Channel               1</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>GC5C1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No effect of OC5REF on OC1REFC</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OC1REFC is the logical AND of OC1REFC and OC5REF</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CCR5</name>
                     <description>Capture/Compare 5 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR6</name>
               <displayName>CCR6</displayName>
               <description>capture/compare register 6</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CCR6</name>
                     <description>Capture/Compare 6 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>AF1</name>
               <displayName>AF1</displayName>
               <description>alternate function option register           1</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>ETRSEL</name>
                     <description>ETR source selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>ETRSEL</name><usage>read-write</usage><enumeratedValue><name>Legacy</name><description>ETR legacy mode</description><value>0</value></enumeratedValue><enumeratedValue><name>COMP1</name><description>COMP1 output</description><value>1</value></enumeratedValue><enumeratedValue><name>COMP2</name><description>COMP2 output</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKCMP2P</name>
                     <description>BRK COMP2 input polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP2P</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKCMP1P</name>
                     <description>BRK COMP1 input polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP1P</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKINP</name>
                     <description>BRK BKIN input polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKINP</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKCMP2E</name>
                     <description>BRK COMP2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP2E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>COMP2 input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>COMP2 input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKCMP1E</name>
                     <description>BRK COMP1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP1E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>COMP1 input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>COMP1 input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKINE</name>
                     <description>BRK BKIN input enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKINE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>BKIN input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>BKIN input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>AF2</name>
               <displayName>AF2</displayName>
               <description>Alternate function register 2</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>BK2CMP2P</name>
                     <description>BRK2 COMP2 input polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BK2CMP2P</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BK2CMP1P</name>
                     <description>BRK2 COMP1 input polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BK2CMP1P</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BK2INP</name>
                     <description>BRK2 BKIN2 input polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BK2INP</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BK2CMP2E</name>
                     <description>BRK2 COMP2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BK2CMP2E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>COMP2 input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>COMP2 input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BK2CMP1E</name>
                     <description>BRK2 COMP1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BK2CMP1E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>COMP1 input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>COMP1 input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BK2INE</name>
                     <description>BRK2 BKIN input enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BK2INE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>BKIN input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>BKIN input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>TISEL</name>
               <displayName>TISEL</displayName>
               <description>timer input selection register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TI4SEL</name>
                     <description>selects TI4[0] to TI4[15]               input</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="TI1SEL"/>
            </field>
                  <field>
                     <name>TI3SEL</name>
                     <description>selects TI3[0] to TI3[15]               input</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="TI1SEL"/>
            </field>
                  <field>
                     <name>TI2SEL</name>
                     <description>selects TI2[0] to TI2[15]               input</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="TI1SEL"/>
            </field>
                  <field>
                     <name>TI1SEL</name>
                     <description>selects TI1[0] to TI1[15]               input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>TI1SEL</name><usage>read-write</usage><enumeratedValue><name>Selected</name><description>TIM1_CHx input selected</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
