tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CCER</name>
               <displayName>CCER</displayName>
               <description>capture/compare enable           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CC4NP</name>
                     <description>Capture/Compare 4 output               Polarity</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1NP"/>
            </field>
                  <field>
                     <name>CC4P</name>
                     <description>Capture/Compare 3 output               Polarity</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1P"/>
            </field>
                  <field>
                     <name>CC4E</name>
                     <description>Capture/Compare 4 output               enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1E"/>
            </field>
                  <field>
                     <name>CC3NP</name>
                     <description>Capture/Compare 3 output               Polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1NP"/>
            </field>
                  <field>
                     <name>CC3P</name>
                     <description>Capture/Compare 3 output               Polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1P"/>
            </field>
                  <field>
                     <name>CC3E</name>
                     <description>Capture/Compare 3 output               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1E"/>
            </field>
                  <field>
                     <name>CC2NP</name>
                     <description>Capture/Compare 2 output               Polarity</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1NP"/>
            </field>
                  <field>
                     <name>CC2P</name>
                     <description>Capture/Compare 2 output               Polarity</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1P"/>
            </field>
                  <field>
                     <name>CC2E</name>
                     <description>Capture/Compare 2 output               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues derivedFrom="CC1E"/>
            </field>
                  <field>
                     <name>CC1NP</name>
                     <description>Capture/Compare 1 output               Polarity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1NP</name><usage>read-write</usage><enumeratedValue><name>ActiveHigh</name><description>OCxN active high</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveLow</name><description>OCxN active low</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1P</name>
                     <description>Capture/Compare 1 output               Polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1P</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>Noninverted/rising edge</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Inverted/falling edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1E</name>
                     <description>Capture/Compare 1 output               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Capture disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Capture enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <displayName>CNT</displayName>
               <description>counter</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field></fields>
            </register>
            <register>
               <name>PSC</name>
               <displayName>PSC</displayName>
               <description>prescaler</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>PSC</name>
                     <description>Prescaler value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>ARR</name>
               <displayName>ARR</displayName>
               <description>auto-reload register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field><name>ARR</name><description>Auto-reload value</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field></fields>
            </register>
            <register>
               <name>CCR1</name>
               <displayName>CCR1</displayName>
               <description>capture/compare register 1</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field><name>CCR1</name><description>Capture/Compare 1 value</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field></fields>
            </register>
            <register>
               <name>CCR2</name>
               <displayName>CCR2</displayName>
               <description>capture/compare register 2</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field><name>CCR2</name><description>Capture/Compare 2 value</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field></fields>
            </register>
            <register>
               <name>CCR3</name>
               <displayName>CCR3</displayName>
               <description>capture/compare register 3</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field><name>CCR3</name><description>Capture/Compare 3 value</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field></fields>
            </register>
            <register>
               <name>CCR4</name>
               <displayName>CCR4</displayName>
               <description>capture/compare register 4</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field><name>CCR4</name><description>Capture/Compare 4 value</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field></fields>
            </register>
            <register>
               <name>DCR</name>
               <displayName>DCR</displayName>
               <description>DMA control register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DBL</name>
                     <description>DMA burst length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>17</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>DBA</name>
                     <description>DMA base address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DMAR</name>
               <displayName>DMAR</displayName>
               <description>DMA address for full transfer</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DMAB</name>
                     <description>DMA register for burst               accesses</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>OR1</name>
               <displayName>OR1</displayName>
               <description>TIM2 option register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TI4_RMP</name>
                     <description>Input capture 4 remap</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>TI4_RMP</name><usage>read-write</usage><enumeratedValue><name>GPIO</name><description>TIM2 TI4 is connected to GPIO: Refer to Alternate Function mapping</description><value>0</value></enumeratedValue><enumeratedValue><name>COMP_1</name><description>TIM2 TI4 is connected to COMP1_OUT</description><value>1</value></enumeratedValue><enumeratedValue><name>COMP_2</name><description>TIM2 TI4 is connected to COMP2_OUT</description><value>2</value></enumeratedValue><enumeratedValue><name>COMP_12</name><description>TIM2 TI4 is connected to a logical OR between COMP1_OUT and COMP2_OUT</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ETR_RMP</name>
                     <description>External trigger remap</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ETR_RMP</name><usage>read-write</usage><enumeratedValue><name>GPIO</name><description>TIM2 ETR is connected to GPIO: Refer to Alternate Function mapping</description><value>0</value></enumeratedValue><enumeratedValue><name>TIM2_ETR</name><description>LSE internal clock is connected to TIM2_ETR input</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>AF1</name>
               <displayName>AF1</displayName>
               <description>TIM2 alternate function option register           1</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ETRSEL</name>
                     <description>External trigger source               selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>ETRSEL</name><usage>read-write</usage><enumeratedValue><name>Legacy</name><description>ETR legacy mode</description><value>0</value></enumeratedValue><enumeratedValue><name>COMP1</name><description>COMP1 output</description><value>1</value></enumeratedValue><enumeratedValue><name>COMP2</name><description>COMP2 output</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>TISEL</name>
               <displayName>TISEL</displayName>
               <description>TIM2 timer input selection           register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TI1SEL</name>
                     <description>TI1SEL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>TI1SEL</name><usage>read-write</usage><enumeratedValue><name>Selected</name><description>TIM1_CHx input selected</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TI2SEL</name>
                     <description>TI2SEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues derivedFrom="TI1SEL"/>
            </field>
               </fields>
            </register>
