tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>CCMR1_Output</name>
               <displayName>CCMR1_Output</displayName>
               <description>TIM16/TIM17 capture/compare mode register           1</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>OC1M_3</name>
                     <description>OC1M</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC1M</name>
                     <description>OC1M</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  <enumeratedValues><name>OC1M</name><usage>read-write</usage><enumeratedValue><name>Frozen</name><description>The comparison between the output compare register TIMx_CCRy and the counter TIMx_CNT has no effect on the outputs</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveOnMatch</name><description>Set channel to active level on match. OCyREF signal is forced high when the counter matches the capture/compare register</description><value>1</value></enumeratedValue><enumeratedValue><name>InactiveOnMatch</name><description>Set channel to inactive level on match. OCyREF signal is forced low when the counter matches the capture/compare register</description><value>2</value></enumeratedValue><enumeratedValue><name>Toggle</name><description>OCyREF toggles when TIMx_CNT=TIMx_CCRy</description><value>3</value></enumeratedValue><enumeratedValue><name>ForceInactive</name><description>OCyREF is forced low</description><value>4</value></enumeratedValue><enumeratedValue><name>ForceActive</name><description>OCyREF is forced high</description><value>5</value></enumeratedValue><enumeratedValue><name>PwmMode1</name><description>In upcounting, channel is active as long as TIMx_CNT&lt;TIMx_CCRy else inactive. In downcounting, channel is inactive as long as TIMx_CNT&gt;TIMx_CCRy else active</description><value>6</value></enumeratedValue><enumeratedValue><name>PwmMode2</name><description>Inversely to PwmMode1</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OC1PE</name>
                     <description>OC1PE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OC1PE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Preload register on CCRx disabled. New values written to CCRx are taken into account immediately</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Preload register on CCRx enabled. Preload value is loaded into active register on each update event</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OC1FE</name>
                     <description>OC1FE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OC1FE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Fast output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Fast output enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1S</name>
                     <description>CC1S</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CC1S</name><usage>read-write</usage><enumeratedValue><name>Output</name><description>CCx channel is configured as output</description><value>0</value></enumeratedValue><enumeratedValue><name>TI1</name><description>CCx channel is configured as input, ICx is mapped on TI1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CCMR1_Input</name>
               <displayName>CCMR1_Input</displayName>
               <description>TIM16/TIM17 capture/compare mode register           1</description>
               <alternateRegister>CCMR1_Output</alternateRegister>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>IC1F</name>
                     <description>IC1F</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>IC1F</name><usage>read-write</usage><enumeratedValue><name>NoFilter</name><description>No filter, sampling is done at fDTS</description><value>0</value></enumeratedValue><enumeratedValue><name>FCK_INT_N2</name><description>fSAMPLING=fCK_INT, N=2</description><value>1</value></enumeratedValue><enumeratedValue><name>FCK_INT_N4</name><description>fSAMPLING=fCK_INT, N=4</description><value>2</value></enumeratedValue><enumeratedValue><name>FCK_INT_N8</name><description>fSAMPLING=fCK_INT, N=8</description><value>3</value></enumeratedValue><enumeratedValue><name>FDTS_Div2_N6</name><description>fSAMPLING=fDTS/2, N=6</description><value>4</value></enumeratedValue><enumeratedValue><name>FDTS_Div2_N8</name><description>fSAMPLING=fDTS/2, N=8</description><value>5</value></enumeratedValue><enumeratedValue><name>FDTS_Div4_N6</name><description>fSAMPLING=fDTS/4, N=6</description><value>6</value></enumeratedValue><enumeratedValue><name>FDTS_Div4_N8</name><description>fSAMPLING=fDTS/4, N=8</description><value>7</value></enumeratedValue><enumeratedValue><name>FDTS_Div8_N6</name><description>fSAMPLING=fDTS/8, N=6</description><value>8</value></enumeratedValue><enumeratedValue><name>FDTS_Div8_N8</name><description>fSAMPLING=fDTS/8, N=8</description><value>9</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N5</name><description>fSAMPLING=fDTS/16, N=5</description><value>10</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N6</name><description>fSAMPLING=fDTS/16, N=6</description><value>11</value></enumeratedValue><enumeratedValue><name>FDTS_Div16_N8</name><description>fSAMPLING=fDTS/16, N=8</description><value>12</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N5</name><description>fSAMPLING=fDTS/32, N=5</description><value>13</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N6</name><description>fSAMPLING=fDTS/32, N=6</description><value>14</value></enumeratedValue><enumeratedValue><name>FDTS_Div32_N8</name><description>fSAMPLING=fDTS/32, N=8</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>IC1PSC</name>
                     <description>IC1PSC</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>IC1PSC</name><usage>read-write</usage><enumeratedValue><name>Output</name><description>CCx channel is configured as output</description><value>0</value></enumeratedValue><enumeratedValue><name>Capture_2</name><description>Capture is done once every 2 events</description><value>1</value></enumeratedValue><enumeratedValue><name>Capture_4</name><description>Capture is done once every 4 events</description><value>2</value></enumeratedValue><enumeratedValue><name>Capture_8</name><description>Capture is done once every 8 events</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1S</name>
                     <description>CC1S</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>CC1S</name><usage>read-write</usage><enumeratedValue><name>Output</name><description>CCx channel is configured as output</description><value>0</value></enumeratedValue><enumeratedValue><name>TI1</name><description>CCx channel is configured as input, ICx is mapped on TI1</description><value>1</value></enumeratedValue><enumeratedValue><name>TI2</name><description>CCx channel is configured as input, ICx is mapped on TI2</description><value>2</value></enumeratedValue><enumeratedValue><name>TRC</name><description>CCx channel is configured as input, ICx is mapped on TRC</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CCER</name>
               <displayName>CCER</displayName>
               <description>TIM16/TIM17 capture/compare enable           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CC1NP</name>
                     <description>Capture/Compare 1 complementary output               polarity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1NP</name><usage>read-write</usage><enumeratedValue><name>ActiveHigh</name><description>OCxN active high</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveLow</name><description>OCxN active low</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1NE</name>
                     <description>Capture/Compare 1 complementary output               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1NE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Complementary output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Complementary output enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1P</name>
                     <description>Capture/Compare 1 output               polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1P</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>Noninverted/rising edge</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>Inverted/falling edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CC1E</name>
                     <description>Capture/Compare 1 output               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CC1E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Capture disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Capture enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <displayName>CNT</displayName>
               <description>TIM16/TIM17 counter</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UIFCPYorRes</name>
                     <description>UIF Copy</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNT</name>
                     <description>CNT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>PSC</name>
               <displayName>PSC</displayName>
               <description>TIM16/TIM17 prescaler</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>PSC</name>
                     <description>Prescaler value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>ARR</name>
               <displayName>ARR</displayName>
               <description>TIM16/TIM17 auto-reload           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>ARR</name>
                     <description>Auto-reload value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>RCR</name>
               <displayName>RCR</displayName>
               <description>TIM16/TIM17 repetition counter           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>REP</name>
                     <description>Repetition counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR1</name>
               <displayName>CCR1</displayName>
               <description>TIM16/TIM17 capture/compare register           1</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CCR1</name>
                     <description>Capture/Compare 1 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>BDTR</name>
               <displayName>BDTR</displayName>
               <description>TIM16/TIM17 break and dead-time           register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKBID</name>
                     <description>Break Bidirectional</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKBID</name><usage>read-write</usage><enumeratedValue><name>Input</name><description>Break input BRK in input mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Bidirectional</name><description>Break input BRK in bidirectional mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKDSRM</name>
                     <description>Break Disarm</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKDSRM</name><usage>read-write</usage><enumeratedValue><name>Armed</name><description>Break input BRK is armed</description><value>0</value></enumeratedValue><enumeratedValue><name>Disarmed</name><description>Break input BRK is disarmed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MOE</name>
                     <description>Main output enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MOE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>OC and OCN outputs are disabled or forced to idle state depending on the OSSI bit</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OC and OCN outputs are enabled if their respective enable bits are set (CCxE, CCxNE in TIMx_CCER register)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>AOE</name>
                     <description>Automatic output enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>AOE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MOE can be set only by software</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MOE can be set by software or automatically at the next update event (if none of the break inputs BRK and BRK2 is active)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKP</name>
                     <description>Break polarity</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKP</name><usage>read-write</usage><enumeratedValue><name>ActiveLow</name><description>Break input BRK is active low</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveHigh</name><description>Break input BRK is active high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKE</name>
                     <description>Break enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Break inputs (BRK and CCS clock failure event) disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Break inputs (BRK and CCS clock failure event) enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OSSR</name>
                     <description>Off-state selection for Run               mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OSSR</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>OC/OCN outputs are disabled when inactive</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OC/OCN outputs are enabled with their inactive level as soon as CCxE=1 or CCxNE=1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OSSI</name>
                     <description>Off-state selection for Idle               mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OSSI</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>OC/OCN outputs are disabled when inactive</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>OC/OCN outputs are first forced with their inactive level then forced to their idle level after the deadtime</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock configuration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>LOCK</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>No write protection</description><value>0</value></enumeratedValue><enumeratedValue><name>Level1</name><description>Level 1 write protection</description><value>1</value></enumeratedValue><enumeratedValue><name>Level2</name><description>Level 2 write protection</description><value>2</value></enumeratedValue><enumeratedValue><name>Level3</name><description>Level 3 write protection</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>DTG</name>
                     <description>Dead-time generator setup</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
