tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>DCR</name>
               <displayName>DCR</displayName>
               <description>TIM16/TIM17 DMA control           register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DBL</name>
                     <description>DMA burst length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>17</maximum></range></writeConstraint>
            </field>
                  <field>
                     <name>DBA</name>
                     <description>DMA base address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>DMAR</name>
               <displayName>DMAR</displayName>
               <description>TIM16/TIM17 DMA address for full           transfer</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DMAB</name>
                     <description>DMA register for burst               accesses</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>OR1</name>
               <displayName>OR1</displayName>
               <description>TIM16 option register 1</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TI1_RMP</name>
                     <description>Timer 17 input 1               connection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  <enumeratedValues><name>TI1_RMP</name><usage>read-write</usage><enumeratedValue><name>GPIO</name><description>TI1 is connected to GPIO</description><value>0</value></enumeratedValue><enumeratedValue><name>LSI</name><description>TI1 is connected to LSI</description><value>1</value></enumeratedValue><enumeratedValue><name>LSE</name><description>TI1 is connected to LSE</description><value>2</value></enumeratedValue><enumeratedValue><name>RTC</name><description>TI1 is connected to RTC wake-up interrupt</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>AF1</name>
               <displayName>AF1</displayName>
               <description>TIM16 alternate function register           1</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>BKCMP2P</name>
                     <description>BRK COMP2 input polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP2P</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKCMP1P</name>
                     <description>BRK COMP1 input polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP1P</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKINP</name>
                     <description>BRK BKIN input polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKINP</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKCMP2E</name>
                     <description>BRK COMP2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP2E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>COMP2 input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>COMP2 input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKCMP1E</name>
                     <description>BRK COMP1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP1E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>COMP1 input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>COMP1 input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKINE</name>
                     <description>BRK BKIN input enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKINE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>BKIN input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>BKIN input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>TISEL</name>
               <displayName>TISEL</displayName>
               <description>TIM16 input selection register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TISEL</name>
                     <description>TISEL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>TISEL</name><usage>read-write</usage><enumeratedValue><name>Selected</name><description>TIM1_CH1 input selected</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
