tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>AF1</name>
               <displayName>AF1</displayName>
               <description>TIM17 alternate function register           1</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>BKCMP2P</name>
                     <description>BRK COMP2 input polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP2P</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKCMP1P</name>
                     <description>BRK COMP1 input polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP1P</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKINP</name>
                     <description>BRK BKIN input polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKINP</name><usage>read-write</usage><enumeratedValue><name>NotInverted</name><description>Input polarity not inverted</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>Input polarity inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKCMP2E</name>
                     <description>BRK COMP2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP2E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>COMP2 input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>COMP2 input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKCMP1E</name>
                     <description>BRK COMP1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKCMP1E</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>COMP1 input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>COMP1 input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>BKINE</name>
                     <description>BRK BKIN input enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>BKINE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>BKIN input disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>BKIN input enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>TISEL</name>
               <displayName>TISEL</displayName>
               <description>TIM17 input selection register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TISEL</name>
                     <description>TISEL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>TISEL</name><usage>read-write</usage><enumeratedValue><name>Selected</name><description>TIM1_CH1 input selected</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>USART1</name>
         <description>Universal synchronous asynchronous receiver       transmitter</description>
         <groupName>USART</groupName>
         <baseAddress>0x40013800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>USART1</name>
            <description>USART1 global interrupt</description>
            <value>36</value>
         </interrupt>
         <registers>
            <register>
               <name>CR1</name>
               <displayName>CR1</displayName>
               <description>control register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>RXFFIE</name>
                     <description>RXFIFO Full interrupt               enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RXFFIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>USART interrupt generated when RXFF = 1 in the USART_ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TXFEIE</name>
                     <description>TXFIFO empty interrupt               enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TXFEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>USART interrupt generated when TXFE = 1 in the USART_ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FIFOEN</name>
                     <description>FIFO mode enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>FIFOEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>FIFO mode is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>FIFO mode is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>M1</name>
                     <description>Word length</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>M1</name><usage>read-write</usage><enumeratedValue><name>M0</name><description>Use M0 to set the data bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit7</name><description>1 start bit, 7 data bits, n stop bits</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EOBIE</name>
                     <description>End of Block interrupt               enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOBIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>A USART interrupt is generated when the EOBF flag is set in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RTOIE</name>
                     <description>Receiver timeout interrupt               enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RTOIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>An USART interrupt is generated when the RTOF bit is set in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>OVER8</name>
                     <description>Oversampling mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>OVER8</name><usage>read-write</usage><enumeratedValue><name>Oversampling16</name><description>Oversampling by 16</description><value>0</value></enumeratedValue><enumeratedValue><name>Oversampling8</name><description>Oversampling by 8</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CMIE</name>
                     <description>Character match interrupt               enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CMIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated when the CMF bit is set in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>MME</name>
                     <description>Mute mode enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>MME</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Receiver in active mode permanently</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Receiver can switch between mute mode and active mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>M0</name>
                     <description>Word length</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>M0</name><usage>read-write</usage><enumeratedValue><name>Bit8</name><description>1 start bit, 8 data bits, n stop bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit9</name><description>1 start bit, 9 data bits, n stop bits</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>WAKE</name>
                     <description>Receiver wakeup method</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WAKE</name><usage>read-write</usage><enumeratedValue><name>Idle</name><description>Idle line</description><value>0</value></enumeratedValue><enumeratedValue><name>Address</name><description>Address mask</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PCE</name>
                     <description>Parity control enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PCE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Parity control disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Parity control enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PS</name>
                     <description>Parity selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PS</name><usage>read-write</usage><enumeratedValue><name>Even</name><description>Even parity</description><value>0</value></enumeratedValue><enumeratedValue><name>Odd</name><description>Odd parity</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PEIE</name>
                     <description>PE interrupt enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated whenever PE=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TXEIE</name>
                     <description>Transmit data register empty/TXFIFO not               full interrupt enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TXEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated whenever TXE=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TCIE</name>
                     <description>Transmission complete interrupt               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated whenever TC=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RXNEIE</name>
                     <description>Receive data register not empty/RXFIFO               not empty interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RXNEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated whenever ORE=1 or RXNE=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>IDLEIE</name>
                     <description>IDLE interrupt enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>IDLEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is generated whenever IDLE=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TE</name>
                     <description>Transmitter enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Transmitter is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Transmitter is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RE</name>
                     <description>Receiver enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Receiver is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Receiver is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UESM</name>
                     <description>USART enable in low-power               mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UESM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>USART not able to wake up the MCU from Stop mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>USART able to wake up the MCU from Stop mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UE</name>
                     <description>USART enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>UART is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>UART is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               <field><name>DEAT</name><description>Driver Enable assertion               time</description><bitOffset>21</bitOffset><bitWidth>5</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field><field><name>DEDT</name><description>Driver Enable deassertion               time</description><bitOffset>16</bitOffset><bitWidth>5</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field></fields>
            </register>
