tinygo-org/stm32-svd/svd/stm32wle5.svd
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>interrupt and status register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TXFT</name>
                     <description>TXFT</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFT</name>
                     <description>RXFT</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCBGT</name>
                     <description>TCBGT</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFF</name>
                     <description>RXFF</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFE</name>
                     <description>TXFE</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REACK</name>
                     <description>REACK</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEACK</name>
                     <description>TEACK</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUF</name>
                     <description>WUF</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWU</name>
                     <description>RWU</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SBKF</name>
                     <description>SBKF</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMF</name>
                     <description>CMF</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>BUSY</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABRF</name>
                     <description>ABRF</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABRE</name>
                     <description>ABRE</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDR</name>
                     <description>UDR</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOBF</name>
                     <description>EOBF</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTOF</name>
                     <description>RTOF</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTS</name>
                     <description>CTS</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSIF</name>
                     <description>CTSIF</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBDF</name>
                     <description>LBDF</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXE</name>
                     <description>TXE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC</name>
                     <description>TC</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXNE</name>
                     <description>RXNE</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>IDLE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ORE</name>
                     <description>ORE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NE</name>
                     <description>NE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FE</name>
                     <description>FE</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PE</name>
                     <description>PE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <displayName>ICR</displayName>
               <description>interrupt flag clear register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>WUCF</name>
                     <description>Wakeup from low-power mode clear               flag</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WUCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the WUF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CMCF</name>
                     <description>Character match clear flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CMCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the CMF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>UDRCF</name>
                     <description>SPI slave underrun clear               flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>UDRCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the UDR flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>EOBCF</name>
                     <description>End of block clear flag</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EOBCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the EOBF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>RTOCF</name>
                     <description>Receiver timeout clear               flag</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>RTOCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the RTOF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>CTSCF</name>
                     <description>CTS clear flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>CTSCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the CTSIF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>LBDCF</name>
                     <description>LIN break detection clear               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>LBDCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the LBDF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TCBGTCF</name>
                     <description>Transmission complete before Guard time               clear flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TCBGTCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the TCBGT flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TCCF</name>
                     <description>Transmission complete clear               flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TCCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the TC flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>TXFECF</name>
                     <description>TXFIFO empty clear flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>TXFECF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the TXFE flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>IDLECF</name>
                     <description>Idle line detected clear               flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>IDLECF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the IDLE flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ORECF</name>
                     <description>Overrun error clear flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>ORECF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the ORE flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>NCF</name>
                     <description>Noise detected clear flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>NCF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the NF flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>FECF</name>
                     <description>Framing error clear flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>FECF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the FE flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>PECF</name>
                     <description>Parity error clear flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>PECF</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clears the PE flag in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>RDR</name>
               <displayName>RDR</displayName>
               <description>receive data register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>RDR</name>
                     <description>Receive data value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>511</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>TDR</name>
               <displayName>TDR</displayName>
               <description>transmit data register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TDR</name>
                     <description>Transmit data value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>511</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>PRESC</name>
               <displayName>PRESC</displayName>
               <description>prescaler register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>PRESCALER</name>
                     <description>Clock prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  <enumeratedValues><name>PRESCALER</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>/1</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>/2</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>/4</description><value>2</value></enumeratedValue><enumeratedValue><name>Div6</name><description>/6</description><value>3</value></enumeratedValue><enumeratedValue><name>Div8</name><description>/8</description><value>4</value></enumeratedValue><enumeratedValue><name>Div10</name><description>/10</description><value>5</value></enumeratedValue><enumeratedValue><name>Div12</name><description>/12</description><value>6</value></enumeratedValue><enumeratedValue><name>Div16</name><description>/16</description><value>7</value></enumeratedValue><enumeratedValue><name>Div32</name><description>/32</description><value>8</value></enumeratedValue><enumeratedValue><name>Div64</name><description>/64</description><value>9</value></enumeratedValue><enumeratedValue><name>Div128</name><description>/128</description><value>10</value></enumeratedValue><enumeratedValue><name>Div256</name><description>/256</description><value>11</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>           
