tinygo-org/stm32-svd/svd/stm32wle5.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="USART1">
         <name>USART2</name>
         <baseAddress>0x40004400</baseAddress>
         <interrupt>
            <name>USART2</name>
            <description>USART2 global interrupt</description>
            <value>37</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>VREFBUF</name>
         <description>Voltage reference buffer</description>
         <groupName>VREFBUF</groupName>
         <baseAddress>0x40010030</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0xD0</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>control and status register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>VRR</name>
                     <description>Voltage reference buffer               ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  <enumeratedValues><name>VRR</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>The voltage reference buffer output is not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>The voltage reference buffer output reached the requested level</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>VRS</name>
                     <description>Voltage reference scale</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>VRS</name><usage>read-write</usage><enumeratedValue><name>V2_048</name><description>Voltage reference set to VREF_OUT1 (around 2.048 V)</description><value>0</value></enumeratedValue><enumeratedValue><name>V2_5</name><description>Voltage reference set to VREF_OUT2 (around 2.5 V)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>HIZ</name>
                     <description>High impedance mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>HIZ</name><usage>read-write</usage><enumeratedValue><name>Connected</name><description>VREF+ pin is internally connected to the voltage reference buffer output</description><value>0</value></enumeratedValue><enumeratedValue><name>HighZ</name><description>VREF+ pin is high impedance</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>ENVR</name>
                     <description>Voltage reference buffer mode               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  <enumeratedValues><name>ENVR</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Internal voltage reference mode disable (external voltage reference mode)</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Internal voltage reference mode (reference buffer enable or hold mode) enable</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
            <register>
               <name>CCR</name>
               <displayName>CCR</displayName>
               <description>calibration control register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRIM</name>
                     <description>Trimming code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>WWDG</name>
         <description>System window watchdog</description>
         <groupName>WWDG</groupName>
         <baseAddress>0x40002C00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>WWDG</name>
            <description>Window watchdog early wakeup interrupt</description>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000007F</resetValue>
               <fields>
                  <field>
                     <name>WDGA</name>
                     <description>Activation bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>WDGA</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Watchdog disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Watchdog enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>T</name>
                     <description>7-bit counter (MSB to LSB)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
               </fields>
            </register>
            <register>
               <name>CFR</name>
               <displayName>CFR</displayName>
               <description>Configuration register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x0000007F</resetValue>
               <fields>
                  <field>
                     <name>EWI</name>
                     <description>Early wakeup interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  <enumeratedValues><name>EWIW</name><usage>write</usage><enumeratedValue><name>Enable</name><description>interrupt occurs whenever the counter reaches the value 0x40</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
                  <field>
                     <name>W</name>
                     <description>7-bit window value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-write</access>
                  <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
               <field><name>WDGTB</name><description>Timer base</description><bitOffset>11</bitOffset><bitWidth>3</bitWidth><enumeratedValues><name>WDGTB</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>Counter clock (PCLK1 div 4096) div 1</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>Counter clock (PCLK1 div 4096) div 2</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>Counter clock (PCLK1 div 4096) div 4</description><value>2</value></enumeratedValue><enumeratedValue><name>Div8</name><description>Counter clock (PCLK1 div 4096) div 8</description><value>3</value></enumeratedValue></enumeratedValues>
            </field></fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>Status register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EWIF</name>
                     <description>Early wakeup interrupt               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  <enumeratedValues><name>EWIFR</name><usage>read</usage><enumeratedValue><name>Pending</name><description>The EWI Interrupt Service Routine has been triggered</description><value>1</value></enumeratedValue><enumeratedValue><name>Finished</name><description>The EWI Interrupt Service Routine has been serviced</description><value>0</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>EWIFW</name><usage>write</usage><enumeratedValue><name>Finished</name><description>The EWI Interrupt Service Routine has been serviced</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      </peripherals>
</device>